Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x470 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 17 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x89081): GNU C11 13.3.1 20240614 -mcpu=cortex-m3 -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x5d456): ../Core/Src/freertos.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x1b276): C:/Users/86173/Desktop/ProjectRequirement/MCU_Now/Lin_STM32/STM32_F103C8T6/6_LED_PC13_/6_LedFreertos_CubeIDE/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 18 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 4
    <2c>   DW_AT_encoding    : 5	(signed)
    <2d>   DW_AT_name        : int
 <1><31>: Abbrev Number: 2 (DW_TAG_base_type)
    <32>   DW_AT_byte_size   : 4
    <33>   DW_AT_encoding    : 7	(unsigned)
    <34>   DW_AT_name        : (indirect string, offset: 0xba44): unsigned int
 <1><38>: Abbrev Number: 2 (DW_TAG_base_type)
    <39>   DW_AT_byte_size   : 8
    <3a>   DW_AT_encoding    : 5	(signed)
    <3b>   DW_AT_name        : (indirect string, offset: 0x3ec7f): long long int
 <1><3f>: Abbrev Number: 2 (DW_TAG_base_type)
    <40>   DW_AT_byte_size   : 8
    <41>   DW_AT_encoding    : 4	(float)
    <42>   DW_AT_name        : (indirect string, offset: 0xd2df): long double
 <1><46>: Abbrev Number: 2 (DW_TAG_base_type)
    <47>   DW_AT_byte_size   : 1
    <48>   DW_AT_encoding    : 6	(signed char)
    <49>   DW_AT_name        : (indirect string, offset: 0x447af): signed char
 <1><4d>: Abbrev Number: 2 (DW_TAG_base_type)
    <4e>   DW_AT_byte_size   : 1
    <4f>   DW_AT_encoding    : 8	(unsigned char)
    <50>   DW_AT_name        : (indirect string, offset: 0x1bf6b): unsigned char
 <1><54>: Abbrev Number: 2 (DW_TAG_base_type)
    <55>   DW_AT_byte_size   : 2
    <56>   DW_AT_encoding    : 5	(signed)
    <57>   DW_AT_name        : (indirect string, offset: 0x66197): short int
 <1><5b>: Abbrev Number: 3 (DW_TAG_typedef)
    <5c>   DW_AT_name        : (indirect string, offset: 0x70628): __uint16_t
    <60>   DW_AT_decl_file   : 2
    <61>   DW_AT_decl_line   : 57
    <62>   DW_AT_decl_column : 25
    <63>   DW_AT_type        : <0x67>
 <1><67>: Abbrev Number: 2 (DW_TAG_base_type)
    <68>   DW_AT_byte_size   : 2
    <69>   DW_AT_encoding    : 7	(unsigned)
    <6a>   DW_AT_name        : (indirect string, offset: 0x2cc83): short unsigned int
 <1><6e>: Abbrev Number: 2 (DW_TAG_base_type)
    <6f>   DW_AT_byte_size   : 4
    <70>   DW_AT_encoding    : 5	(signed)
    <71>   DW_AT_name        : (indirect string, offset: 0xc07d): long int
 <1><75>: Abbrev Number: 3 (DW_TAG_typedef)
    <76>   DW_AT_name        : (indirect string, offset: 0x571ef): __uint32_t
    <7a>   DW_AT_decl_file   : 2
    <7b>   DW_AT_decl_line   : 79
    <7c>   DW_AT_decl_column : 25
    <7d>   DW_AT_type        : <0x81>
 <1><81>: Abbrev Number: 2 (DW_TAG_base_type)
    <82>   DW_AT_byte_size   : 4
    <83>   DW_AT_encoding    : 7	(unsigned)
    <84>   DW_AT_name        : (indirect string, offset: 0x20688): long unsigned int
 <1><88>: Abbrev Number: 2 (DW_TAG_base_type)
    <89>   DW_AT_byte_size   : 8
    <8a>   DW_AT_encoding    : 7	(unsigned)
    <8b>   DW_AT_name        : (indirect string, offset: 0x1c7b9): long long unsigned int
 <1><8f>: Abbrev Number: 3 (DW_TAG_typedef)
    <90>   DW_AT_name        : (indirect string, offset: 0x641f3): uint16_t
    <94>   DW_AT_decl_file   : 3
    <95>   DW_AT_decl_line   : 36
    <96>   DW_AT_decl_column : 20
    <97>   DW_AT_type        : <0x5b>
 <1><9b>: Abbrev Number: 3 (DW_TAG_typedef)
    <9c>   DW_AT_name        : (indirect string, offset: 0x63ab3): uint32_t
    <a0>   DW_AT_decl_file   : 3
    <a1>   DW_AT_decl_line   : 48
    <a2>   DW_AT_decl_column : 20
    <a3>   DW_AT_type        : <0x75>
 <1><a7>: Abbrev Number: 19 (DW_TAG_volatile_type)
    <a8>   DW_AT_type        : <0x9b>
 <1><ac>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <ad>   DW_AT_byte_size   : 4
    <ad>   DW_AT_type        : <0xb1>
 <1><b1>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <b2>   DW_AT_prototyped  : 1
    <b2>   DW_AT_sibling     : <0xbc>
 <2><b6>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <b7>   DW_AT_type        : <0xbc>
 <2><bb>: Abbrev Number: 0
 <1><bc>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <bd>   DW_AT_byte_size   : 4
 <1><be>: Abbrev Number: 2 (DW_TAG_base_type)
    <bf>   DW_AT_byte_size   : 1
    <c0>   DW_AT_encoding    : 8	(unsigned char)
    <c1>   DW_AT_name        : (indirect string, offset: 0x2c4fa): char
 <1><c5>: Abbrev Number: 10 (DW_TAG_const_type)
    <c6>   DW_AT_type        : <0xbe>
 <1><ca>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <cb>   DW_AT_byte_size   : 4
    <cb>   DW_AT_type        : <0xc5>
 <1><cf>: Abbrev Number: 22 (DW_TAG_structure_type)
    <d0>   DW_AT_byte_size   : 28
    <d1>   DW_AT_decl_file   : 4
    <d2>   DW_AT_decl_line   : 357
    <d4>   DW_AT_decl_column : 9
    <d5>   DW_AT_sibling     : <0x12e>
 <2><d9>: Abbrev Number: 7 (DW_TAG_member)
    <da>   DW_AT_name        : CRL
    <de>   DW_AT_decl_file   : 4
    <de>   DW_AT_decl_line   : 359
    <e0>   DW_AT_decl_column : 17
    <e0>   DW_AT_type        : <0xa7>
    <e4>   DW_AT_data_member_location: 0
 <2><e5>: Abbrev Number: 7 (DW_TAG_member)
    <e6>   DW_AT_name        : CRH
    <ea>   DW_AT_decl_file   : 4
    <ea>   DW_AT_decl_line   : 360
    <ec>   DW_AT_decl_column : 17
    <ec>   DW_AT_type        : <0xa7>
    <f0>   DW_AT_data_member_location: 4
 <2><f1>: Abbrev Number: 7 (DW_TAG_member)
    <f2>   DW_AT_name        : IDR
    <f6>   DW_AT_decl_file   : 4
    <f6>   DW_AT_decl_line   : 361
    <f8>   DW_AT_decl_column : 17
    <f8>   DW_AT_type        : <0xa7>
    <fc>   DW_AT_data_member_location: 8
 <2><fd>: Abbrev Number: 7 (DW_TAG_member)
    <fe>   DW_AT_name        : ODR
    <102>   DW_AT_decl_file   : 4
    <102>   DW_AT_decl_line   : 362
    <104>   DW_AT_decl_column : 17
    <104>   DW_AT_type        : <0xa7>
    <108>   DW_AT_data_member_location: 12
 <2><109>: Abbrev Number: 11 (DW_TAG_member)
    <10a>   DW_AT_name        : (indirect string, offset: 0x1ed9c): BSRR
    <10e>   DW_AT_decl_file   : 4
    <10e>   DW_AT_decl_line   : 363
    <110>   DW_AT_decl_column : 17
    <110>   DW_AT_type        : <0xa7>
    <114>   DW_AT_data_member_location: 16
 <2><115>: Abbrev Number: 7 (DW_TAG_member)
    <116>   DW_AT_name        : BRR
    <11a>   DW_AT_decl_file   : 4
    <11a>   DW_AT_decl_line   : 364
    <11c>   DW_AT_decl_column : 17
    <11c>   DW_AT_type        : <0xa7>
    <120>   DW_AT_data_member_location: 20
 <2><121>: Abbrev Number: 11 (DW_TAG_member)
    <122>   DW_AT_name        : (indirect string, offset: 0x75ef7): LCKR
    <126>   DW_AT_decl_file   : 4
    <126>   DW_AT_decl_line   : 365
    <128>   DW_AT_decl_column : 17
    <128>   DW_AT_type        : <0xa7>
    <12c>   DW_AT_data_member_location: 24
 <2><12d>: Abbrev Number: 0
 <1><12e>: Abbrev Number: 23 (DW_TAG_typedef)
    <12f>   DW_AT_name        : (indirect string, offset: 0x84a52): GPIO_TypeDef
    <133>   DW_AT_decl_file   : 4
    <134>   DW_AT_decl_line   : 366
    <136>   DW_AT_decl_column : 3
    <137>   DW_AT_type        : <0xcf>
 <1><13b>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <13c>   DW_AT_encoding    : 5	(signed)
    <13c>   DW_AT_byte_size   : 4
    <13c>   DW_AT_type        : <0x2a>
    <140>   DW_AT_decl_file   : 5
    <140>   DW_AT_decl_line   : 82
    <141>   DW_AT_decl_column : 14
    <141>   DW_AT_sibling     : <0x283>
 <2><145>: Abbrev Number: 1 (DW_TAG_enumerator)
    <146>   DW_AT_name        : (indirect string, offset: 0x2900c): osPriorityNone
    <14a>   DW_AT_const_value : 0
 <2><14b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <14c>   DW_AT_name        : (indirect string, offset: 0x7742c): osPriorityIdle
    <150>   DW_AT_const_value : 1
 <2><151>: Abbrev Number: 1 (DW_TAG_enumerator)
    <152>   DW_AT_name        : (indirect string, offset: 0x81557): osPriorityLow
    <156>   DW_AT_const_value : 8
 <2><157>: Abbrev Number: 1 (DW_TAG_enumerator)
    <158>   DW_AT_name        : (indirect string, offset: 0x81c98): osPriorityLow1
    <15c>   DW_AT_const_value : 9
 <2><15d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <15e>   DW_AT_name        : (indirect string, offset: 0x81ca7): osPriorityLow2
    <162>   DW_AT_const_value : 10
 <2><163>: Abbrev Number: 1 (DW_TAG_enumerator)
    <164>   DW_AT_name        : (indirect string, offset: 0x81cb6): osPriorityLow3
    <168>   DW_AT_const_value : 11
 <2><169>: Abbrev Number: 1 (DW_TAG_enumerator)
    <16a>   DW_AT_name        : (indirect string, offset: 0x81cc5): osPriorityLow4
    <16e>   DW_AT_const_value : 12
 <2><16f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <170>   DW_AT_name        : (indirect string, offset: 0x32fa2): osPriorityLow5
    <174>   DW_AT_const_value : 13
 <2><175>: Abbrev Number: 1 (DW_TAG_enumerator)
    <176>   DW_AT_name        : (indirect string, offset: 0x81d00): osPriorityLow6
    <17a>   DW_AT_const_value : 14
 <2><17b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <17c>   DW_AT_name        : (indirect string, offset: 0x81d0f): osPriorityLow7
    <180>   DW_AT_const_value : 15
 <2><181>: Abbrev Number: 1 (DW_TAG_enumerator)
    <182>   DW_AT_name        : (indirect string, offset: 0x837cb): osPriorityBelowNormal
    <186>   DW_AT_const_value : 16
 <2><187>: Abbrev Number: 1 (DW_TAG_enumerator)
    <188>   DW_AT_name        : (indirect string, offset: 0x46977): osPriorityBelowNormal1
    <18c>   DW_AT_const_value : 17
 <2><18d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <18e>   DW_AT_name        : (indirect string, offset: 0x74ad2): osPriorityBelowNormal2
    <192>   DW_AT_const_value : 18
 <2><193>: Abbrev Number: 1 (DW_TAG_enumerator)
    <194>   DW_AT_name        : (indirect string, offset: 0x5223f): osPriorityBelowNormal3
    <198>   DW_AT_const_value : 19
 <2><199>: Abbrev Number: 1 (DW_TAG_enumerator)
    <19a>   DW_AT_name        : (indirect string, offset: 0x74b07): osPriorityBelowNormal4
    <19e>   DW_AT_const_value : 20
 <2><19f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1a0>   DW_AT_name        : (indirect string, offset: 0x74b1e): osPriorityBelowNormal5
    <1a4>   DW_AT_const_value : 21
 <2><1a5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1a6>   DW_AT_name        : (indirect string, offset: 0x74b35): osPriorityBelowNormal6
    <1aa>   DW_AT_const_value : 22
 <2><1ab>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1ac>   DW_AT_name        : (indirect string, offset: 0x74b4c): osPriorityBelowNormal7
    <1b0>   DW_AT_const_value : 23
 <2><1b1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1b2>   DW_AT_name        : (indirect string, offset: 0x701dc): osPriorityNormal
    <1b6>   DW_AT_const_value : 24
 <2><1b7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1b8>   DW_AT_name        : (indirect string, offset: 0x16176): osPriorityNormal1
    <1bc>   DW_AT_const_value : 25
 <2><1bd>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1be>   DW_AT_name        : (indirect string, offset: 0x16188): osPriorityNormal2
    <1c2>   DW_AT_const_value : 26
 <2><1c3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1c4>   DW_AT_name        : (indirect string, offset: 0x1619a): osPriorityNormal3
    <1c8>   DW_AT_const_value : 27
 <2><1c9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1ca>   DW_AT_name        : (indirect string, offset: 0x161ac): osPriorityNormal4
    <1ce>   DW_AT_const_value : 28
 <2><1cf>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1d0>   DW_AT_name        : (indirect string, offset: 0x161be): osPriorityNormal5
    <1d4>   DW_AT_const_value : 29
 <2><1d5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1d6>   DW_AT_name        : (indirect string, offset: 0x161d0): osPriorityNormal6
    <1da>   DW_AT_const_value : 30
 <2><1db>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1dc>   DW_AT_name        : (indirect string, offset: 0x161e2): osPriorityNormal7
    <1e0>   DW_AT_const_value : 31
 <2><1e1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1e2>   DW_AT_name        : (indirect string, offset: 0x21a29): osPriorityAboveNormal
    <1e6>   DW_AT_const_value : 32
 <2><1e7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1e8>   DW_AT_name        : (indirect string, offset: 0x8876c): osPriorityAboveNormal1
    <1ec>   DW_AT_const_value : 33
 <2><1ed>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1ee>   DW_AT_name        : (indirect string, offset: 0x80c6b): osPriorityAboveNormal2
    <1f2>   DW_AT_const_value : 34
 <2><1f3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1f4>   DW_AT_name        : (indirect string, offset: 0x887a3): osPriorityAboveNormal3
    <1f8>   DW_AT_const_value : 35
 <2><1f9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1fa>   DW_AT_name        : (indirect string, offset: 0x887ba): osPriorityAboveNormal4
    <1fe>   DW_AT_const_value : 36
 <2><1ff>: Abbrev Number: 1 (DW_TAG_enumerator)
    <200>   DW_AT_name        : (indirect string, offset: 0x80ccb): osPriorityAboveNormal5
    <204>   DW_AT_const_value : 37
 <2><205>: Abbrev Number: 1 (DW_TAG_enumerator)
    <206>   DW_AT_name        : (indirect string, offset: 0x887e7): osPriorityAboveNormal6
    <20a>   DW_AT_const_value : 38
 <2><20b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <20c>   DW_AT_name        : (indirect string, offset: 0x887fe): osPriorityAboveNormal7
    <210>   DW_AT_const_value : 39
 <2><211>: Abbrev Number: 1 (DW_TAG_enumerator)
    <212>   DW_AT_name        : (indirect string, offset: 0x1aaed): osPriorityHigh
    <216>   DW_AT_const_value : 40
 <2><217>: Abbrev Number: 1 (DW_TAG_enumerator)
    <218>   DW_AT_name        : (indirect string, offset: 0x5ac14): osPriorityHigh1
    <21c>   DW_AT_const_value : 41
 <2><21d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <21e>   DW_AT_name        : (indirect string, offset: 0x5ac24): osPriorityHigh2
    <222>   DW_AT_const_value : 42
 <2><223>: Abbrev Number: 1 (DW_TAG_enumerator)
    <224>   DW_AT_name        : (indirect string, offset: 0x5ac34): osPriorityHigh3
    <228>   DW_AT_const_value : 43
 <2><229>: Abbrev Number: 1 (DW_TAG_enumerator)
    <22a>   DW_AT_name        : (indirect string, offset: 0x5ac44): osPriorityHigh4
    <22e>   DW_AT_const_value : 44
 <2><22f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <230>   DW_AT_name        : (indirect string, offset: 0x2e59): osPriorityHigh5
    <234>   DW_AT_const_value : 45
 <2><235>: Abbrev Number: 1 (DW_TAG_enumerator)
    <236>   DW_AT_name        : (indirect string, offset: 0x5ac80): osPriorityHigh6
    <23a>   DW_AT_const_value : 46
 <2><23b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <23c>   DW_AT_name        : (indirect string, offset: 0x5ac90): osPriorityHigh7
    <240>   DW_AT_const_value : 47
 <2><241>: Abbrev Number: 1 (DW_TAG_enumerator)
    <242>   DW_AT_name        : (indirect string, offset: 0x7c4ba): osPriorityRealtime
    <246>   DW_AT_const_value : 48
 <2><247>: Abbrev Number: 1 (DW_TAG_enumerator)
    <248>   DW_AT_name        : (indirect string, offset: 0x55c89): osPriorityRealtime1
    <24c>   DW_AT_const_value : 49
 <2><24d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <24e>   DW_AT_name        : (indirect string, offset: 0x55c9d): osPriorityRealtime2
    <252>   DW_AT_const_value : 50
 <2><253>: Abbrev Number: 1 (DW_TAG_enumerator)
    <254>   DW_AT_name        : (indirect string, offset: 0x55cb1): osPriorityRealtime3
    <258>   DW_AT_const_value : 51
 <2><259>: Abbrev Number: 1 (DW_TAG_enumerator)
    <25a>   DW_AT_name        : (indirect string, offset: 0x55cc5): osPriorityRealtime4
    <25e>   DW_AT_const_value : 52
 <2><25f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <260>   DW_AT_name        : (indirect string, offset: 0x55cd9): osPriorityRealtime5
    <264>   DW_AT_const_value : 53
 <2><265>: Abbrev Number: 1 (DW_TAG_enumerator)
    <266>   DW_AT_name        : (indirect string, offset: 0x55ced): osPriorityRealtime6
    <26a>   DW_AT_const_value : 54
 <2><26b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <26c>   DW_AT_name        : (indirect string, offset: 0x55d01): osPriorityRealtime7
    <270>   DW_AT_const_value : 55
 <2><271>: Abbrev Number: 1 (DW_TAG_enumerator)
    <272>   DW_AT_name        : (indirect string, offset: 0x4c07b): osPriorityISR
    <276>   DW_AT_const_value : 56
 <2><277>: Abbrev Number: 6 (DW_TAG_enumerator)
    <278>   DW_AT_name        : (indirect string, offset: 0x792e8): osPriorityError
    <27c>   DW_AT_const_value : -1
 <2><27d>: Abbrev Number: 13 (DW_TAG_enumerator)
    <27e>   DW_AT_name        : (indirect string, offset: 0x7667d): osPriorityReserved
    <282>   DW_AT_const_value : 2147483647
 <2><282>: Abbrev Number: 0
 <1><283>: Abbrev Number: 3 (DW_TAG_typedef)
    <284>   DW_AT_name        : (indirect string, offset: 0x1f433): osPriority_t
    <288>   DW_AT_decl_file   : 5
    <289>   DW_AT_decl_line   : 136
    <28a>   DW_AT_decl_column : 3
    <28b>   DW_AT_type        : <0x13b>
 <1><28f>: Abbrev Number: 3 (DW_TAG_typedef)
    <290>   DW_AT_name        : (indirect string, offset: 0x49f7d): osThreadFunc_t
    <294>   DW_AT_decl_file   : 5
    <295>   DW_AT_decl_line   : 139
    <296>   DW_AT_decl_column : 16
    <297>   DW_AT_type        : <0xac>
 <1><29b>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <29c>   DW_AT_encoding    : 5	(signed)
    <29c>   DW_AT_byte_size   : 4
    <29c>   DW_AT_type        : <0x2a>
    <2a0>   DW_AT_decl_file   : 5
    <2a0>   DW_AT_decl_line   : 176
    <2a1>   DW_AT_decl_column : 14
    <2a1>   DW_AT_sibling     : <0x2d5>
 <2><2a5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <2a6>   DW_AT_name        : (indirect string, offset: 0x7912d): osOK
    <2aa>   DW_AT_const_value : 0
 <2><2ab>: Abbrev Number: 6 (DW_TAG_enumerator)
    <2ac>   DW_AT_name        : (indirect string, offset: 0x3f82a): osError
    <2b0>   DW_AT_const_value : -1
 <2><2b1>: Abbrev Number: 6 (DW_TAG_enumerator)
    <2b2>   DW_AT_name        : (indirect string, offset: 0x7bd66): osErrorTimeout
    <2b6>   DW_AT_const_value : -2
 <2><2b7>: Abbrev Number: 6 (DW_TAG_enumerator)
    <2b8>   DW_AT_name        : (indirect string, offset: 0x59730): osErrorResource
    <2bc>   DW_AT_const_value : -3
 <2><2bd>: Abbrev Number: 6 (DW_TAG_enumerator)
    <2be>   DW_AT_name        : (indirect string, offset: 0x239b6): osErrorParameter
    <2c2>   DW_AT_const_value : -4
 <2><2c3>: Abbrev Number: 6 (DW_TAG_enumerator)
    <2c4>   DW_AT_name        : (indirect string, offset: 0x17f31): osErrorNoMemory
    <2c8>   DW_AT_const_value : -5
 <2><2c9>: Abbrev Number: 6 (DW_TAG_enumerator)
    <2ca>   DW_AT_name        : (indirect string, offset: 0x24dfd): osErrorISR
    <2ce>   DW_AT_const_value : -6
 <2><2cf>: Abbrev Number: 13 (DW_TAG_enumerator)
    <2d0>   DW_AT_name        : (indirect string, offset: 0x44db7): osStatusReserved
    <2d4>   DW_AT_const_value : 2147483647
 <2><2d4>: Abbrev Number: 0
 <1><2d5>: Abbrev Number: 3 (DW_TAG_typedef)
    <2d6>   DW_AT_name        : (indirect string, offset: 0x2ea83): osStatus_t
    <2da>   DW_AT_decl_file   : 5
    <2db>   DW_AT_decl_line   : 185
    <2dc>   DW_AT_decl_column : 3
    <2dd>   DW_AT_type        : <0x29b>
 <1><2e1>: Abbrev Number: 3 (DW_TAG_typedef)
    <2e2>   DW_AT_name        : (indirect string, offset: 0x30da8): osThreadId_t
    <2e6>   DW_AT_decl_file   : 5
    <2e7>   DW_AT_decl_line   : 189
    <2e8>   DW_AT_decl_column : 15
    <2e9>   DW_AT_type        : <0xbc>
 <1><2ed>: Abbrev Number: 3 (DW_TAG_typedef)
    <2ee>   DW_AT_name        : (indirect string, offset: 0x5bfad): TZ_ModuleId_t
    <2f2>   DW_AT_decl_file   : 5
    <2f3>   DW_AT_decl_line   : 213
    <2f4>   DW_AT_decl_column : 18
    <2f5>   DW_AT_type        : <0x9b>
 <1><2f9>: Abbrev Number: 24 (DW_TAG_structure_type)
    <2fa>   DW_AT_byte_size   : 36
    <2fb>   DW_AT_decl_file   : 5
    <2fc>   DW_AT_decl_line   : 218
    <2fd>   DW_AT_decl_column : 9
    <2fe>   DW_AT_sibling     : <0x36f>
 <2><302>: Abbrev Number: 4 (DW_TAG_member)
    <303>   DW_AT_name        : (indirect string, offset: 0x7adb0): name
    <307>   DW_AT_decl_file   : 5
    <307>   DW_AT_decl_line   : 219
    <308>   DW_AT_decl_column : 33
    <309>   DW_AT_type        : <0xca>
    <30d>   DW_AT_data_member_location: 0
 <2><30e>: Abbrev Number: 4 (DW_TAG_member)
    <30f>   DW_AT_name        : (indirect string, offset: 0x595bd): attr_bits
    <313>   DW_AT_decl_file   : 5
    <313>   DW_AT_decl_line   : 220
    <314>   DW_AT_decl_column : 28
    <315>   DW_AT_type        : <0x9b>
    <319>   DW_AT_data_member_location: 4
 <2><31a>: Abbrev Number: 4 (DW_TAG_member)
    <31b>   DW_AT_name        : (indirect string, offset: 0x1aedc): cb_mem
    <31f>   DW_AT_decl_file   : 5
    <31f>   DW_AT_decl_line   : 221
    <320>   DW_AT_decl_column : 30
    <321>   DW_AT_type        : <0xbc>
    <325>   DW_AT_data_member_location: 8
 <2><326>: Abbrev Number: 4 (DW_TAG_member)
    <327>   DW_AT_name        : (indirect string, offset: 0xfa89): cb_size
    <32b>   DW_AT_decl_file   : 5
    <32b>   DW_AT_decl_line   : 222
    <32c>   DW_AT_decl_column : 30
    <32d>   DW_AT_type        : <0x9b>
    <331>   DW_AT_data_member_location: 12
 <2><332>: Abbrev Number: 4 (DW_TAG_member)
    <333>   DW_AT_name        : (indirect string, offset: 0x7ca55): stack_mem
    <337>   DW_AT_decl_file   : 5
    <337>   DW_AT_decl_line   : 223
    <338>   DW_AT_decl_column : 27
    <339>   DW_AT_type        : <0xbc>
    <33d>   DW_AT_data_member_location: 16
 <2><33e>: Abbrev Number: 4 (DW_TAG_member)
    <33f>   DW_AT_name        : (indirect string, offset: 0x55d15): stack_size
    <343>   DW_AT_decl_file   : 5
    <343>   DW_AT_decl_line   : 224
    <344>   DW_AT_decl_column : 27
    <345>   DW_AT_type        : <0x9b>
    <349>   DW_AT_data_member_location: 20
 <2><34a>: Abbrev Number: 4 (DW_TAG_member)
    <34b>   DW_AT_name        : (indirect string, offset: 0x364d0): priority
    <34f>   DW_AT_decl_file   : 5
    <34f>   DW_AT_decl_line   : 225
    <350>   DW_AT_decl_column : 29
    <351>   DW_AT_type        : <0x283>
    <355>   DW_AT_data_member_location: 24
 <2><356>: Abbrev Number: 4 (DW_TAG_member)
    <357>   DW_AT_name        : (indirect string, offset: 0x3ab9f): tz_module
    <35b>   DW_AT_decl_file   : 5
    <35b>   DW_AT_decl_line   : 226
    <35c>   DW_AT_decl_column : 28
    <35d>   DW_AT_type        : <0x2ed>
    <361>   DW_AT_data_member_location: 28
 <2><362>: Abbrev Number: 4 (DW_TAG_member)
    <363>   DW_AT_name        : (indirect string, offset: 0x7b5de): reserved
    <367>   DW_AT_decl_file   : 5
    <367>   DW_AT_decl_line   : 227
    <368>   DW_AT_decl_column : 29
    <369>   DW_AT_type        : <0x9b>
    <36d>   DW_AT_data_member_location: 32
 <2><36e>: Abbrev Number: 0
 <1><36f>: Abbrev Number: 3 (DW_TAG_typedef)
    <370>   DW_AT_name        : (indirect string, offset: 0x160e2): osThreadAttr_t
    <374>   DW_AT_decl_file   : 5
    <375>   DW_AT_decl_line   : 228
    <376>   DW_AT_decl_column : 3
    <377>   DW_AT_type        : <0x2f9>
 <1><37b>: Abbrev Number: 10 (DW_TAG_const_type)
    <37c>   DW_AT_type        : <0x36f>
 <1><380>: Abbrev Number: 9 (DW_TAG_variable)
    <381>   DW_AT_name        : (indirect string, offset: 0x49dae): HeartTaskHandle
    <385>   DW_AT_decl_file   : 1
    <385>   DW_AT_decl_line   : 51
    <386>   DW_AT_decl_column : 14
    <387>   DW_AT_type        : <0x2e1>
    <38b>   DW_AT_external    : 1
    <38b>   DW_AT_location    : 5 byte block: 3 7c 0 0 20 	(DW_OP_addr: 2000007c)
 <1><391>: Abbrev Number: 9 (DW_TAG_variable)
    <392>   DW_AT_name        : (indirect string, offset: 0x22d0): HeartTask_attributes
    <396>   DW_AT_decl_file   : 1
    <396>   DW_AT_decl_line   : 52
    <397>   DW_AT_decl_column : 22
    <398>   DW_AT_type        : <0x37b>
    <39c>   DW_AT_external    : 1
    <39c>   DW_AT_location    : 5 byte block: 3 2c 45 0 8 	(DW_OP_addr: 800452c)
 <1><3a2>: Abbrev Number: 9 (DW_TAG_variable)
    <3a3>   DW_AT_name        : (indirect string, offset: 0x10b28): Pc14TaskHandle
    <3a7>   DW_AT_decl_file   : 1
    <3a7>   DW_AT_decl_line   : 58
    <3a8>   DW_AT_decl_column : 14
    <3a9>   DW_AT_type        : <0x2e1>
    <3ad>   DW_AT_external    : 1
    <3ad>   DW_AT_location    : 5 byte block: 3 80 0 0 20 	(DW_OP_addr: 20000080)
 <1><3b3>: Abbrev Number: 9 (DW_TAG_variable)
    <3b4>   DW_AT_name        : (indirect string, offset: 0x3e677): Pc14Task_attributes
    <3b8>   DW_AT_decl_file   : 1
    <3b8>   DW_AT_decl_line   : 59
    <3b9>   DW_AT_decl_column : 22
    <3ba>   DW_AT_type        : <0x37b>
    <3be>   DW_AT_external    : 1
    <3be>   DW_AT_location    : 5 byte block: 3 50 45 0 8 	(DW_OP_addr: 8004550)
 <1><3c4>: Abbrev Number: 14 (DW_TAG_subprogram)
    <3c5>   DW_AT_external    : 1
    <3c5>   DW_AT_name        : (indirect string, offset: 0x70a16): osDelay
    <3c9>   DW_AT_decl_file   : 5
    <3c9>   DW_AT_decl_line   : 459
    <3cb>   DW_AT_decl_column : 12
    <3cc>   DW_AT_prototyped  : 1
    <3cc>   DW_AT_type        : <0x2d5>
    <3d0>   DW_AT_declaration : 1
    <3d0>   DW_AT_sibling     : <0x3da>
 <2><3d4>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <3d5>   DW_AT_type        : <0x9b>
 <2><3d9>: Abbrev Number: 0
 <1><3da>: Abbrev Number: 25 (DW_TAG_subprogram)
    <3db>   DW_AT_external    : 1
    <3db>   DW_AT_name        : (indirect string, offset: 0x29f31): HAL_GPIO_TogglePin
    <3df>   DW_AT_decl_file   : 6
    <3e0>   DW_AT_decl_line   : 235
    <3e1>   DW_AT_decl_column : 6
    <3e2>   DW_AT_prototyped  : 1
    <3e2>   DW_AT_declaration : 1
    <3e2>   DW_AT_sibling     : <0x3f1>
 <2><3e6>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <3e7>   DW_AT_type        : <0x3f1>
 <2><3eb>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <3ec>   DW_AT_type        : <0x8f>
 <2><3f0>: Abbrev Number: 0
 <1><3f1>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <3f2>   DW_AT_byte_size   : 4
    <3f2>   DW_AT_type        : <0x12e>
 <1><3f6>: Abbrev Number: 14 (DW_TAG_subprogram)
    <3f7>   DW_AT_external    : 1
    <3f7>   DW_AT_name        : (indirect string, offset: 0x4ba69): osThreadNew
    <3fb>   DW_AT_decl_file   : 5
    <3fb>   DW_AT_decl_line   : 349
    <3fd>   DW_AT_decl_column : 14
    <3fe>   DW_AT_prototyped  : 1
    <3fe>   DW_AT_type        : <0x2e1>
    <402>   DW_AT_declaration : 1
    <402>   DW_AT_sibling     : <0x416>
 <2><406>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <407>   DW_AT_type        : <0x28f>
 <2><40b>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <40c>   DW_AT_type        : <0xbc>
 <2><410>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <411>   DW_AT_type        : <0x416>
 <2><415>: Abbrev Number: 0
 <1><416>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <417>   DW_AT_byte_size   : 4
    <417>   DW_AT_type        : <0x37b>
 <1><41b>: Abbrev Number: 15 (DW_TAG_subprogram)
    <41c>   DW_AT_external    : 1
    <41c>   DW_AT_name        : (indirect string, offset: 0x1ace4): Start_Pc14
    <420>   DW_AT_decl_file   : 1
    <420>   DW_AT_decl_line   : 145
    <421>   DW_AT_decl_column : 6
    <421>   DW_AT_prototyped  : 1
    <421>   DW_AT_low_pc      : 0x80001b0
    <425>   DW_AT_high_pc     : 0x20
    <429>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <42b>   DW_AT_call_all_tail_calls: 1
    <42b>   DW_AT_sibling     : <0x43e>
 <2><42f>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <430>   DW_AT_name        : (indirect string, offset: 0x1d68e): argument
    <434>   DW_AT_decl_file   : 1
    <434>   DW_AT_decl_line   : 145
    <435>   DW_AT_decl_column : 23
    <436>   DW_AT_type        : <0xbc>
    <43a>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><43d>: Abbrev Number: 0
 <1><43e>: Abbrev Number: 15 (DW_TAG_subprogram)
    <43f>   DW_AT_external    : 1
    <43f>   DW_AT_name        : (indirect string, offset: 0x760e1): Start_Heart
    <443>   DW_AT_decl_file   : 1
    <443>   DW_AT_decl_line   : 125
    <444>   DW_AT_decl_column : 6
    <444>   DW_AT_prototyped  : 1
    <444>   DW_AT_low_pc      : 0x8000190
    <448>   DW_AT_high_pc     : 0x20
    <44c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <44e>   DW_AT_call_all_tail_calls: 1
    <44e>   DW_AT_sibling     : <0x461>
 <2><452>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <453>   DW_AT_name        : (indirect string, offset: 0x1d68e): argument
    <457>   DW_AT_decl_file   : 1
    <457>   DW_AT_decl_line   : 125
    <458>   DW_AT_decl_column : 24
    <459>   DW_AT_type        : <0xbc>
    <45d>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><460>: Abbrev Number: 0
 <1><461>: Abbrev Number: 26 (DW_TAG_subprogram)
    <462>   DW_AT_external    : 1
    <462>   DW_AT_name        : (indirect string, offset: 0x20001): MX_FREERTOS_Init
    <466>   DW_AT_decl_file   : 1
    <467>   DW_AT_decl_line   : 80
    <468>   DW_AT_decl_column : 6
    <469>   DW_AT_prototyped  : 1
    <469>   DW_AT_low_pc      : 0x8000150
    <46d>   DW_AT_high_pc     : 0x40
    <471>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <473>   DW_AT_call_all_tail_calls: 1
 <1><473>: Abbrev Number: 0
  Compilation Unit @ offset 0x474:
   Length:        0x2b3 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x18f
   Pointer Size:  4
 <0><480>: Abbrev Number: 14 (DW_TAG_compile_unit)
    <481>   DW_AT_producer    : (indirect string, offset: 0x89081): GNU C11 13.3.1 20240614 -mcpu=cortex-m3 -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <485>   DW_AT_language    : 29	(C11)
    <486>   DW_AT_name        : (indirect string, offset: 0x89754): ../Core/Src/gpio.c
    <48a>   DW_AT_comp_dir    : (indirect string, offset: 0x1b276): C:/Users/86173/Desktop/ProjectRequirement/MCU_Now/Lin_STM32/STM32_F103C8T6/6_LED_PC13_/6_LedFreertos_CubeIDE/Debug
    <48e>   DW_AT_ranges      : 0x2b
    <492>   DW_AT_low_pc      : 0
    <496>   DW_AT_stmt_list   : 0xb5c
    <49a>   DW_AT_macros      : 0x16ba8
 <1><49e>: Abbrev Number: 1 (DW_TAG_base_type)
    <49f>   DW_AT_byte_size   : 1
    <4a0>   DW_AT_encoding    : 6	(signed char)
    <4a1>   DW_AT_name        : (indirect string, offset: 0x447af): signed char
 <1><4a5>: Abbrev Number: 1 (DW_TAG_base_type)
    <4a6>   DW_AT_byte_size   : 1
    <4a7>   DW_AT_encoding    : 8	(unsigned char)
    <4a8>   DW_AT_name        : (indirect string, offset: 0x1bf6b): unsigned char
 <1><4ac>: Abbrev Number: 1 (DW_TAG_base_type)
    <4ad>   DW_AT_byte_size   : 2
    <4ae>   DW_AT_encoding    : 5	(signed)
    <4af>   DW_AT_name        : (indirect string, offset: 0x66197): short int
 <1><4b3>: Abbrev Number: 4 (DW_TAG_typedef)
    <4b4>   DW_AT_name        : (indirect string, offset: 0x70628): __uint16_t
    <4b8>   DW_AT_decl_file   : 2
    <4b9>   DW_AT_decl_line   : 57
    <4ba>   DW_AT_decl_column : 25
    <4bb>   DW_AT_type        : <0x4bf>
 <1><4bf>: Abbrev Number: 1 (DW_TAG_base_type)
    <4c0>   DW_AT_byte_size   : 2
    <4c1>   DW_AT_encoding    : 7	(unsigned)
    <4c2>   DW_AT_name        : (indirect string, offset: 0x2cc83): short unsigned int
 <1><4c6>: Abbrev Number: 1 (DW_TAG_base_type)
    <4c7>   DW_AT_byte_size   : 4
    <4c8>   DW_AT_encoding    : 5	(signed)
    <4c9>   DW_AT_name        : (indirect string, offset: 0xc07d): long int
 <1><4cd>: Abbrev Number: 4 (DW_TAG_typedef)
    <4ce>   DW_AT_name        : (indirect string, offset: 0x571ef): __uint32_t
    <4d2>   DW_AT_decl_file   : 2
    <4d3>   DW_AT_decl_line   : 79
    <4d4>   DW_AT_decl_column : 25
    <4d5>   DW_AT_type        : <0x4d9>
 <1><4d9>: Abbrev Number: 1 (DW_TAG_base_type)
    <4da>   DW_AT_byte_size   : 4
    <4db>   DW_AT_encoding    : 7	(unsigned)
    <4dc>   DW_AT_name        : (indirect string, offset: 0x20688): long unsigned int
 <1><4e0>: Abbrev Number: 1 (DW_TAG_base_type)
    <4e1>   DW_AT_byte_size   : 8
    <4e2>   DW_AT_encoding    : 5	(signed)
    <4e3>   DW_AT_name        : (indirect string, offset: 0x3ec7f): long long int
 <1><4e7>: Abbrev Number: 1 (DW_TAG_base_type)
    <4e8>   DW_AT_byte_size   : 8
    <4e9>   DW_AT_encoding    : 7	(unsigned)
    <4ea>   DW_AT_name        : (indirect string, offset: 0x1c7b9): long long unsigned int
 <1><4ee>: Abbrev Number: 15 (DW_TAG_base_type)
    <4ef>   DW_AT_byte_size   : 4
    <4f0>   DW_AT_encoding    : 5	(signed)
    <4f1>   DW_AT_name        : int
 <1><4f5>: Abbrev Number: 1 (DW_TAG_base_type)
    <4f6>   DW_AT_byte_size   : 4
    <4f7>   DW_AT_encoding    : 7	(unsigned)
    <4f8>   DW_AT_name        : (indirect string, offset: 0xba44): unsigned int
 <1><4fc>: Abbrev Number: 4 (DW_TAG_typedef)
    <4fd>   DW_AT_name        : (indirect string, offset: 0x641f3): uint16_t
    <501>   DW_AT_decl_file   : 3
    <502>   DW_AT_decl_line   : 36
    <503>   DW_AT_decl_column : 20
    <504>   DW_AT_type        : <0x4b3>
 <1><508>: Abbrev Number: 4 (DW_TAG_typedef)
    <509>   DW_AT_name        : (indirect string, offset: 0x63ab3): uint32_t
    <50d>   DW_AT_decl_file   : 3
    <50e>   DW_AT_decl_line   : 48
    <50f>   DW_AT_decl_column : 20
    <510>   DW_AT_type        : <0x4cd>
 <1><514>: Abbrev Number: 16 (DW_TAG_volatile_type)
    <515>   DW_AT_type        : <0x508>
 <1><519>: Abbrev Number: 8 (DW_TAG_structure_type)
    <51a>   DW_AT_byte_size   : 28
    <51b>   DW_AT_decl_file   : 4
    <51b>   DW_AT_decl_line   : 357
    <51d>   DW_AT_decl_column : 9
    <51d>   DW_AT_sibling     : <0x576>
 <2><521>: Abbrev Number: 3 (DW_TAG_member)
    <522>   DW_AT_name        : CRL
    <526>   DW_AT_decl_file   : 4
    <526>   DW_AT_decl_line   : 359
    <528>   DW_AT_decl_column : 17
    <528>   DW_AT_type        : <0x514>
    <52c>   DW_AT_data_member_location: 0
 <2><52d>: Abbrev Number: 3 (DW_TAG_member)
    <52e>   DW_AT_name        : CRH
    <532>   DW_AT_decl_file   : 4
    <532>   DW_AT_decl_line   : 360
    <534>   DW_AT_decl_column : 17
    <534>   DW_AT_type        : <0x514>
    <538>   DW_AT_data_member_location: 4
 <2><539>: Abbrev Number: 3 (DW_TAG_member)
    <53a>   DW_AT_name        : IDR
    <53e>   DW_AT_decl_file   : 4
    <53e>   DW_AT_decl_line   : 361
    <540>   DW_AT_decl_column : 17
    <540>   DW_AT_type        : <0x514>
    <544>   DW_AT_data_member_location: 8
 <2><545>: Abbrev Number: 3 (DW_TAG_member)
    <546>   DW_AT_name        : ODR
    <54a>   DW_AT_decl_file   : 4
    <54a>   DW_AT_decl_line   : 362
    <54c>   DW_AT_decl_column : 17
    <54c>   DW_AT_type        : <0x514>
    <550>   DW_AT_data_member_location: 12
 <2><551>: Abbrev Number: 2 (DW_TAG_member)
    <552>   DW_AT_name        : (indirect string, offset: 0x1ed9c): BSRR
    <556>   DW_AT_decl_file   : 4
    <556>   DW_AT_decl_line   : 363
    <558>   DW_AT_decl_column : 17
    <558>   DW_AT_type        : <0x514>
    <55c>   DW_AT_data_member_location: 16
 <2><55d>: Abbrev Number: 3 (DW_TAG_member)
    <55e>   DW_AT_name        : BRR
    <562>   DW_AT_decl_file   : 4
    <562>   DW_AT_decl_line   : 364
    <564>   DW_AT_decl_column : 17
    <564>   DW_AT_type        : <0x514>
    <568>   DW_AT_data_member_location: 20
 <2><569>: Abbrev Number: 2 (DW_TAG_member)
    <56a>   DW_AT_name        : (indirect string, offset: 0x75ef7): LCKR
    <56e>   DW_AT_decl_file   : 4
    <56e>   DW_AT_decl_line   : 365
    <570>   DW_AT_decl_column : 17
    <570>   DW_AT_type        : <0x514>
    <574>   DW_AT_data_member_location: 24
 <2><575>: Abbrev Number: 0
 <1><576>: Abbrev Number: 9 (DW_TAG_typedef)
    <577>   DW_AT_name        : (indirect string, offset: 0x84a52): GPIO_TypeDef
    <57b>   DW_AT_decl_file   : 4
    <57b>   DW_AT_decl_line   : 366
    <57d>   DW_AT_decl_column : 3
    <57d>   DW_AT_type        : <0x519>
 <1><581>: Abbrev Number: 8 (DW_TAG_structure_type)
    <582>   DW_AT_byte_size   : 40
    <583>   DW_AT_decl_file   : 4
    <583>   DW_AT_decl_line   : 423
    <585>   DW_AT_decl_column : 9
    <585>   DW_AT_sibling     : <0x601>
 <2><589>: Abbrev Number: 3 (DW_TAG_member)
    <58a>   DW_AT_name        : CR
    <58d>   DW_AT_decl_file   : 4
    <58d>   DW_AT_decl_line   : 425
    <58f>   DW_AT_decl_column : 17
    <58f>   DW_AT_type        : <0x514>
    <593>   DW_AT_data_member_location: 0
 <2><594>: Abbrev Number: 2 (DW_TAG_member)
    <595>   DW_AT_name        : (indirect string, offset: 0x897a3): CFGR
    <599>   DW_AT_decl_file   : 4
    <599>   DW_AT_decl_line   : 426
    <59b>   DW_AT_decl_column : 17
    <59b>   DW_AT_type        : <0x514>
    <59f>   DW_AT_data_member_location: 4
 <2><5a0>: Abbrev Number: 3 (DW_TAG_member)
    <5a1>   DW_AT_name        : CIR
    <5a5>   DW_AT_decl_file   : 4
    <5a5>   DW_AT_decl_line   : 427
    <5a7>   DW_AT_decl_column : 17
    <5a7>   DW_AT_type        : <0x514>
    <5ab>   DW_AT_data_member_location: 8
 <2><5ac>: Abbrev Number: 2 (DW_TAG_member)
    <5ad>   DW_AT_name        : (indirect string, offset: 0x89783): APB2RSTR
    <5b1>   DW_AT_decl_file   : 4
    <5b1>   DW_AT_decl_line   : 428
    <5b3>   DW_AT_decl_column : 17
    <5b3>   DW_AT_type        : <0x514>
    <5b7>   DW_AT_data_member_location: 12
 <2><5b8>: Abbrev Number: 2 (DW_TAG_member)
    <5b9>   DW_AT_name        : (indirect string, offset: 0x8971f): APB1RSTR
    <5bd>   DW_AT_decl_file   : 4
    <5bd>   DW_AT_decl_line   : 429
    <5bf>   DW_AT_decl_column : 17
    <5bf>   DW_AT_type        : <0x514>
    <5c3>   DW_AT_data_member_location: 16
 <2><5c4>: Abbrev Number: 2 (DW_TAG_member)
    <5c5>   DW_AT_name        : (indirect string, offset: 0x89708): AHBENR
    <5c9>   DW_AT_decl_file   : 4
    <5c9>   DW_AT_decl_line   : 430
    <5cb>   DW_AT_decl_column : 17
    <5cb>   DW_AT_type        : <0x514>
    <5cf>   DW_AT_data_member_location: 20
 <2><5d0>: Abbrev Number: 2 (DW_TAG_member)
    <5d1>   DW_AT_name        : (indirect string, offset: 0x89728): APB2ENR
    <5d5>   DW_AT_decl_file   : 4
    <5d5>   DW_AT_decl_line   : 431
    <5d7>   DW_AT_decl_column : 17
    <5d7>   DW_AT_type        : <0x514>
    <5db>   DW_AT_data_member_location: 24
 <2><5dc>: Abbrev Number: 2 (DW_TAG_member)
    <5dd>   DW_AT_name        : (indirect string, offset: 0x897b6): APB1ENR
    <5e1>   DW_AT_decl_file   : 4
    <5e1>   DW_AT_decl_line   : 432
    <5e3>   DW_AT_decl_column : 17
    <5e3>   DW_AT_type        : <0x514>
    <5e7>   DW_AT_data_member_location: 28
 <2><5e8>: Abbrev Number: 2 (DW_TAG_member)
    <5e9>   DW_AT_name        : (indirect string, offset: 0x89730): BDCR
    <5ed>   DW_AT_decl_file   : 4
    <5ed>   DW_AT_decl_line   : 433
    <5ef>   DW_AT_decl_column : 17
    <5ef>   DW_AT_type        : <0x514>
    <5f3>   DW_AT_data_member_location: 32
 <2><5f4>: Abbrev Number: 3 (DW_TAG_member)
    <5f5>   DW_AT_name        : CSR
    <5f9>   DW_AT_decl_file   : 4
    <5f9>   DW_AT_decl_line   : 434
    <5fb>   DW_AT_decl_column : 17
    <5fb>   DW_AT_type        : <0x514>
    <5ff>   DW_AT_data_member_location: 36
 <2><600>: Abbrev Number: 0
 <1><601>: Abbrev Number: 9 (DW_TAG_typedef)
    <602>   DW_AT_name        : (indirect string, offset: 0x8978c): RCC_TypeDef
    <606>   DW_AT_decl_file   : 4
    <606>   DW_AT_decl_line   : 437
    <608>   DW_AT_decl_column : 3
    <608>   DW_AT_type        : <0x581>
 <1><60c>: Abbrev Number: 1 (DW_TAG_base_type)
    <60d>   DW_AT_byte_size   : 8
    <60e>   DW_AT_encoding    : 4	(float)
    <60f>   DW_AT_name        : (indirect string, offset: 0xd2df): long double
 <1><613>: Abbrev Number: 17 (DW_TAG_structure_type)
    <614>   DW_AT_byte_size   : 16
    <615>   DW_AT_decl_file   : 5
    <616>   DW_AT_decl_line   : 46
    <617>   DW_AT_decl_column : 9
    <618>   DW_AT_sibling     : <0x64b>
 <2><61c>: Abbrev Number: 18 (DW_TAG_member)
    <61d>   DW_AT_name        : Pin
    <621>   DW_AT_decl_file   : 5
    <622>   DW_AT_decl_line   : 48
    <623>   DW_AT_decl_column : 12
    <624>   DW_AT_type        : <0x508>
    <628>   DW_AT_data_member_location: 0
 <2><629>: Abbrev Number: 7 (DW_TAG_member)
    <62a>   DW_AT_name        : (indirect string, offset: 0x8b4ce): Mode
    <62e>   DW_AT_decl_file   : 5
    <62e>   DW_AT_decl_line   : 51
    <62f>   DW_AT_decl_column : 12
    <62f>   DW_AT_type        : <0x508>
    <633>   DW_AT_data_member_location: 4
 <2><634>: Abbrev Number: 7 (DW_TAG_member)
    <635>   DW_AT_name        : (indirect string, offset: 0x89798): Pull
    <639>   DW_AT_decl_file   : 5
    <639>   DW_AT_decl_line   : 54
    <63a>   DW_AT_decl_column : 12
    <63a>   DW_AT_type        : <0x508>
    <63e>   DW_AT_data_member_location: 8
 <2><63f>: Abbrev Number: 7 (DW_TAG_member)
    <640>   DW_AT_name        : (indirect string, offset: 0x8979d): Speed
    <644>   DW_AT_decl_file   : 5
    <644>   DW_AT_decl_line   : 57
    <645>   DW_AT_decl_column : 12
    <645>   DW_AT_type        : <0x508>
    <649>   DW_AT_data_member_location: 12
 <2><64a>: Abbrev Number: 0
 <1><64b>: Abbrev Number: 4 (DW_TAG_typedef)
    <64c>   DW_AT_name        : (indirect string, offset: 0x897be): GPIO_InitTypeDef
    <650>   DW_AT_decl_file   : 5
    <651>   DW_AT_decl_line   : 59
    <652>   DW_AT_decl_column : 3
    <653>   DW_AT_type        : <0x613>
 <1><657>: Abbrev Number: 19 (DW_TAG_enumeration_type)
    <658>   DW_AT_encoding    : 7	(unsigned)
    <659>   DW_AT_byte_size   : 1
    <65a>   DW_AT_type        : <0x4a5>
    <65e>   DW_AT_decl_file   : 5
    <65f>   DW_AT_decl_line   : 65
    <660>   DW_AT_decl_column : 1
    <661>   DW_AT_sibling     : <0x672>
 <2><665>: Abbrev Number: 10 (DW_TAG_enumerator)
    <666>   DW_AT_name        : (indirect string, offset: 0x89767): GPIO_PIN_RESET
    <66a>   DW_AT_const_value : 0
 <2><66b>: Abbrev Number: 10 (DW_TAG_enumerator)
    <66c>   DW_AT_name        : (indirect string, offset: 0x89735): GPIO_PIN_SET
    <670>   DW_AT_const_value : 1
 <2><671>: Abbrev Number: 0
 <1><672>: Abbrev Number: 4 (DW_TAG_typedef)
    <673>   DW_AT_name        : (indirect string, offset: 0x897db): GPIO_PinState
    <677>   DW_AT_decl_file   : 5
    <678>   DW_AT_decl_line   : 68
    <679>   DW_AT_decl_column : 3
    <67a>   DW_AT_type        : <0x657>
 <1><67e>: Abbrev Number: 11 (DW_TAG_subprogram)
    <67f>   DW_AT_external    : 1
    <67f>   DW_AT_name        : (indirect string, offset: 0x897a8): HAL_GPIO_Init
    <683>   DW_AT_decl_file   : 5
    <683>   DW_AT_decl_line   : 223
    <684>   DW_AT_decl_column : 7
    <685>   DW_AT_prototyped  : 1
    <685>   DW_AT_declaration : 1
    <685>   DW_AT_sibling     : <0x694>
 <2><689>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <68a>   DW_AT_type        : <0x694>
 <2><68e>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <68f>   DW_AT_type        : <0x699>
 <2><693>: Abbrev Number: 0
 <1><694>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <695>   DW_AT_byte_size   : 4
    <695>   DW_AT_type        : <0x576>
 <1><699>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <69a>   DW_AT_byte_size   : 4
    <69a>   DW_AT_type        : <0x64b>
 <1><69e>: Abbrev Number: 11 (DW_TAG_subprogram)
    <69f>   DW_AT_external    : 1
    <69f>   DW_AT_name        : (indirect string, offset: 0x89742): HAL_GPIO_WritePin
    <6a3>   DW_AT_decl_file   : 5
    <6a3>   DW_AT_decl_line   : 234
    <6a4>   DW_AT_decl_column : 6
    <6a5>   DW_AT_prototyped  : 1
    <6a5>   DW_AT_declaration : 1
    <6a5>   DW_AT_sibling     : <0x6b9>
 <2><6a9>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <6aa>   DW_AT_type        : <0x694>
 <2><6ae>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <6af>   DW_AT_type        : <0x4fc>
 <2><6b3>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <6b4>   DW_AT_type        : <0x672>
 <2><6b8>: Abbrev Number: 0
 <1><6b9>: Abbrev Number: 20 (DW_TAG_subprogram)
    <6ba>   DW_AT_external    : 1
    <6ba>   DW_AT_name        : (indirect string, offset: 0x89776): MX_GPIO_Init
    <6be>   DW_AT_decl_file   : 1
    <6bf>   DW_AT_decl_line   : 42
    <6c0>   DW_AT_decl_column : 6
    <6c1>   DW_AT_prototyped  : 1
    <6c1>   DW_AT_low_pc      : 0x80001d0
    <6c5>   DW_AT_high_pc     : 0x98
    <6c9>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <6cb>   DW_AT_call_all_tail_calls: 1
 <2><6cb>: Abbrev Number: 6 (DW_TAG_variable)
    <6cc>   DW_AT_name        : (indirect string, offset: 0x8970f): GPIO_InitStruct
    <6d0>   DW_AT_decl_file   : 1
    <6d0>   DW_AT_decl_line   : 45
    <6d1>   DW_AT_decl_column : 20
    <6d2>   DW_AT_type        : <0x64b>
    <6d6>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><6d9>: Abbrev Number: 13 (DW_TAG_lexical_block)
    <6da>   DW_AT_low_pc      : 0x80001e4
    <6de>   DW_AT_high_pc     : 0x18
    <6e2>   DW_AT_sibling     : <0x6f5>
 <3><6e6>: Abbrev Number: 6 (DW_TAG_variable)
    <6e7>   DW_AT_name        : (indirect string, offset: 0x89701): tmpreg
    <6eb>   DW_AT_decl_file   : 1
    <6eb>   DW_AT_decl_line   : 48
    <6ec>   DW_AT_decl_column : 3
    <6ed>   DW_AT_type        : <0x514>
    <6f1>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <3><6f4>: Abbrev Number: 0
 <2><6f5>: Abbrev Number: 13 (DW_TAG_lexical_block)
    <6f6>   DW_AT_low_pc      : 0x80001fc
    <6fa>   DW_AT_high_pc     : 0x18
    <6fe>   DW_AT_sibling     : <0x711>
 <3><702>: Abbrev Number: 6 (DW_TAG_variable)
    <703>   DW_AT_name        : (indirect string, offset: 0x89701): tmpreg
    <707>   DW_AT_decl_file   : 1
    <707>   DW_AT_decl_line   : 49
    <708>   DW_AT_decl_column : 3
    <709>   DW_AT_type        : <0x514>
    <70d>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <3><710>: Abbrev Number: 0
 <2><711>: Abbrev Number: 21 (DW_TAG_lexical_block)
    <712>   DW_AT_low_pc      : 0x8000214
    <716>   DW_AT_high_pc     : 0x18
 <3><71a>: Abbrev Number: 6 (DW_TAG_variable)
    <71b>   DW_AT_name        : (indirect string, offset: 0x89701): tmpreg
    <71f>   DW_AT_decl_file   : 1
    <71f>   DW_AT_decl_line   : 50
    <720>   DW_AT_decl_column : 3
    <721>   DW_AT_type        : <0x514>
    <725>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <3><728>: Abbrev Number: 0
 <2><729>: Abbrev Number: 0
 <1><72a>: Abbrev Number: 0
  Compilation Unit @ offset 0x72b:
   Length:        0x88d (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x2ce
   Pointer Size:  4
 <0><737>: Abbrev Number: 24 (DW_TAG_compile_unit)
    <738>   DW_AT_producer    : (indirect string, offset: 0x89081): GNU C11 13.3.1 20240614 -mcpu=cortex-m3 -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <73c>   DW_AT_language    : 29	(C11)
    <73d>   DW_AT_name        : (indirect string, offset: 0x89d7b): ../Core/Src/main.c
    <741>   DW_AT_comp_dir    : (indirect string, offset: 0x1b276): C:/Users/86173/Desktop/ProjectRequirement/MCU_Now/Lin_STM32/STM32_F103C8T6/6_LED_PC13_/6_LedFreertos_CubeIDE/Debug
    <745>   DW_AT_ranges      : 0x3f
    <749>   DW_AT_low_pc      : 0
    <74d>   DW_AT_stmt_list   : 0x12f2
    <751>   DW_AT_macros      : 0x16db1
 <1><755>: Abbrev Number: 5 (DW_TAG_base_type)
    <756>   DW_AT_byte_size   : 1
    <757>   DW_AT_encoding    : 6	(signed char)
    <758>   DW_AT_name        : (indirect string, offset: 0x447af): signed char
 <1><75c>: Abbrev Number: 5 (DW_TAG_base_type)
    <75d>   DW_AT_byte_size   : 1
    <75e>   DW_AT_encoding    : 8	(unsigned char)
    <75f>   DW_AT_name        : (indirect string, offset: 0x1bf6b): unsigned char
 <1><763>: Abbrev Number: 5 (DW_TAG_base_type)
    <764>   DW_AT_byte_size   : 2
    <765>   DW_AT_encoding    : 5	(signed)
    <766>   DW_AT_name        : (indirect string, offset: 0x66197): short int
 <1><76a>: Abbrev Number: 5 (DW_TAG_base_type)
    <76b>   DW_AT_byte_size   : 2
    <76c>   DW_AT_encoding    : 7	(unsigned)
    <76d>   DW_AT_name        : (indirect string, offset: 0x2cc83): short unsigned int
 <1><771>: Abbrev Number: 5 (DW_TAG_base_type)
    <772>   DW_AT_byte_size   : 4
    <773>   DW_AT_encoding    : 5	(signed)
    <774>   DW_AT_name        : (indirect string, offset: 0xc07d): long int
 <1><778>: Abbrev Number: 6 (DW_TAG_typedef)
    <779>   DW_AT_name        : (indirect string, offset: 0x571ef): __uint32_t
    <77d>   DW_AT_decl_file   : 3
    <77e>   DW_AT_decl_line   : 79
    <77f>   DW_AT_decl_column : 25
    <780>   DW_AT_type        : <0x784>
 <1><784>: Abbrev Number: 5 (DW_TAG_base_type)
    <785>   DW_AT_byte_size   : 4
    <786>   DW_AT_encoding    : 7	(unsigned)
    <787>   DW_AT_name        : (indirect string, offset: 0x20688): long unsigned int
 <1><78b>: Abbrev Number: 5 (DW_TAG_base_type)
    <78c>   DW_AT_byte_size   : 8
    <78d>   DW_AT_encoding    : 5	(signed)
    <78e>   DW_AT_name        : (indirect string, offset: 0x3ec7f): long long int
 <1><792>: Abbrev Number: 5 (DW_TAG_base_type)
    <793>   DW_AT_byte_size   : 8
    <794>   DW_AT_encoding    : 7	(unsigned)
    <795>   DW_AT_name        : (indirect string, offset: 0x1c7b9): long long unsigned int
 <1><799>: Abbrev Number: 25 (DW_TAG_base_type)
    <79a>   DW_AT_byte_size   : 4
    <79b>   DW_AT_encoding    : 5	(signed)
    <79c>   DW_AT_name        : int
 <1><7a0>: Abbrev Number: 5 (DW_TAG_base_type)
    <7a1>   DW_AT_byte_size   : 4
    <7a2>   DW_AT_encoding    : 7	(unsigned)
    <7a3>   DW_AT_name        : (indirect string, offset: 0xba44): unsigned int
 <1><7a7>: Abbrev Number: 6 (DW_TAG_typedef)
    <7a8>   DW_AT_name        : (indirect string, offset: 0x63ab3): uint32_t
    <7ac>   DW_AT_decl_file   : 4
    <7ad>   DW_AT_decl_line   : 48
    <7ae>   DW_AT_decl_column : 20
    <7af>   DW_AT_type        : <0x778>
 <1><7b3>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <7b4>   DW_AT_type        : <0x7a7>
 <1><7b8>: Abbrev Number: 12 (DW_TAG_structure_type)
    <7b9>   DW_AT_byte_size   : 16
    <7ba>   DW_AT_decl_file   : 5
    <7bb>   DW_AT_decl_line   : 290
    <7bd>   DW_AT_decl_column : 9
    <7bd>   DW_AT_sibling     : <0x7f8>
 <2><7c1>: Abbrev Number: 4 (DW_TAG_member)
    <7c2>   DW_AT_name        : CCR
    <7c6>   DW_AT_decl_file   : 5
    <7c6>   DW_AT_decl_line   : 292
    <7c8>   DW_AT_decl_column : 17
    <7c8>   DW_AT_type        : <0x7b3>
    <7cc>   DW_AT_data_member_location: 0
 <2><7cd>: Abbrev Number: 3 (DW_TAG_member)
    <7ce>   DW_AT_name        : (indirect string, offset: 0x89a36): CNDTR
    <7d2>   DW_AT_decl_file   : 5
    <7d3>   DW_AT_decl_line   : 293
    <7d5>   DW_AT_decl_column : 17
    <7d6>   DW_AT_type        : <0x7b3>
    <7da>   DW_AT_data_member_location: 4
 <2><7db>: Abbrev Number: 3 (DW_TAG_member)
    <7dc>   DW_AT_name        : (indirect string, offset: 0x89df2): CPAR
    <7e0>   DW_AT_decl_file   : 5
    <7e1>   DW_AT_decl_line   : 294
    <7e3>   DW_AT_decl_column : 17
    <7e4>   DW_AT_type        : <0x7b3>
    <7e8>   DW_AT_data_member_location: 8
 <2><7e9>: Abbrev Number: 3 (DW_TAG_member)
    <7ea>   DW_AT_name        : (indirect string, offset: 0x89b25): CMAR
    <7ee>   DW_AT_decl_file   : 5
    <7ef>   DW_AT_decl_line   : 295
    <7f1>   DW_AT_decl_column : 17
    <7f2>   DW_AT_type        : <0x7b3>
    <7f6>   DW_AT_data_member_location: 12
 <2><7f7>: Abbrev Number: 0
 <1><7f8>: Abbrev Number: 7 (DW_TAG_typedef)
    <7f9>   DW_AT_name        : (indirect string, offset: 0x89cea): DMA_Channel_TypeDef
    <7fd>   DW_AT_decl_file   : 5
    <7fe>   DW_AT_decl_line   : 296
    <800>   DW_AT_decl_column : 3
    <801>   DW_AT_type        : <0x7b8>
 <1><805>: Abbrev Number: 12 (DW_TAG_structure_type)
    <806>   DW_AT_byte_size   : 8
    <807>   DW_AT_decl_file   : 5
    <808>   DW_AT_decl_line   : 298
    <80a>   DW_AT_decl_column : 9
    <80a>   DW_AT_sibling     : <0x829>
 <2><80e>: Abbrev Number: 4 (DW_TAG_member)
    <80f>   DW_AT_name        : ISR
    <813>   DW_AT_decl_file   : 5
    <813>   DW_AT_decl_line   : 300
    <815>   DW_AT_decl_column : 17
    <815>   DW_AT_type        : <0x7b3>
    <819>   DW_AT_data_member_location: 0
 <2><81a>: Abbrev Number: 3 (DW_TAG_member)
    <81b>   DW_AT_name        : (indirect string, offset: 0x89c6a): IFCR
    <81f>   DW_AT_decl_file   : 5
    <820>   DW_AT_decl_line   : 301
    <822>   DW_AT_decl_column : 17
    <823>   DW_AT_type        : <0x7b3>
    <827>   DW_AT_data_member_location: 4
 <2><828>: Abbrev Number: 0
 <1><829>: Abbrev Number: 7 (DW_TAG_typedef)
    <82a>   DW_AT_name        : (indirect string, offset: 0x899fa): DMA_TypeDef
    <82e>   DW_AT_decl_file   : 5
    <82f>   DW_AT_decl_line   : 302
    <831>   DW_AT_decl_column : 3
    <832>   DW_AT_type        : <0x805>
 <1><836>: Abbrev Number: 12 (DW_TAG_structure_type)
    <837>   DW_AT_byte_size   : 84
    <838>   DW_AT_decl_file   : 5
    <839>   DW_AT_decl_line   : 476
    <83b>   DW_AT_decl_column : 9
    <83b>   DW_AT_sibling     : <0x950>
 <2><83f>: Abbrev Number: 4 (DW_TAG_member)
    <840>   DW_AT_name        : CR1
    <844>   DW_AT_decl_file   : 5
    <844>   DW_AT_decl_line   : 478
    <846>   DW_AT_decl_column : 17
    <846>   DW_AT_type        : <0x7b3>
    <84a>   DW_AT_data_member_location: 0
 <2><84b>: Abbrev Number: 4 (DW_TAG_member)
    <84c>   DW_AT_name        : CR2
    <850>   DW_AT_decl_file   : 5
    <850>   DW_AT_decl_line   : 479
    <852>   DW_AT_decl_column : 17
    <852>   DW_AT_type        : <0x7b3>
    <856>   DW_AT_data_member_location: 4
 <2><857>: Abbrev Number: 3 (DW_TAG_member)
    <858>   DW_AT_name        : (indirect string, offset: 0x62ac5): SMCR
    <85c>   DW_AT_decl_file   : 5
    <85d>   DW_AT_decl_line   : 480
    <85f>   DW_AT_decl_column : 17
    <860>   DW_AT_type        : <0x7b3>
    <864>   DW_AT_data_member_location: 8
 <2><865>: Abbrev Number: 3 (DW_TAG_member)
    <866>   DW_AT_name        : (indirect string, offset: 0x2bba7): DIER
    <86a>   DW_AT_decl_file   : 5
    <86b>   DW_AT_decl_line   : 481
    <86d>   DW_AT_decl_column : 17
    <86e>   DW_AT_type        : <0x7b3>
    <872>   DW_AT_data_member_location: 12
 <2><873>: Abbrev Number: 4 (DW_TAG_member)
    <874>   DW_AT_name        : SR
    <877>   DW_AT_decl_file   : 5
    <877>   DW_AT_decl_line   : 482
    <879>   DW_AT_decl_column : 17
    <879>   DW_AT_type        : <0x7b3>
    <87d>   DW_AT_data_member_location: 16
 <2><87e>: Abbrev Number: 4 (DW_TAG_member)
    <87f>   DW_AT_name        : EGR
    <883>   DW_AT_decl_file   : 5
    <883>   DW_AT_decl_line   : 483
    <885>   DW_AT_decl_column : 17
    <885>   DW_AT_type        : <0x7b3>
    <889>   DW_AT_data_member_location: 20
 <2><88a>: Abbrev Number: 3 (DW_TAG_member)
    <88b>   DW_AT_name        : (indirect string, offset: 0x6465e): CCMR1
    <88f>   DW_AT_decl_file   : 5
    <890>   DW_AT_decl_line   : 484
    <892>   DW_AT_decl_column : 17
    <893>   DW_AT_type        : <0x7b3>
    <897>   DW_AT_data_member_location: 24
 <2><898>: Abbrev Number: 3 (DW_TAG_member)
    <899>   DW_AT_name        : (indirect string, offset: 0x36df7): CCMR2
    <89d>   DW_AT_decl_file   : 5
    <89e>   DW_AT_decl_line   : 485
    <8a0>   DW_AT_decl_column : 17
    <8a1>   DW_AT_type        : <0x7b3>
    <8a5>   DW_AT_data_member_location: 28
 <2><8a6>: Abbrev Number: 3 (DW_TAG_member)
    <8a7>   DW_AT_name        : (indirect string, offset: 0x18681): CCER
    <8ab>   DW_AT_decl_file   : 5
    <8ac>   DW_AT_decl_line   : 486
    <8ae>   DW_AT_decl_column : 17
    <8af>   DW_AT_type        : <0x7b3>
    <8b3>   DW_AT_data_member_location: 32
 <2><8b4>: Abbrev Number: 4 (DW_TAG_member)
    <8b5>   DW_AT_name        : CNT
    <8b9>   DW_AT_decl_file   : 5
    <8b9>   DW_AT_decl_line   : 487
    <8bb>   DW_AT_decl_column : 17
    <8bb>   DW_AT_type        : <0x7b3>
    <8bf>   DW_AT_data_member_location: 36
 <2><8c0>: Abbrev Number: 4 (DW_TAG_member)
    <8c1>   DW_AT_name        : PSC
    <8c5>   DW_AT_decl_file   : 5
    <8c5>   DW_AT_decl_line   : 488
    <8c7>   DW_AT_decl_column : 17
    <8c7>   DW_AT_type        : <0x7b3>
    <8cb>   DW_AT_data_member_location: 40
 <2><8cc>: Abbrev Number: 4 (DW_TAG_member)
    <8cd>   DW_AT_name        : ARR
    <8d1>   DW_AT_decl_file   : 5
    <8d1>   DW_AT_decl_line   : 489
    <8d3>   DW_AT_decl_column : 17
    <8d3>   DW_AT_type        : <0x7b3>
    <8d7>   DW_AT_data_member_location: 44
 <2><8d8>: Abbrev Number: 4 (DW_TAG_member)
    <8d9>   DW_AT_name        : RCR
    <8dd>   DW_AT_decl_file   : 5
    <8dd>   DW_AT_decl_line   : 490
    <8df>   DW_AT_decl_column : 17
    <8df>   DW_AT_type        : <0x7b3>
    <8e3>   DW_AT_data_member_location: 48
 <2><8e4>: Abbrev Number: 3 (DW_TAG_member)
    <8e5>   DW_AT_name        : (indirect string, offset: 0x10a7a): CCR1
    <8e9>   DW_AT_decl_file   : 5
    <8ea>   DW_AT_decl_line   : 491
    <8ec>   DW_AT_decl_column : 17
    <8ed>   DW_AT_type        : <0x7b3>
    <8f1>   DW_AT_data_member_location: 52
 <2><8f2>: Abbrev Number: 3 (DW_TAG_member)
    <8f3>   DW_AT_name        : (indirect string, offset: 0x39bb2): CCR2
    <8f7>   DW_AT_decl_file   : 5
    <8f8>   DW_AT_decl_line   : 492
    <8fa>   DW_AT_decl_column : 17
    <8fb>   DW_AT_type        : <0x7b3>
    <8ff>   DW_AT_data_member_location: 56
 <2><900>: Abbrev Number: 3 (DW_TAG_member)
    <901>   DW_AT_name        : (indirect string, offset: 0x690c3): CCR3
    <905>   DW_AT_decl_file   : 5
    <906>   DW_AT_decl_line   : 493
    <908>   DW_AT_decl_column : 17
    <909>   DW_AT_type        : <0x7b3>
    <90d>   DW_AT_data_member_location: 60
 <2><90e>: Abbrev Number: 3 (DW_TAG_member)
    <90f>   DW_AT_name        : (indirect string, offset: 0x8f2c): CCR4
    <913>   DW_AT_decl_file   : 5
    <914>   DW_AT_decl_line   : 494
    <916>   DW_AT_decl_column : 17
    <917>   DW_AT_type        : <0x7b3>
    <91b>   DW_AT_data_member_location: 64
 <2><91c>: Abbrev Number: 3 (DW_TAG_member)
    <91d>   DW_AT_name        : (indirect string, offset: 0x3f5bd): BDTR
    <921>   DW_AT_decl_file   : 5
    <922>   DW_AT_decl_line   : 495
    <924>   DW_AT_decl_column : 17
    <925>   DW_AT_type        : <0x7b3>
    <929>   DW_AT_data_member_location: 68
 <2><92a>: Abbrev Number: 4 (DW_TAG_member)
    <92b>   DW_AT_name        : DCR
    <92f>   DW_AT_decl_file   : 5
    <92f>   DW_AT_decl_line   : 496
    <931>   DW_AT_decl_column : 17
    <931>   DW_AT_type        : <0x7b3>
    <935>   DW_AT_data_member_location: 72
 <2><936>: Abbrev Number: 3 (DW_TAG_member)
    <937>   DW_AT_name        : (indirect string, offset: 0x762df): DMAR
    <93b>   DW_AT_decl_file   : 5
    <93c>   DW_AT_decl_line   : 497
    <93e>   DW_AT_decl_column : 17
    <93f>   DW_AT_type        : <0x7b3>
    <943>   DW_AT_data_member_location: 76
 <2><944>: Abbrev Number: 4 (DW_TAG_member)
    <945>   DW_AT_name        : OR
    <948>   DW_AT_decl_file   : 5
    <948>   DW_AT_decl_line   : 498
    <94a>   DW_AT_decl_column : 17
    <94a>   DW_AT_type        : <0x7b3>
    <94e>   DW_AT_data_member_location: 80
 <2><94f>: Abbrev Number: 0
 <1><950>: Abbrev Number: 7 (DW_TAG_typedef)
    <951>   DW_AT_name        : (indirect string, offset: 0x89929): TIM_TypeDef
    <955>   DW_AT_decl_file   : 5
    <956>   DW_AT_decl_line   : 499
    <958>   DW_AT_decl_column : 2
    <959>   DW_AT_type        : <0x836>
 <1><95d>: Abbrev Number: 5 (DW_TAG_base_type)
    <95e>   DW_AT_byte_size   : 8
    <95f>   DW_AT_encoding    : 4	(float)
    <960>   DW_AT_name        : (indirect string, offset: 0xd2df): long double
 <1><964>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <965>   DW_AT_encoding    : 7	(unsigned)
    <966>   DW_AT_byte_size   : 1
    <967>   DW_AT_type        : <0x75c>
    <96b>   DW_AT_decl_file   : 6
    <96c>   DW_AT_decl_line   : 39
    <96d>   DW_AT_decl_column : 1
    <96e>   DW_AT_sibling     : <0x98b>
 <2><972>: Abbrev Number: 2 (DW_TAG_enumerator)
    <973>   DW_AT_name        : (indirect string, offset: 0x899a7): HAL_OK
    <977>   DW_AT_const_value : 0
 <2><978>: Abbrev Number: 2 (DW_TAG_enumerator)
    <979>   DW_AT_name        : (indirect string, offset: 0x89bdf): HAL_ERROR
    <97d>   DW_AT_const_value : 1
 <2><97e>: Abbrev Number: 2 (DW_TAG_enumerator)
    <97f>   DW_AT_name        : (indirect string, offset: 0x898b0): HAL_BUSY
    <983>   DW_AT_const_value : 2
 <2><984>: Abbrev Number: 2 (DW_TAG_enumerator)
    <985>   DW_AT_name        : (indirect string, offset: 0x8997e): HAL_TIMEOUT
    <989>   DW_AT_const_value : 3
 <2><98a>: Abbrev Number: 0
 <1><98b>: Abbrev Number: 6 (DW_TAG_typedef)
    <98c>   DW_AT_name        : (indirect string, offset: 0x897e9): HAL_StatusTypeDef
    <990>   DW_AT_decl_file   : 6
    <991>   DW_AT_decl_line   : 44
    <992>   DW_AT_decl_column : 3
    <993>   DW_AT_type        : <0x964>
 <1><997>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <998>   DW_AT_encoding    : 7	(unsigned)
    <999>   DW_AT_byte_size   : 1
    <99a>   DW_AT_type        : <0x75c>
    <99e>   DW_AT_decl_file   : 6
    <99f>   DW_AT_decl_line   : 50
    <9a0>   DW_AT_decl_column : 1
    <9a1>   DW_AT_sibling     : <0x9b2>
 <2><9a5>: Abbrev Number: 2 (DW_TAG_enumerator)
    <9a6>   DW_AT_name        : (indirect string, offset: 0x89c96): HAL_UNLOCKED
    <9aa>   DW_AT_const_value : 0
 <2><9ab>: Abbrev Number: 2 (DW_TAG_enumerator)
    <9ac>   DW_AT_name        : (indirect string, offset: 0x89e28): HAL_LOCKED
    <9b0>   DW_AT_const_value : 1
 <2><9b1>: Abbrev Number: 0
 <1><9b2>: Abbrev Number: 6 (DW_TAG_typedef)
    <9b3>   DW_AT_name        : (indirect string, offset: 0x89baa): HAL_LockTypeDef
    <9b7>   DW_AT_decl_file   : 6
    <9b8>   DW_AT_decl_line   : 53
    <9b9>   DW_AT_decl_column : 3
    <9ba>   DW_AT_type        : <0x997>
 <1><9be>: Abbrev Number: 11 (DW_TAG_structure_type)
    <9bf>   DW_AT_byte_size   : 12
    <9c0>   DW_AT_decl_file   : 7
    <9c1>   DW_AT_decl_line   : 47
    <9c2>   DW_AT_decl_column : 9
    <9c2>   DW_AT_sibling     : <0x9ee>
 <2><9c6>: Abbrev Number: 1 (DW_TAG_member)
    <9c7>   DW_AT_name        : (indirect string, offset: 0x89c07): PLLState
    <9cb>   DW_AT_decl_file   : 7
    <9cc>   DW_AT_decl_line   : 49
    <9cd>   DW_AT_decl_column : 12
    <9ce>   DW_AT_type        : <0x7a7>
    <9d2>   DW_AT_data_member_location: 0
 <2><9d3>: Abbrev Number: 1 (DW_TAG_member)
    <9d4>   DW_AT_name        : (indirect string, offset: 0x89c28): PLLSource
    <9d8>   DW_AT_decl_file   : 7
    <9d9>   DW_AT_decl_line   : 52
    <9da>   DW_AT_decl_column : 12
    <9db>   DW_AT_type        : <0x7a7>
    <9df>   DW_AT_data_member_location: 4
 <2><9e0>: Abbrev Number: 1 (DW_TAG_member)
    <9e1>   DW_AT_name        : (indirect string, offset: 0x89dac): PLLMUL
    <9e5>   DW_AT_decl_file   : 7
    <9e6>   DW_AT_decl_line   : 55
    <9e7>   DW_AT_decl_column : 12
    <9e8>   DW_AT_type        : <0x7a7>
    <9ec>   DW_AT_data_member_location: 8
 <2><9ed>: Abbrev Number: 0
 <1><9ee>: Abbrev Number: 6 (DW_TAG_typedef)
    <9ef>   DW_AT_name        : (indirect string, offset: 0x89bcc): RCC_PLLInitTypeDef
    <9f3>   DW_AT_decl_file   : 7
    <9f4>   DW_AT_decl_line   : 57
    <9f5>   DW_AT_decl_column : 3
    <9f6>   DW_AT_type        : <0x9be>
 <1><9fa>: Abbrev Number: 11 (DW_TAG_structure_type)
    <9fb>   DW_AT_byte_size   : 20
    <9fc>   DW_AT_decl_file   : 7
    <9fd>   DW_AT_decl_line   : 62
    <9fe>   DW_AT_decl_column : 9
    <9fe>   DW_AT_sibling     : <0xa44>
 <2><a02>: Abbrev Number: 1 (DW_TAG_member)
    <a03>   DW_AT_name        : (indirect string, offset: 0x8998a): ClockType
    <a07>   DW_AT_decl_file   : 7
    <a08>   DW_AT_decl_line   : 64
    <a09>   DW_AT_decl_column : 12
    <a0a>   DW_AT_type        : <0x7a7>
    <a0e>   DW_AT_data_member_location: 0
 <2><a0f>: Abbrev Number: 1 (DW_TAG_member)
    <a10>   DW_AT_name        : (indirect string, offset: 0x89bbf): SYSCLKSource
    <a14>   DW_AT_decl_file   : 7
    <a15>   DW_AT_decl_line   : 67
    <a16>   DW_AT_decl_column : 12
    <a17>   DW_AT_type        : <0x7a7>
    <a1b>   DW_AT_data_member_location: 4
 <2><a1c>: Abbrev Number: 1 (DW_TAG_member)
    <a1d>   DW_AT_name        : (indirect string, offset: 0x89d0d): AHBCLKDivider
    <a21>   DW_AT_decl_file   : 7
    <a22>   DW_AT_decl_line   : 70
    <a23>   DW_AT_decl_column : 12
    <a24>   DW_AT_type        : <0x7a7>
    <a28>   DW_AT_data_member_location: 8
 <2><a29>: Abbrev Number: 1 (DW_TAG_member)
    <a2a>   DW_AT_name        : (indirect string, offset: 0x89829): APB1CLKDivider
    <a2e>   DW_AT_decl_file   : 7
    <a2f>   DW_AT_decl_line   : 73
    <a30>   DW_AT_decl_column : 12
    <a31>   DW_AT_type        : <0x7a7>
    <a35>   DW_AT_data_member_location: 12
 <2><a36>: Abbrev Number: 1 (DW_TAG_member)
    <a37>   DW_AT_name        : (indirect string, offset: 0x89a98): APB2CLKDivider
    <a3b>   DW_AT_decl_file   : 7
    <a3c>   DW_AT_decl_line   : 76
    <a3d>   DW_AT_decl_column : 12
    <a3e>   DW_AT_type        : <0x7a7>
    <a42>   DW_AT_data_member_location: 16
 <2><a43>: Abbrev Number: 0
 <1><a44>: Abbrev Number: 6 (DW_TAG_typedef)
    <a45>   DW_AT_name        : (indirect string, offset: 0x89994): RCC_ClkInitTypeDef
    <a49>   DW_AT_decl_file   : 7
    <a4a>   DW_AT_decl_line   : 78
    <a4b>   DW_AT_decl_column : 3
    <a4c>   DW_AT_type        : <0x9fa>
 <1><a50>: Abbrev Number: 11 (DW_TAG_structure_type)
    <a51>   DW_AT_byte_size   : 40
    <a52>   DW_AT_decl_file   : 8
    <a53>   DW_AT_decl_line   : 226
    <a54>   DW_AT_decl_column : 9
    <a54>   DW_AT_sibling     : <0xac1>
 <2><a58>: Abbrev Number: 1 (DW_TAG_member)
    <a59>   DW_AT_name        : (indirect string, offset: 0x89cfe): OscillatorType
    <a5d>   DW_AT_decl_file   : 8
    <a5e>   DW_AT_decl_line   : 228
    <a5f>   DW_AT_decl_column : 12
    <a60>   DW_AT_type        : <0x7a7>
    <a64>   DW_AT_data_member_location: 0
 <2><a65>: Abbrev Number: 1 (DW_TAG_member)
    <a66>   DW_AT_name        : (indirect string, offset: 0x89c1f): HSEState
    <a6a>   DW_AT_decl_file   : 8
    <a6b>   DW_AT_decl_line   : 236
    <a6c>   DW_AT_decl_column : 12
    <a6d>   DW_AT_type        : <0x7a7>
    <a71>   DW_AT_data_member_location: 4
 <2><a72>: Abbrev Number: 1 (DW_TAG_member)
    <a73>   DW_AT_name        : (indirect string, offset: 0x89c10): HSEPredivValue
    <a77>   DW_AT_decl_file   : 8
    <a78>   DW_AT_decl_line   : 239
    <a79>   DW_AT_decl_column : 12
    <a7a>   DW_AT_type        : <0x7a7>
    <a7e>   DW_AT_data_member_location: 8
 <2><a7f>: Abbrev Number: 1 (DW_TAG_member)
    <a80>   DW_AT_name        : (indirect string, offset: 0x89be9): LSEState
    <a84>   DW_AT_decl_file   : 8
    <a85>   DW_AT_decl_line   : 242
    <a86>   DW_AT_decl_column : 12
    <a87>   DW_AT_type        : <0x7a7>
    <a8b>   DW_AT_data_member_location: 12
 <2><a8c>: Abbrev Number: 1 (DW_TAG_member)
    <a8d>   DW_AT_name        : (indirect string, offset: 0x89a8f): HSIState
    <a91>   DW_AT_decl_file   : 8
    <a92>   DW_AT_decl_line   : 245
    <a93>   DW_AT_decl_column : 12
    <a94>   DW_AT_type        : <0x7a7>
    <a98>   DW_AT_data_member_location: 16
 <2><a99>: Abbrev Number: 1 (DW_TAG_member)
    <a9a>   DW_AT_name        : (indirect string, offset: 0x89d67): HSICalibrationValue
    <a9e>   DW_AT_decl_file   : 8
    <a9f>   DW_AT_decl_line   : 248
    <aa0>   DW_AT_decl_column : 12
    <aa1>   DW_AT_type        : <0x7a7>
    <aa5>   DW_AT_data_member_location: 20
 <2><aa6>: Abbrev Number: 1 (DW_TAG_member)
    <aa7>   DW_AT_name        : (indirect string, offset: 0x89d8e): LSIState
    <aab>   DW_AT_decl_file   : 8
    <aac>   DW_AT_decl_line   : 251
    <aad>   DW_AT_decl_column : 12
    <aae>   DW_AT_type        : <0x7a7>
    <ab2>   DW_AT_data_member_location: 24
 <2><ab3>: Abbrev Number: 26 (DW_TAG_member)
    <ab4>   DW_AT_name        : PLL
    <ab8>   DW_AT_decl_file   : 8
    <ab9>   DW_AT_decl_line   : 254
    <aba>   DW_AT_decl_column : 22
    <abb>   DW_AT_type        : <0x9ee>
    <abf>   DW_AT_data_member_location: 28
 <2><ac0>: Abbrev Number: 0
 <1><ac1>: Abbrev Number: 7 (DW_TAG_typedef)
    <ac2>   DW_AT_name        : (indirect string, offset: 0x89aea): RCC_OscInitTypeDef
    <ac6>   DW_AT_decl_file   : 8
    <ac7>   DW_AT_decl_line   : 259
    <ac9>   DW_AT_decl_column : 3
    <aca>   DW_AT_type        : <0xa50>
 <1><ace>: Abbrev Number: 11 (DW_TAG_structure_type)
    <acf>   DW_AT_byte_size   : 28
    <ad0>   DW_AT_decl_file   : 9
    <ad1>   DW_AT_decl_line   : 47
    <ad2>   DW_AT_decl_column : 9
    <ad2>   DW_AT_sibling     : <0xb32>
 <2><ad6>: Abbrev Number: 1 (DW_TAG_member)
    <ad7>   DW_AT_name        : (indirect string, offset: 0x89a1a): Direction
    <adb>   DW_AT_decl_file   : 9
    <adc>   DW_AT_decl_line   : 49
    <add>   DW_AT_decl_column : 12
    <ade>   DW_AT_type        : <0x7a7>
    <ae2>   DW_AT_data_member_location: 0
 <2><ae3>: Abbrev Number: 1 (DW_TAG_member)
    <ae4>   DW_AT_name        : (indirect string, offset: 0x89859): PeriphInc
    <ae8>   DW_AT_decl_file   : 9
    <ae9>   DW_AT_decl_line   : 53
    <aea>   DW_AT_decl_column : 12
    <aeb>   DW_AT_type        : <0x7a7>
    <aef>   DW_AT_data_member_location: 4
 <2><af0>: Abbrev Number: 1 (DW_TAG_member)
    <af1>   DW_AT_name        : (indirect string, offset: 0x898a9): MemInc
    <af5>   DW_AT_decl_file   : 9
    <af6>   DW_AT_decl_line   : 56
    <af7>   DW_AT_decl_column : 12
    <af8>   DW_AT_type        : <0x7a7>
    <afc>   DW_AT_data_member_location: 8
 <2><afd>: Abbrev Number: 1 (DW_TAG_member)
    <afe>   DW_AT_name        : (indirect string, offset: 0x89ac2): PeriphDataAlignment
    <b02>   DW_AT_decl_file   : 9
    <b03>   DW_AT_decl_line   : 59
    <b04>   DW_AT_decl_column : 12
    <b05>   DW_AT_type        : <0x7a7>
    <b09>   DW_AT_data_member_location: 12
 <2><b0a>: Abbrev Number: 1 (DW_TAG_member)
    <b0b>   DW_AT_name        : (indirect string, offset: 0x89db3): MemDataAlignment
    <b0f>   DW_AT_decl_file   : 9
    <b10>   DW_AT_decl_line   : 62
    <b11>   DW_AT_decl_column : 12
    <b12>   DW_AT_type        : <0x7a7>
    <b16>   DW_AT_data_member_location: 16
 <2><b17>: Abbrev Number: 1 (DW_TAG_member)
    <b18>   DW_AT_name        : (indirect string, offset: 0x8b4ce): Mode
    <b1c>   DW_AT_decl_file   : 9
    <b1d>   DW_AT_decl_line   : 65
    <b1e>   DW_AT_decl_column : 12
    <b1f>   DW_AT_type        : <0x7a7>
    <b23>   DW_AT_data_member_location: 20
 <2><b24>: Abbrev Number: 1 (DW_TAG_member)
    <b25>   DW_AT_name        : (indirect string, offset: 0x8a820): Priority
    <b29>   DW_AT_decl_file   : 9
    <b2a>   DW_AT_decl_line   : 70
    <b2b>   DW_AT_decl_column : 12
    <b2c>   DW_AT_type        : <0x7a7>
    <b30>   DW_AT_data_member_location: 24
 <2><b31>: Abbrev Number: 0
 <1><b32>: Abbrev Number: 6 (DW_TAG_typedef)
    <b33>   DW_AT_name        : (indirect string, offset: 0x8995a): DMA_InitTypeDef
    <b37>   DW_AT_decl_file   : 9
    <b38>   DW_AT_decl_line   : 72
    <b39>   DW_AT_decl_column : 3
    <b3a>   DW_AT_type        : <0xace>
 <1><b3e>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <b3f>   DW_AT_encoding    : 7	(unsigned)
    <b40>   DW_AT_byte_size   : 1
    <b41>   DW_AT_type        : <0x75c>
    <b45>   DW_AT_decl_file   : 9
    <b46>   DW_AT_decl_line   : 78
    <b47>   DW_AT_decl_column : 1
    <b48>   DW_AT_sibling     : <0xb65>
 <2><b4c>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b4d>   DW_AT_name        : (indirect string, offset: 0x89ca3): HAL_DMA_STATE_RESET
    <b51>   DW_AT_const_value : 0
 <2><b52>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b53>   DW_AT_name        : (indirect string, offset: 0x8996a): HAL_DMA_STATE_READY
    <b57>   DW_AT_const_value : 1
 <2><b58>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b59>   DW_AT_name        : (indirect string, offset: 0x89c57): HAL_DMA_STATE_BUSY
    <b5d>   DW_AT_const_value : 2
 <2><b5e>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b5f>   DW_AT_name        : (indirect string, offset: 0x89e01): HAL_DMA_STATE_TIMEOUT
    <b63>   DW_AT_const_value : 3
 <2><b64>: Abbrev Number: 0
 <1><b65>: Abbrev Number: 6 (DW_TAG_typedef)
    <b66>   DW_AT_name        : (indirect string, offset: 0x89bf2): HAL_DMA_StateTypeDef
    <b6a>   DW_AT_decl_file   : 9
    <b6b>   DW_AT_decl_line   : 83
    <b6c>   DW_AT_decl_column : 2
    <b6d>   DW_AT_type        : <0xb3e>
 <1><b71>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <b72>   DW_AT_type        : <0xb65>
 <1><b76>: Abbrev Number: 27 (DW_TAG_structure_type)
    <b77>   DW_AT_name        : (indirect string, offset: 0x89d3f): __DMA_HandleTypeDef
    <b7b>   DW_AT_byte_size   : 68
    <b7c>   DW_AT_decl_file   : 9
    <b7d>   DW_AT_decl_line   : 110
    <b7e>   DW_AT_decl_column : 16
    <b7f>   DW_AT_sibling     : <0xc20>
 <2><b83>: Abbrev Number: 1 (DW_TAG_member)
    <b84>   DW_AT_name        : (indirect string, offset: 0x89a3c): Instance
    <b88>   DW_AT_decl_file   : 9
    <b89>   DW_AT_decl_line   : 112
    <b8a>   DW_AT_decl_column : 31
    <b8b>   DW_AT_type        : <0xc20>
    <b8f>   DW_AT_data_member_location: 0
 <2><b90>: Abbrev Number: 1 (DW_TAG_member)
    <b91>   DW_AT_name        : (indirect string, offset: 0x8b2b5): Init
    <b95>   DW_AT_decl_file   : 9
    <b96>   DW_AT_decl_line   : 114
    <b97>   DW_AT_decl_column : 30
    <b98>   DW_AT_type        : <0xb32>
    <b9c>   DW_AT_data_member_location: 4
 <2><b9d>: Abbrev Number: 1 (DW_TAG_member)
    <b9e>   DW_AT_name        : (indirect string, offset: 0x61e2b): Lock
    <ba2>   DW_AT_decl_file   : 9
    <ba3>   DW_AT_decl_line   : 116
    <ba4>   DW_AT_decl_column : 30
    <ba5>   DW_AT_type        : <0x9b2>
    <ba9>   DW_AT_data_member_location: 32
 <2><baa>: Abbrev Number: 1 (DW_TAG_member)
    <bab>   DW_AT_name        : (indirect string, offset: 0x89c22): State
    <baf>   DW_AT_decl_file   : 9
    <bb0>   DW_AT_decl_line   : 118
    <bb1>   DW_AT_decl_column : 30
    <bb2>   DW_AT_type        : <0xb71>
    <bb6>   DW_AT_data_member_location: 33
 <2><bb7>: Abbrev Number: 1 (DW_TAG_member)
    <bb8>   DW_AT_name        : (indirect string, offset: 0x89deb): Parent
    <bbc>   DW_AT_decl_file   : 9
    <bbd>   DW_AT_decl_line   : 120
    <bbe>   DW_AT_decl_column : 31
    <bbf>   DW_AT_type        : <0xc25>
    <bc3>   DW_AT_data_member_location: 36
 <2><bc4>: Abbrev Number: 1 (DW_TAG_member)
    <bc5>   DW_AT_name        : (indirect string, offset: 0x89e17): XferCpltCallback
    <bc9>   DW_AT_decl_file   : 9
    <bca>   DW_AT_decl_line   : 122
    <bcb>   DW_AT_decl_column : 33
    <bcc>   DW_AT_type        : <0xc37>
    <bd0>   DW_AT_data_member_location: 40
 <2><bd1>: Abbrev Number: 1 (DW_TAG_member)
    <bd2>   DW_AT_name        : (indirect string, offset: 0x89cd0): XferHalfCpltCallback
    <bd6>   DW_AT_decl_file   : 9
    <bd7>   DW_AT_decl_line   : 124
    <bd8>   DW_AT_decl_column : 33
    <bd9>   DW_AT_type        : <0xc37>
    <bdd>   DW_AT_data_member_location: 44
 <2><bde>: Abbrev Number: 1 (DW_TAG_member)
    <bdf>   DW_AT_name        : (indirect string, offset: 0x89897): XferErrorCallback
    <be3>   DW_AT_decl_file   : 9
    <be4>   DW_AT_decl_line   : 126
    <be5>   DW_AT_decl_column : 33
    <be6>   DW_AT_type        : <0xc37>
    <bea>   DW_AT_data_member_location: 48
 <2><beb>: Abbrev Number: 1 (DW_TAG_member)
    <bec>   DW_AT_name        : (indirect string, offset: 0x89dd0): XferAbortCallback
    <bf0>   DW_AT_decl_file   : 9
    <bf1>   DW_AT_decl_line   : 128
    <bf2>   DW_AT_decl_column : 33
    <bf3>   DW_AT_type        : <0xc37>
    <bf7>   DW_AT_data_member_location: 52
 <2><bf8>: Abbrev Number: 1 (DW_TAG_member)
    <bf9>   DW_AT_name        : (indirect string, offset: 0x89df7): ErrorCode
    <bfd>   DW_AT_decl_file   : 9
    <bfe>   DW_AT_decl_line   : 130
    <bff>   DW_AT_decl_column : 30
    <c00>   DW_AT_type        : <0x7b3>
    <c04>   DW_AT_data_member_location: 56
 <2><c05>: Abbrev Number: 1 (DW_TAG_member)
    <c06>   DW_AT_name        : (indirect string, offset: 0x89a72): DmaBaseAddress
    <c0a>   DW_AT_decl_file   : 9
    <c0b>   DW_AT_decl_line   : 132
    <c0c>   DW_AT_decl_column : 31
    <c0d>   DW_AT_type        : <0xc3c>
    <c11>   DW_AT_data_member_location: 60
 <2><c12>: Abbrev Number: 1 (DW_TAG_member)
    <c13>   DW_AT_name        : (indirect string, offset: 0x89900): ChannelIndex
    <c17>   DW_AT_decl_file   : 9
    <c18>   DW_AT_decl_line   : 134
    <c19>   DW_AT_decl_column : 30
    <c1a>   DW_AT_type        : <0x7a7>
    <c1e>   DW_AT_data_member_location: 64
 <2><c1f>: Abbrev Number: 0
 <1><c20>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <c21>   DW_AT_byte_size   : 4
    <c21>   DW_AT_type        : <0x7f8>
 <1><c25>: Abbrev Number: 28 (DW_TAG_pointer_type)
    <c26>   DW_AT_byte_size   : 4
 <1><c27>: Abbrev Number: 29 (DW_TAG_subroutine_type)
    <c28>   DW_AT_prototyped  : 1
    <c28>   DW_AT_sibling     : <0xc32>
 <2><c2c>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <c2d>   DW_AT_type        : <0xc32>
 <2><c31>: Abbrev Number: 0
 <1><c32>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <c33>   DW_AT_byte_size   : 4
    <c33>   DW_AT_type        : <0xb76>
 <1><c37>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <c38>   DW_AT_byte_size   : 4
    <c38>   DW_AT_type        : <0xc27>
 <1><c3c>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <c3d>   DW_AT_byte_size   : 4
    <c3d>   DW_AT_type        : <0x829>
 <1><c41>: Abbrev Number: 6 (DW_TAG_typedef)
    <c42>   DW_AT_name        : (indirect string, offset: 0x89d41): DMA_HandleTypeDef
    <c46>   DW_AT_decl_file   : 9
    <c47>   DW_AT_decl_line   : 136
    <c48>   DW_AT_decl_column : 3
    <c49>   DW_AT_type        : <0xb76>
 <1><c4d>: Abbrev Number: 11 (DW_TAG_structure_type)
    <c4e>   DW_AT_byte_size   : 24
    <c4f>   DW_AT_decl_file   : 10
    <c50>   DW_AT_decl_line   : 46
    <c51>   DW_AT_decl_column : 9
    <c51>   DW_AT_sibling     : <0xca4>
 <2><c55>: Abbrev Number: 1 (DW_TAG_member)
    <c56>   DW_AT_name        : (indirect string, offset: 0x8a1e4): Prescaler
    <c5a>   DW_AT_decl_file   : 10
    <c5b>   DW_AT_decl_line   : 48
    <c5c>   DW_AT_decl_column : 12
    <c5d>   DW_AT_type        : <0x7a7>
    <c61>   DW_AT_data_member_location: 0
 <2><c62>: Abbrev Number: 1 (DW_TAG_member)
    <c63>   DW_AT_name        : (indirect string, offset: 0x89dc4): CounterMode
    <c67>   DW_AT_decl_file   : 10
    <c68>   DW_AT_decl_line   : 51
    <c69>   DW_AT_decl_column : 12
    <c6a>   DW_AT_type        : <0x7a7>
    <c6e>   DW_AT_data_member_location: 4
 <2><c6f>: Abbrev Number: 1 (DW_TAG_member)
    <c70>   DW_AT_name        : (indirect string, offset: 0x91356): Period
    <c74>   DW_AT_decl_file   : 10
    <c75>   DW_AT_decl_line   : 54
    <c76>   DW_AT_decl_column : 12
    <c77>   DW_AT_type        : <0x7a7>
    <c7b>   DW_AT_data_member_location: 8
 <2><c7c>: Abbrev Number: 1 (DW_TAG_member)
    <c7d>   DW_AT_name        : (indirect string, offset: 0x89a45): ClockDivision
    <c81>   DW_AT_decl_file   : 10
    <c82>   DW_AT_decl_line   : 58
    <c83>   DW_AT_decl_column : 12
    <c84>   DW_AT_type        : <0x7a7>
    <c88>   DW_AT_data_member_location: 12
 <2><c89>: Abbrev Number: 1 (DW_TAG_member)
    <c8a>   DW_AT_name        : (indirect string, offset: 0x89c6f): RepetitionCounter
    <c8e>   DW_AT_decl_file   : 10
    <c8f>   DW_AT_decl_line   : 61
    <c90>   DW_AT_decl_column : 12
    <c91>   DW_AT_type        : <0x7a7>
    <c95>   DW_AT_data_member_location: 16
 <2><c96>: Abbrev Number: 1 (DW_TAG_member)
    <c97>   DW_AT_name        : (indirect string, offset: 0x89868): AutoReloadPreload
    <c9b>   DW_AT_decl_file   : 10
    <c9c>   DW_AT_decl_line   : 72
    <c9d>   DW_AT_decl_column : 12
    <c9e>   DW_AT_type        : <0x7a7>
    <ca2>   DW_AT_data_member_location: 20
 <2><ca3>: Abbrev Number: 0
 <1><ca4>: Abbrev Number: 6 (DW_TAG_typedef)
    <ca5>   DW_AT_name        : (indirect string, offset: 0x89d97): TIM_Base_InitTypeDef
    <ca9>   DW_AT_decl_file   : 10
    <caa>   DW_AT_decl_line   : 74
    <cab>   DW_AT_decl_column : 3
    <cac>   DW_AT_type        : <0xc4d>
 <1><cb0>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <cb1>   DW_AT_encoding    : 7	(unsigned)
    <cb1>   DW_AT_byte_size   : 1
    <cb1>   DW_AT_type        : <0x75c>
    <cb5>   DW_AT_decl_file   : 10
    <cb5>   DW_AT_decl_line   : 291
    <cb7>   DW_AT_decl_column : 1
    <cb7>   DW_AT_sibling     : <0xcda>
 <2><cbb>: Abbrev Number: 2 (DW_TAG_enumerator)
    <cbc>   DW_AT_name        : (indirect string, offset: 0x89ad6): HAL_TIM_STATE_RESET
    <cc0>   DW_AT_const_value : 0
 <2><cc1>: Abbrev Number: 2 (DW_TAG_enumerator)
    <cc2>   DW_AT_name        : (indirect string, offset: 0x89815): HAL_TIM_STATE_READY
    <cc6>   DW_AT_const_value : 1
 <2><cc7>: Abbrev Number: 2 (DW_TAG_enumerator)
    <cc8>   DW_AT_name        : (indirect string, offset: 0x89947): HAL_TIM_STATE_BUSY
    <ccc>   DW_AT_const_value : 2
 <2><ccd>: Abbrev Number: 2 (DW_TAG_enumerator)
    <cce>   DW_AT_name        : (indirect string, offset: 0x89d1b): HAL_TIM_STATE_TIMEOUT
    <cd2>   DW_AT_const_value : 3
 <2><cd3>: Abbrev Number: 2 (DW_TAG_enumerator)
    <cd4>   DW_AT_name        : (indirect string, offset: 0x89a06): HAL_TIM_STATE_ERROR
    <cd8>   DW_AT_const_value : 4
 <2><cd9>: Abbrev Number: 0
 <1><cda>: Abbrev Number: 7 (DW_TAG_typedef)
    <cdb>   DW_AT_name        : (indirect string, offset: 0x89c81): HAL_TIM_StateTypeDef
    <cdf>   DW_AT_decl_file   : 10
    <ce0>   DW_AT_decl_line   : 297
    <ce2>   DW_AT_decl_column : 3
    <ce3>   DW_AT_type        : <0xcb0>
 <1><ce7>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <ce8>   DW_AT_type        : <0xcda>
 <1><cec>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <ced>   DW_AT_encoding    : 7	(unsigned)
    <ced>   DW_AT_byte_size   : 1
    <ced>   DW_AT_type        : <0x75c>
    <cf1>   DW_AT_decl_file   : 10
    <cf1>   DW_AT_decl_line   : 303
    <cf3>   DW_AT_decl_column : 1
    <cf3>   DW_AT_sibling     : <0xd0a>
 <2><cf7>: Abbrev Number: 2 (DW_TAG_enumerator)
    <cf8>   DW_AT_name        : (indirect string, offset: 0x899de): HAL_TIM_CHANNEL_STATE_RESET
    <cfc>   DW_AT_const_value : 0
 <2><cfd>: Abbrev Number: 2 (DW_TAG_enumerator)
    <cfe>   DW_AT_name        : (indirect string, offset: 0x89b8e): HAL_TIM_CHANNEL_STATE_READY
    <d02>   DW_AT_const_value : 1
 <2><d03>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d04>   DW_AT_name        : (indirect string, offset: 0x89aa7): HAL_TIM_CHANNEL_STATE_BUSY
    <d08>   DW_AT_const_value : 2
 <2><d09>: Abbrev Number: 0
 <1><d0a>: Abbrev Number: 7 (DW_TAG_typedef)
    <d0b>   DW_AT_name        : (indirect string, offset: 0x8990d): HAL_TIM_ChannelStateTypeDef
    <d0f>   DW_AT_decl_file   : 10
    <d10>   DW_AT_decl_line   : 307
    <d12>   DW_AT_decl_column : 3
    <d13>   DW_AT_type        : <0xcec>
 <1><d17>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <d18>   DW_AT_type        : <0xd0a>
 <1><d1c>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <d1d>   DW_AT_encoding    : 7	(unsigned)
    <d1d>   DW_AT_byte_size   : 1
    <d1d>   DW_AT_type        : <0x75c>
    <d21>   DW_AT_decl_file   : 10
    <d21>   DW_AT_decl_line   : 313
    <d23>   DW_AT_decl_column : 1
    <d23>   DW_AT_sibling     : <0xd3a>
 <2><d27>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d28>   DW_AT_name        : (indirect string, offset: 0x897fb): HAL_DMA_BURST_STATE_RESET
    <d2c>   DW_AT_const_value : 0
 <2><d2d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d2e>   DW_AT_name        : (indirect string, offset: 0x89afd): HAL_DMA_BURST_STATE_READY
    <d32>   DW_AT_const_value : 1
 <2><d33>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d34>   DW_AT_name        : (indirect string, offset: 0x89cb7): HAL_DMA_BURST_STATE_BUSY
    <d38>   DW_AT_const_value : 2
 <2><d39>: Abbrev Number: 0
 <1><d3a>: Abbrev Number: 7 (DW_TAG_typedef)
    <d3b>   DW_AT_name        : (indirect string, offset: 0x8987a): HAL_TIM_DMABurstStateTypeDef
    <d3f>   DW_AT_decl_file   : 10
    <d40>   DW_AT_decl_line   : 317
    <d42>   DW_AT_decl_column : 3
    <d43>   DW_AT_type        : <0xd1c>
 <1><d47>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <d48>   DW_AT_type        : <0xd3a>
 <1><d4c>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <d4d>   DW_AT_encoding    : 7	(unsigned)
    <d4d>   DW_AT_byte_size   : 1
    <d4d>   DW_AT_type        : <0x75c>
    <d51>   DW_AT_decl_file   : 10
    <d51>   DW_AT_decl_line   : 323
    <d53>   DW_AT_decl_column : 1
    <d53>   DW_AT_sibling     : <0xd76>
 <2><d57>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d58>   DW_AT_name        : (indirect string, offset: 0x89b2a): HAL_TIM_ACTIVE_CHANNEL_1
    <d5c>   DW_AT_const_value : 1
 <2><d5d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d5e>   DW_AT_name        : (indirect string, offset: 0x89b43): HAL_TIM_ACTIVE_CHANNEL_2
    <d62>   DW_AT_const_value : 2
 <2><d63>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d64>   DW_AT_name        : (indirect string, offset: 0x89b5c): HAL_TIM_ACTIVE_CHANNEL_3
    <d68>   DW_AT_const_value : 4
 <2><d69>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d6a>   DW_AT_name        : (indirect string, offset: 0x89b75): HAL_TIM_ACTIVE_CHANNEL_4
    <d6e>   DW_AT_const_value : 8
 <2><d6f>: Abbrev Number: 2 (DW_TAG_enumerator)
    <d70>   DW_AT_name        : (indirect string, offset: 0x89a53): HAL_TIM_ACTIVE_CHANNEL_CLEARED
    <d74>   DW_AT_const_value : 0
 <2><d75>: Abbrev Number: 0
 <1><d76>: Abbrev Number: 7 (DW_TAG_typedef)
    <d77>   DW_AT_name        : (indirect string, offset: 0x898ea): HAL_TIM_ActiveChannel
    <d7b>   DW_AT_decl_file   : 10
    <d7c>   DW_AT_decl_line   : 329
    <d7e>   DW_AT_decl_column : 3
    <d7f>   DW_AT_type        : <0xd4c>
 <1><d83>: Abbrev Number: 12 (DW_TAG_structure_type)
    <d84>   DW_AT_byte_size   : 72
    <d85>   DW_AT_decl_file   : 10
    <d86>   DW_AT_decl_line   : 337
    <d88>   DW_AT_decl_column : 9
    <d88>   DW_AT_sibling     : <0xe0b>
 <2><d8c>: Abbrev Number: 3 (DW_TAG_member)
    <d8d>   DW_AT_name        : (indirect string, offset: 0x89a3c): Instance
    <d91>   DW_AT_decl_file   : 10
    <d92>   DW_AT_decl_line   : 340
    <d94>   DW_AT_decl_column : 39
    <d95>   DW_AT_type        : <0xe0b>
    <d99>   DW_AT_data_member_location: 0
 <2><d9a>: Abbrev Number: 3 (DW_TAG_member)
    <d9b>   DW_AT_name        : (indirect string, offset: 0x8b2b5): Init
    <d9f>   DW_AT_decl_file   : 10
    <da0>   DW_AT_decl_line   : 341
    <da2>   DW_AT_decl_column : 38
    <da3>   DW_AT_type        : <0xca4>
    <da7>   DW_AT_data_member_location: 4
 <2><da8>: Abbrev Number: 3 (DW_TAG_member)
    <da9>   DW_AT_name        : (indirect string, offset: 0x898f8): Channel
    <dad>   DW_AT_decl_file   : 10
    <dae>   DW_AT_decl_line   : 342
    <db0>   DW_AT_decl_column : 38
    <db1>   DW_AT_type        : <0xd76>
    <db5>   DW_AT_data_member_location: 28
 <2><db6>: Abbrev Number: 3 (DW_TAG_member)
    <db7>   DW_AT_name        : (indirect string, offset: 0x89bba): hdma
    <dbb>   DW_AT_decl_file   : 10
    <dbc>   DW_AT_decl_line   : 343
    <dbe>   DW_AT_decl_column : 39
    <dbf>   DW_AT_type        : <0xe10>
    <dc3>   DW_AT_data_member_location: 32
 <2><dc4>: Abbrev Number: 3 (DW_TAG_member)
    <dc5>   DW_AT_name        : (indirect string, offset: 0x61e2b): Lock
    <dc9>   DW_AT_decl_file   : 10
    <dca>   DW_AT_decl_line   : 345
    <dcc>   DW_AT_decl_column : 38
    <dcd>   DW_AT_type        : <0x9b2>
    <dd1>   DW_AT_data_member_location: 60
 <2><dd2>: Abbrev Number: 3 (DW_TAG_member)
    <dd3>   DW_AT_name        : (indirect string, offset: 0x89c22): State
    <dd7>   DW_AT_decl_file   : 10
    <dd8>   DW_AT_decl_line   : 346
    <dda>   DW_AT_decl_column : 38
    <ddb>   DW_AT_type        : <0xce7>
    <ddf>   DW_AT_data_member_location: 61
 <2><de0>: Abbrev Number: 3 (DW_TAG_member)
    <de1>   DW_AT_name        : (indirect string, offset: 0x8bb5e): ChannelState
    <de5>   DW_AT_decl_file   : 10
    <de6>   DW_AT_decl_line   : 347
    <de8>   DW_AT_decl_column : 38
    <de9>   DW_AT_type        : <0xe35>
    <ded>   DW_AT_data_member_location: 62
 <2><dee>: Abbrev Number: 3 (DW_TAG_member)
    <def>   DW_AT_name        : (indirect string, offset: 0x8c161): ChannelNState
    <df3>   DW_AT_decl_file   : 10
    <df4>   DW_AT_decl_line   : 348
    <df6>   DW_AT_decl_column : 38
    <df7>   DW_AT_type        : <0xe35>
    <dfb>   DW_AT_data_member_location: 66
 <2><dfc>: Abbrev Number: 3 (DW_TAG_member)
    <dfd>   DW_AT_name        : (indirect string, offset: 0x8b6b5): DMABurstState
    <e01>   DW_AT_decl_file   : 10
    <e02>   DW_AT_decl_line   : 349
    <e04>   DW_AT_decl_column : 38
    <e05>   DW_AT_type        : <0xd47>
    <e09>   DW_AT_data_member_location: 70
 <2><e0a>: Abbrev Number: 0
 <1><e0b>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <e0c>   DW_AT_byte_size   : 4
    <e0c>   DW_AT_type        : <0x950>
 <1><e10>: Abbrev Number: 17 (DW_TAG_array_type)
    <e11>   DW_AT_type        : <0xe20>
    <e15>   DW_AT_sibling     : <0xe20>
 <2><e19>: Abbrev Number: 18 (DW_TAG_subrange_type)
    <e1a>   DW_AT_type        : <0x7a0>
    <e1e>   DW_AT_upper_bound : 6
 <2><e1f>: Abbrev Number: 0
 <1><e20>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <e21>   DW_AT_byte_size   : 4
    <e21>   DW_AT_type        : <0xc41>
 <1><e25>: Abbrev Number: 17 (DW_TAG_array_type)
    <e26>   DW_AT_type        : <0xd17>
    <e2a>   DW_AT_sibling     : <0xe35>
 <2><e2e>: Abbrev Number: 18 (DW_TAG_subrange_type)
    <e2f>   DW_AT_type        : <0x7a0>
    <e33>   DW_AT_upper_bound : 3
 <2><e34>: Abbrev Number: 0
 <1><e35>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <e36>   DW_AT_type        : <0xe25>
 <1><e3a>: Abbrev Number: 7 (DW_TAG_typedef)
    <e3b>   DW_AT_name        : (indirect string, offset: 0x899ba): TIM_HandleTypeDef
    <e3f>   DW_AT_decl_file   : 10
    <e40>   DW_AT_decl_line   : 380
    <e42>   DW_AT_decl_column : 3
    <e43>   DW_AT_type        : <0xd83>
 <1><e47>: Abbrev Number: 5 (DW_TAG_base_type)
    <e48>   DW_AT_byte_size   : 1
    <e49>   DW_AT_encoding    : 8	(unsigned char)
    <e4a>   DW_AT_name        : (indirect string, offset: 0x2c4fa): char
 <1><e4e>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <e4f>   DW_AT_encoding    : 5	(signed)
    <e50>   DW_AT_byte_size   : 4
    <e51>   DW_AT_type        : <0x799>
    <e55>   DW_AT_decl_file   : 11
    <e56>   DW_AT_decl_line   : 176
    <e57>   DW_AT_decl_column : 14
    <e58>   DW_AT_sibling     : <0xe90>
 <2><e5c>: Abbrev Number: 2 (DW_TAG_enumerator)
    <e5d>   DW_AT_name        : (indirect string, offset: 0x7912d): osOK
    <e61>   DW_AT_const_value : 0
 <2><e62>: Abbrev Number: 10 (DW_TAG_enumerator)
    <e63>   DW_AT_name        : (indirect string, offset: 0x3f82a): osError
    <e67>   DW_AT_const_value : -1
 <2><e68>: Abbrev Number: 10 (DW_TAG_enumerator)
    <e69>   DW_AT_name        : (indirect string, offset: 0x7bd66): osErrorTimeout
    <e6d>   DW_AT_const_value : -2
 <2><e6e>: Abbrev Number: 10 (DW_TAG_enumerator)
    <e6f>   DW_AT_name        : (indirect string, offset: 0x59730): osErrorResource
    <e73>   DW_AT_const_value : -3
 <2><e74>: Abbrev Number: 10 (DW_TAG_enumerator)
    <e75>   DW_AT_name        : (indirect string, offset: 0x239b6): osErrorParameter
    <e79>   DW_AT_const_value : -4
 <2><e7a>: Abbrev Number: 10 (DW_TAG_enumerator)
    <e7b>   DW_AT_name        : (indirect string, offset: 0x17f31): osErrorNoMemory
    <e7f>   DW_AT_const_value : -5
 <2><e80>: Abbrev Number: 10 (DW_TAG_enumerator)
    <e81>   DW_AT_name        : (indirect string, offset: 0x24dfd): osErrorISR
    <e85>   DW_AT_const_value : -6
 <2><e86>: Abbrev Number: 30 (DW_TAG_enumerator)
    <e87>   DW_AT_name        : (indirect string, offset: 0x44db7): osStatusReserved
    <e8b>   DW_AT_const_value : 0x7fffffff
 <2><e8f>: Abbrev Number: 0
 <1><e90>: Abbrev Number: 6 (DW_TAG_typedef)
    <e91>   DW_AT_name        : (indirect string, offset: 0x2ea83): osStatus_t
    <e95>   DW_AT_decl_file   : 11
    <e96>   DW_AT_decl_line   : 185
    <e97>   DW_AT_decl_column : 3
    <e98>   DW_AT_type        : <0xe4e>
 <1><e9c>: Abbrev Number: 19 (DW_TAG_subprogram)
    <e9d>   DW_AT_external    : 1
    <e9d>   DW_AT_name        : (indirect string, offset: 0x899ae): HAL_IncTick
    <ea1>   DW_AT_decl_file   : 12
    <ea2>   DW_AT_decl_line   : 295
    <ea4>   DW_AT_decl_column : 6
    <ea5>   DW_AT_prototyped  : 1
    <ea5>   DW_AT_declaration : 1
 <1><ea5>: Abbrev Number: 19 (DW_TAG_subprogram)
    <ea6>   DW_AT_external    : 1
    <ea6>   DW_AT_name        : (indirect string, offset: 0x899cc): HAL_RCC_EnableCSS
    <eaa>   DW_AT_decl_file   : 7
    <eab>   DW_AT_decl_line   : 1168
    <ead>   DW_AT_decl_column : 19
    <eae>   DW_AT_prototyped  : 1
    <eae>   DW_AT_declaration : 1
 <1><eae>: Abbrev Number: 20 (DW_TAG_subprogram)
    <eaf>   DW_AT_external    : 1
    <eaf>   DW_AT_name        : (indirect string, offset: 0x89d53): HAL_RCC_ClockConfig
    <eb3>   DW_AT_decl_file   : 7
    <eb3>   DW_AT_decl_line   : 1156
    <eb5>   DW_AT_decl_column : 19
    <eb5>   DW_AT_prototyped  : 1
    <eb5>   DW_AT_type        : <0x98b>
    <eb9>   DW_AT_declaration : 1
    <eb9>   DW_AT_sibling     : <0xec8>
 <2><ebd>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <ebe>   DW_AT_type        : <0xec8>
 <2><ec2>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <ec3>   DW_AT_type        : <0x7a7>
 <2><ec7>: Abbrev Number: 0
 <1><ec8>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <ec9>   DW_AT_byte_size   : 4
    <ec9>   DW_AT_type        : <0xa44>
 <1><ecd>: Abbrev Number: 20 (DW_TAG_subprogram)
    <ece>   DW_AT_external    : 1
    <ece>   DW_AT_name        : (indirect string, offset: 0x89c32): HAL_RCC_OscConfig
    <ed2>   DW_AT_decl_file   : 7
    <ed2>   DW_AT_decl_line   : 1155
    <ed4>   DW_AT_decl_column : 19
    <ed4>   DW_AT_prototyped  : 1
    <ed4>   DW_AT_type        : <0x98b>
    <ed8>   DW_AT_declaration : 1
    <ed8>   DW_AT_sibling     : <0xee2>
 <2><edc>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <edd>   DW_AT_type        : <0xee2>
 <2><ee1>: Abbrev Number: 0
 <1><ee2>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <ee3>   DW_AT_byte_size   : 4
    <ee3>   DW_AT_type        : <0xac1>
 <1><ee7>: Abbrev Number: 16 (DW_TAG_subprogram)
    <ee8>   DW_AT_external    : 1
    <ee8>   DW_AT_name        : (indirect string, offset: 0x89d31): osKernelStart
    <eec>   DW_AT_decl_file   : 11
    <eed>   DW_AT_decl_line   : 302
    <eef>   DW_AT_decl_column : 12
    <ef0>   DW_AT_prototyped  : 1
    <ef0>   DW_AT_type        : <0xe90>
    <ef4>   DW_AT_declaration : 1
 <1><ef4>: Abbrev Number: 21 (DW_TAG_subprogram)
    <ef5>   DW_AT_external    : 1
    <ef5>   DW_AT_name        : (indirect string, offset: 0x20001): MX_FREERTOS_Init
    <ef9>   DW_AT_decl_file   : 1
    <efa>   DW_AT_decl_line   : 52
    <efb>   DW_AT_decl_column : 6
    <efb>   DW_AT_prototyped  : 1
    <efb>   DW_AT_declaration : 1
 <1><efb>: Abbrev Number: 16 (DW_TAG_subprogram)
    <efc>   DW_AT_external    : 1
    <efc>   DW_AT_name        : (indirect string, offset: 0x898b9): osKernelInitialize
    <f00>   DW_AT_decl_file   : 11
    <f01>   DW_AT_decl_line   : 287
    <f03>   DW_AT_decl_column : 12
    <f04>   DW_AT_prototyped  : 1
    <f04>   DW_AT_type        : <0xe90>
    <f08>   DW_AT_declaration : 1
 <1><f08>: Abbrev Number: 21 (DW_TAG_subprogram)
    <f09>   DW_AT_external    : 1
    <f09>   DW_AT_name        : (indirect string, offset: 0x89776): MX_GPIO_Init
    <f0d>   DW_AT_decl_file   : 13
    <f0e>   DW_AT_decl_line   : 39
    <f0f>   DW_AT_decl_column : 6
    <f0f>   DW_AT_prototyped  : 1
    <f0f>   DW_AT_declaration : 1
 <1><f0f>: Abbrev Number: 16 (DW_TAG_subprogram)
    <f10>   DW_AT_external    : 1
    <f10>   DW_AT_name        : (indirect string, offset: 0x89de2): HAL_Init
    <f14>   DW_AT_decl_file   : 12
    <f15>   DW_AT_decl_line   : 282
    <f17>   DW_AT_decl_column : 19
    <f18>   DW_AT_prototyped  : 1
    <f18>   DW_AT_type        : <0x98b>
    <f1c>   DW_AT_declaration : 1
 <1><f1c>: Abbrev Number: 31 (DW_TAG_subprogram)
    <f1d>   DW_AT_external    : 1
    <f1d>   DW_AT_name        : (indirect string, offset: 0x89a81): Error_Handler
    <f21>   DW_AT_decl_file   : 1
    <f22>   DW_AT_decl_line   : 188
    <f23>   DW_AT_decl_column : 6
    <f24>   DW_AT_prototyped  : 1
    <f24>   DW_AT_low_pc      : 0x800033c
    <f28>   DW_AT_high_pc     : 0xc
    <f2c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f2e>   DW_AT_call_all_calls: 1
    <f2e>   DW_AT_sibling     : <0xf43>
 <2><f32>: Abbrev Number: 32 (DW_TAG_inlined_subroutine)
    <f33>   DW_AT_abstract_origin: <0xfb2>
    <f37>   DW_AT_low_pc      : 0x8000340
    <f3b>   DW_AT_high_pc     : 0x4
    <f3f>   DW_AT_call_file   : 1
    <f40>   DW_AT_call_line   : 192
    <f41>   DW_AT_call_column : 3
 <2><f42>: Abbrev Number: 0
 <1><f43>: Abbrev Number: 22 (DW_TAG_subprogram)
    <f44>   DW_AT_external    : 1
    <f44>   DW_AT_name        : (indirect string, offset: 0x898cc): HAL_TIM_PeriodElapsedCallback
    <f48>   DW_AT_decl_file   : 1
    <f48>   DW_AT_decl_line   : 170
    <f49>   DW_AT_decl_column : 6
    <f49>   DW_AT_prototyped  : 1
    <f49>   DW_AT_low_pc      : 0x8000318
    <f4d>   DW_AT_high_pc     : 0x24
    <f51>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f53>   DW_AT_call_all_tail_calls: 1
    <f53>   DW_AT_sibling     : <0xf67>
 <2><f57>: Abbrev Number: 33 (DW_TAG_formal_parameter)
    <f58>   DW_AT_name        : (indirect string, offset: 0x89ce5): htim
    <f5c>   DW_AT_decl_file   : 1
    <f5d>   DW_AT_decl_line   : 170
    <f5e>   DW_AT_decl_column : 55
    <f5f>   DW_AT_type        : <0xf67>
    <f63>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><f66>: Abbrev Number: 0
 <1><f67>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <f68>   DW_AT_byte_size   : 4
    <f68>   DW_AT_type        : <0xe3a>
 <1><f6c>: Abbrev Number: 22 (DW_TAG_subprogram)
    <f6d>   DW_AT_external    : 1
    <f6d>   DW_AT_name        : (indirect string, offset: 0x89c44): SystemClock_Config
    <f71>   DW_AT_decl_file   : 1
    <f71>   DW_AT_decl_line   : 119
    <f72>   DW_AT_decl_column : 6
    <f72>   DW_AT_prototyped  : 1
    <f72>   DW_AT_low_pc      : 0x8000288
    <f76>   DW_AT_high_pc     : 0x8e
    <f7a>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f7c>   DW_AT_call_all_tail_calls: 1
    <f7c>   DW_AT_sibling     : <0xf9c>
 <2><f80>: Abbrev Number: 23 (DW_TAG_variable)
    <f81>   DW_AT_name        : (indirect string, offset: 0x89935): RCC_OscInitStruct
    <f85>   DW_AT_decl_file   : 1
    <f85>   DW_AT_decl_line   : 121
    <f86>   DW_AT_decl_column : 22
    <f86>   DW_AT_type        : <0xac1>
    <f8a>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <2><f8d>: Abbrev Number: 23 (DW_TAG_variable)
    <f8e>   DW_AT_name        : (indirect string, offset: 0x89a24): RCC_ClkInitStruct
    <f92>   DW_AT_decl_file   : 1
    <f92>   DW_AT_decl_line   : 122
    <f93>   DW_AT_decl_column : 22
    <f93>   DW_AT_type        : <0xa44>
    <f97>   DW_AT_location    : 3 byte block: 91 bc 7f 	(DW_OP_fbreg: -68)
 <2><f9b>: Abbrev Number: 0
 <1><f9c>: Abbrev Number: 34 (DW_TAG_subprogram)
    <f9d>   DW_AT_external    : 1
    <f9d>   DW_AT_name        : (indirect string, offset: 0x89863): main
    <fa1>   DW_AT_decl_file   : 1
    <fa2>   DW_AT_decl_line   : 66
    <fa3>   DW_AT_decl_column : 5
    <fa4>   DW_AT_prototyped  : 1
    <fa4>   DW_AT_type        : <0x799>
    <fa8>   DW_AT_low_pc      : 0x8000268
    <fac>   DW_AT_high_pc     : 0x20
    <fb0>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <fb2>   DW_AT_call_all_tail_calls: 1
 <1><fb2>: Abbrev Number: 35 (DW_TAG_subprogram)
    <fb3>   DW_AT_name        : (indirect string, offset: 0x89b17): __disable_irq
    <fb7>   DW_AT_decl_file   : 2
    <fb8>   DW_AT_decl_line   : 140
    <fb9>   DW_AT_decl_column : 27
    <fba>   DW_AT_prototyped  : 1
    <fba>   DW_AT_inline      : 3	(declared as inline and inlined)
 <1><fbb>: Abbrev Number: 0
  Compilation Unit @ offset 0xfbc:
   Length:        0x35d (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x4fc
   Pointer Size:  4
 <0><fc8>: Abbrev Number: 13 (DW_TAG_compile_unit)
