Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x2cb (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 9 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x83144): GNU C11 13.3.1 20240614 -mcpu=cortex-m3 -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x22924): C:/Users/86173/Desktop/ProjectRequirement/MCU_Now/Lin_STM32/STM32_F103C8T6/6_DC_Motor/6_OMF_UartFeedback/Core/Src/dma.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x20635): C:/Users/86173/Desktop/ProjectRequirement/MCU_Now/Lin_STM32/STM32_F103C8T6/6_DC_Motor/6_OMF_UartFeedback/STM32CubeIDE/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <2b>   DW_AT_encoding    : 5	(signed)
    <2c>   DW_AT_byte_size   : 1
    <2d>   DW_AT_type        : <0x171>
    <31>   DW_AT_decl_file   : 2
    <32>   DW_AT_decl_line   : 69
    <33>   DW_AT_decl_column : 1
    <34>   DW_AT_sibling     : <0x171>
 <2><38>: Abbrev Number: 3 (DW_TAG_enumerator)
    <39>   DW_AT_name        : (indirect string, offset: 0x134df): NonMaskableInt_IRQn

 <2><110>: Abbrev Number: 1 (DW_TAG_enumerator)
    <111>   DW_AT_name        : (indirect string, offset: 0x63c7a): TIM1_CC_IRQn
    <115>   DW_AT_const_value : 27
 <2><116>: Abbrev Number: 1 (DW_TAG_enumerator)
    <117>   DW_AT_name        : (indirect string, offset: 0xf189): TIM2_IRQn
    <11b>   DW_AT_const_value : 28
 <2><11c>: Abbrev Number: 1 (DW_TAG_enumerator)
    <11d>   DW_AT_name        : (indirect string, offset: 0x4aa7a): TIM3_IRQn
    <121>   DW_AT_const_value : 29
 <2><122>: Abbrev Number: 1 (DW_TAG_enumerator)
    <123>   DW_AT_name        : (indirect string, offset: 0x2bad7): TIM4_IRQn
    <127>   DW_AT_const_value : 30
 <2><128>: Abbrev Number: 1 (DW_TAG_enumerator)
    <129>   DW_AT_name        : (indirect string, offset: 0x2c92a): I2C1_EV_IRQn
    <12d>   DW_AT_const_value : 31
 <2><12e>: Abbrev Number: 1 (DW_TAG_enumerator)
    <12f>   DW_AT_name        : (indirect string, offset: 0x5117f): I2C1_ER_IRQn
    <133>   DW_AT_const_value : 32
 <2><134>: Abbrev Number: 1 (DW_TAG_enumerator)
    <135>   DW_AT_name        : (indirect string, offset: 0xeee1): I2C2_EV_IRQn
    <139>   DW_AT_const_value : 33
 <2><13a>: Abbrev Number: 1 (DW_TAG_enumerator)
    <13b>   DW_AT_name        : (indirect string, offset: 0x33473): I2C2_ER_IRQn
    <13f>   DW_AT_const_value : 34
 <2><140>: Abbrev Number: 1 (DW_TAG_enumerator)
    <141>   DW_AT_name        : (indirect string, offset: 0xef74): SPI1_IRQn
    <145>   DW_AT_const_value : 35
 <2><146>: Abbrev Number: 1 (DW_TAG_enumerator)
    <147>   DW_AT_name        : (indirect string, offset: 0x4a7f3): SPI2_IRQn
    <14b>   DW_AT_const_value : 36
 <2><14c>: Abbrev Number: 1 (DW_TAG_enumerator)
    <14d>   DW_AT_name        : (indirect string, offset: 0x66c53): USART1_IRQn
    <151>   DW_AT_const_value : 37
 <2><152>: Abbrev Number: 1 (DW_TAG_enumerator)
    <153>   DW_AT_name        : (indirect string, offset: 0x1e0ef): USART2_IRQn
    <157>   DW_AT_const_value : 38
 <2><158>: Abbrev Number: 1 (DW_TAG_enumerator)
    <159>   DW_AT_name        : (indirect string, offset: 0x5a5e9): USART3_IRQn
    <15d>   DW_AT_const_value : 39
 <2><15e>: Abbrev Number: 1 (DW_TAG_enumerator)
    <15f>   DW_AT_name        : (indirect string, offset: 0x6e35d): EXTI15_10_IRQn
    <163>   DW_AT_const_value : 40
 <2><164>: Abbrev Number: 1 (DW_TAG_enumerator)
    <165>   DW_AT_name        : (indirect string, offset: 0x6f084): RTC_Alarm_IRQn
    <169>   DW_AT_const_value : 41
 <2><16a>: Abbrev Number: 1 (DW_TAG_enumerator)
    <16b>   DW_AT_name        : (indirect string, offset: 0x7eaba): USBWakeUp_IRQn
    <16f>   DW_AT_const_value : 42
 <2><170>: Abbrev Number: 0
 <1><171>: Abbrev Number: 2 (DW_TAG_base_type)
    <172>   DW_AT_byte_size   : 1
    <173>   DW_AT_encoding    : 6	(signed char)
    <174>   DW_AT_name        : (indirect string, offset: 0x420b3): signed char
 <1><178>: Abbrev Number: 6 (DW_TAG_typedef)
    <179>   DW_AT_name        : (indirect string, offset: 0x72dd7): IRQn_Type
    <17d>   DW_AT_decl_file   : 2
    <17e>   DW_AT_decl_line   : 125
    <17f>   DW_AT_decl_column : 3
    <180>   DW_AT_type        : <0x2a>
 <1><184>: Abbrev Number: 2 (DW_TAG_base_type)
    <185>   DW_AT_byte_size   : 1
    <186>   DW_AT_encoding    : 8	(unsigned char)
    <187>   DW_AT_name        : (indirect string, offset: 0x1a9a7): unsigned char
 <1><18b>: Abbrev Number: 2 (DW_TAG_base_type)
    <18c>   DW_AT_byte_size   : 2
    <18d>   DW_AT_encoding    : 5	(signed)
    <18e>   DW_AT_name        : (indirect string, offset: 0x6251f): short int
 <1><192>: Abbrev Number: 2 (DW_TAG_base_type)
    <193>   DW_AT_byte_size   : 2
    <194>   DW_AT_encoding    : 7	(unsigned)
    <195>   DW_AT_name        : (indirect string, offset: 0x2b13b): short unsigned int
 <1><199>: Abbrev Number: 2 (DW_TAG_base_type)
    <19a>   DW_AT_byte_size   : 4
    <19b>   DW_AT_encoding    : 5	(signed)
    <19c>   DW_AT_name        : (indirect string, offset: 0xb6ee): long int
 <1><1a0>: Abbrev Number: 6 (DW_TAG_typedef)
    <1a1>   DW_AT_name        : (indirect string, offset: 0x53d7e): __uint32_t
    <1a5>   DW_AT_decl_file   : 3
    <1a6>   DW_AT_decl_line   : 79
    <1a7>   DW_AT_decl_column : 25
    <1a8>   DW_AT_type        : <0x1ac>
 <1><1ac>: Abbrev Number: 2 (DW_TAG_base_type)
    <1ad>   DW_AT_byte_size   : 4
    <1ae>   DW_AT_encoding    : 7	(unsigned)
    <1af>   DW_AT_name        : (indirect string, offset: 0x1ed84): long unsigned int
 <1><1b3>: Abbrev Number: 2 (DW_TAG_base_type)
    <1b4>   DW_AT_byte_size   : 8
    <1b5>   DW_AT_encoding    : 5	(signed)
    <1b6>   DW_AT_name        : (indirect string, offset: 0x3c721): long long int
 <1><1ba>: Abbrev Number: 2 (DW_TAG_base_type)
    <1bb>   DW_AT_byte_size   : 8
    <1bc>   DW_AT_encoding    : 7	(unsigned)
    <1bd>   DW_AT_name        : (indirect string, offset: 0x1b18e): long long unsigned int
 <1><1c1>: Abbrev Number: 11 (DW_TAG_base_type)
    <1c2>   DW_AT_byte_size   : 4
    <1c3>   DW_AT_encoding    : 5	(signed)
    <1c4>   DW_AT_name        : int
 <1><1c8>: Abbrev Number: 2 (DW_TAG_base_type)
    <1c9>   DW_AT_byte_size   : 4
    <1ca>   DW_AT_encoding    : 7	(unsigned)
    <1cb>   DW_AT_name        : (indirect string, offset: 0xb0b1): unsigned int
 <1><1cf>: Abbrev Number: 6 (DW_TAG_typedef)
    <1d0>   DW_AT_name        : (indirect string, offset: 0x89d8e): uint32_t
    <1d4>   DW_AT_decl_file   : 4
    <1d5>   DW_AT_decl_line   : 48
    <1d6>   DW_AT_decl_column : 20
    <1d7>   DW_AT_type        : <0x1a0>
 <1><1db>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <1dc>   DW_AT_type        : <0x1cf>
 <1><1e0>: Abbrev Number: 13 (DW_TAG_structure_type)
    <1e1>   DW_AT_byte_size   : 40
    <1e2>   DW_AT_decl_file   : 2
    <1e3>   DW_AT_decl_line   : 423
    <1e5>   DW_AT_decl_column : 9
    <1e6>   DW_AT_sibling     : <0x262>
 <2><1ea>: Abbrev Number: 7 (DW_TAG_member)
    <1eb>   DW_AT_name        : CR
    <1ee>   DW_AT_decl_file   : 2
    <1ee>   DW_AT_decl_line   : 425
    <1f0>   DW_AT_decl_column : 17
    <1f0>   DW_AT_type        : <0x1db>
    <1f4>   DW_AT_data_member_location: 0
 <2><1f5>: Abbrev Number: 4 (DW_TAG_member)
    <1f6>   DW_AT_name        : (indirect string, offset: 0x4ff47): CFGR
    <1fa>   DW_AT_decl_file   : 2
    <1fa>   DW_AT_decl_line   : 426
    <1fc>   DW_AT_decl_column : 17
    <1fc>   DW_AT_type        : <0x1db>
    <200>   DW_AT_data_member_location: 4
 <2><201>: Abbrev Number: 7 (DW_TAG_member)
    <202>   DW_AT_name        : CIR
    <206>   DW_AT_decl_file   : 2
    <206>   DW_AT_decl_line   : 427
    <208>   DW_AT_decl_column : 17
    <208>   DW_AT_type        : <0x1db>
    <20c>   DW_AT_data_member_location: 8
 <2><20d>: Abbrev Number: 4 (DW_TAG_member)
    <20e>   DW_AT_name        : (indirect string, offset: 0x3999e): APB2RSTR
    <212>   DW_AT_decl_file   : 2
    <212>   DW_AT_decl_line   : 428
    <214>   DW_AT_decl_column : 17
    <214>   DW_AT_type        : <0x1db>
    <218>   DW_AT_data_member_location: 12
 <2><219>: Abbrev Number: 4 (DW_TAG_member)
    <21a>   DW_AT_name        : (indirect string, offset: 0xf13b): APB1RSTR
    <21e>   DW_AT_decl_file   : 2
    <21e>   DW_AT_decl_line   : 429
    <220>   DW_AT_decl_column : 17
    <220>   DW_AT_type        : <0x1db>
    <224>   DW_AT_data_member_location: 16
 <2><225>: Abbrev Number: 4 (DW_TAG_member)
    <226>   DW_AT_name        : (indirect string, offset: 0xc4fc): AHBENR
    <22a>   DW_AT_decl_file   : 2
    <22a>   DW_AT_decl_line   : 430
    <22c>   DW_AT_decl_column : 17
    <22c>   DW_AT_type        : <0x1db>
    <230>   DW_AT_data_member_location: 20
 <2><231>: Abbrev Number: 4 (DW_TAG_member)
    <232>   DW_AT_name        : (indirect string, offset: 0xfb75): APB2ENR
    <236>   DW_AT_decl_file   : 2
    <236>   DW_AT_decl_line   : 431
    <238>   DW_AT_decl_column : 17
    <238>   DW_AT_type        : <0x1db>
    <23c>   DW_AT_data_member_location: 24
 <2><23d>: Abbrev Number: 4 (DW_TAG_member)
    <23e>   DW_AT_name        : (indirect string, offset: 0x6345e): APB1ENR
    <242>   DW_AT_decl_file   : 2
    <242>   DW_AT_decl_line   : 432
    <244>   DW_AT_decl_column : 17
    <244>   DW_AT_type        : <0x1db>
    <248>   DW_AT_data_member_location: 28
 <2><249>: Abbrev Number: 4 (DW_TAG_member)
    <24a>   DW_AT_name        : (indirect string, offset: 0x1228b): BDCR
    <24e>   DW_AT_decl_file   : 2
    <24e>   DW_AT_decl_line   : 433
    <250>   DW_AT_decl_column : 17
    <250>   DW_AT_type        : <0x1db>
    <254>   DW_AT_data_member_location: 32
 <2><255>: Abbrev Number: 7 (DW_TAG_member)
    <256>   DW_AT_name        : CSR
    <25a>   DW_AT_decl_file   : 2
    <25a>   DW_AT_decl_line   : 434
    <25c>   DW_AT_decl_column : 17
    <25c>   DW_AT_type        : <0x1db>
    <260>   DW_AT_data_member_location: 36
 <2><261>: Abbrev Number: 0
 <1><262>: Abbrev Number: 14 (DW_TAG_typedef)
    <263>   DW_AT_name        : (indirect string, offset: 0x3d4f5): RCC_TypeDef
    <267>   DW_AT_decl_file   : 2
    <268>   DW_AT_decl_line   : 437
    <26a>   DW_AT_decl_column : 3
    <26b>   DW_AT_type        : <0x1e0>
 <1><26f>: Abbrev Number: 2 (DW_TAG_base_type)
    <270>   DW_AT_byte_size   : 8
    <271>   DW_AT_encoding    : 4	(float)
    <272>   DW_AT_name        : (indirect string, offset: 0x842e8): long double
 <1><276>: Abbrev Number: 8 (DW_TAG_subprogram)
    <277>   DW_AT_external    : 1
    <277>   DW_AT_name        : (indirect string, offset: 0x10275): HAL_NVIC_EnableIRQ
    <27b>   DW_AT_decl_file   : 5
    <27b>   DW_AT_decl_line   : 263
    <27d>   DW_AT_decl_column : 6
    <27d>   DW_AT_prototyped  : 1
    <27d>   DW_AT_declaration : 1
    <27d>   DW_AT_sibling     : <0x287>
 <2><281>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <282>   DW_AT_type        : <0x178>
 <2><286>: Abbrev Number: 0
 <1><287>: Abbrev Number: 8 (DW_TAG_subprogram)
    <288>   DW_AT_external    : 1
    <288>   DW_AT_name        : (indirect string, offset: 0x6d4cd): HAL_NVIC_SetPriority
    <28c>   DW_AT_decl_file   : 5
    <28c>   DW_AT_decl_line   : 262
    <28e>   DW_AT_decl_column : 6
    <28e>   DW_AT_prototyped  : 1
    <28e>   DW_AT_declaration : 1
    <28e>   DW_AT_sibling     : <0x2a2>
 <2><292>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <293>   DW_AT_type        : <0x178>
 <2><297>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <298>   DW_AT_type        : <0x1cf>
 <2><29c>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <29d>   DW_AT_type        : <0x1cf>
 <2><2a1>: Abbrev Number: 0
 <1><2a2>: Abbrev Number: 15 (DW_TAG_subprogram)
    <2a3>   DW_AT_external    : 1
    <2a3>   DW_AT_name        : (indirect string, offset: 0x4bc71): MX_DMA_Init
    <2a7>   DW_AT_decl_file   : 1
    <2a8>   DW_AT_decl_line   : 39
    <2a9>   DW_AT_decl_column : 6
    <2aa>   DW_AT_prototyped  : 1
    <2aa>   DW_AT_low_pc      : 0x8000160
    <2ae>   DW_AT_high_pc     : 0x5c
    <2b2>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <2b4>   DW_AT_call_all_tail_calls: 1
 <2><2b4>: Abbrev Number: 16 (DW_TAG_lexical_block)
    <2b5>   DW_AT_low_pc      : 0x8000166
    <2b9>   DW_AT_high_pc     : 0x18
 <3><2bd>: Abbrev Number: 17 (DW_TAG_variable)
    <2be>   DW_AT_name        : (indirect string, offset: 0xf6f): tmpreg
    <2c2>   DW_AT_decl_file   : 1
    <2c3>   DW_AT_decl_line   : 43
    <2c4>   DW_AT_decl_column : 3
    <2c5>   DW_AT_type        : <0x1db>
    <2c9>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><2cc>: Abbrev Number: 0
 <2><2cd>: Abbrev Number: 0
 <1><2ce>: Abbrev Number: 0
  Compilation Unit @ offset 0x2cf:
   Length:        0x18cd (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0xfc
   Pointer Size:  4
 <0><2db>: Abbrev Number: 38 (DW_TAG_compile_unit)
    <2dc>   DW_AT_producer    : (indirect string, offset: 0x83144): GNU C11 13.3.1 20240614 -mcpu=cortex-m3 -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <2e0>   DW_AT_language    : 29	(C11)
    <2e1>   DW_AT_name        : (indirect string, offset: 0x838e0): C:/Users/86173/Desktop/ProjectRequirement/MCU_Now/Lin_STM32/STM32_F103C8T6/6_DC_Motor/6_OMF_UartFeedback/Core/Src/freertos.c
    <2e5>   DW_AT_comp_dir    : (indirect string, offset: 0x20635): C:/Users/86173/Desktop/ProjectRequirement/MCU_Now/Lin_STM32/STM32_F103C8T6/6_DC_Motor/6_OMF_UartFeedback/STM32CubeIDE/Debug
    <2e9>   DW_AT_ranges      : 0x1f
    <2ed>   DW_AT_low_pc      : 0
    <2f1>   DW_AT_stmt_list   : 0x814
    <2f5>   DW_AT_macros      : 0x159b3
 <1><2f9>: Abbrev Number: 39 (DW_TAG_base_type)
    <2fa>   DW_AT_byte_size   : 4
    <2fb>   DW_AT_encoding    : 5	(signed)
    <2fc>   DW_AT_name        : int
 <1><300>: Abbrev Number: 13 (DW_TAG_base_type)
    <301>   DW_AT_byte_size   : 4
    <302>   DW_AT_encoding    : 7	(unsigned)
    <303>   DW_AT_name        : (indirect string, offset: 0xb0b1): unsigned int
 <1><307>: Abbrev Number: 13 (DW_TAG_base_type)
    <308>   DW_AT_byte_size   : 8
    <309>   DW_AT_encoding    : 5	(signed)
    <30a>   DW_AT_name        : (indirect string, offset: 0x3c721): long long int
 <1><30e>: Abbrev Number: 13 (DW_TAG_base_type)
    <30f>   DW_AT_byte_size   : 8
    <310>   DW_AT_encoding    : 4	(float)
    <311>   DW_AT_name        : (indirect string, offset: 0x842e8): long double
 <1><315>: Abbrev Number: 13 (DW_TAG_base_type)
    <316>   DW_AT_byte_size   : 1
    <317>   DW_AT_encoding    : 6	(signed char)
    <318>   DW_AT_name        : (indirect string, offset: 0x420b3): signed char
 <1><31c>: Abbrev Number: 5 (DW_TAG_typedef)
    <31d>   DW_AT_name        : (indirect string, offset: 0x85f18): __uint8_t
    <321>   DW_AT_decl_file   : 2
    <322>   DW_AT_decl_line   : 43
    <323>   DW_AT_decl_column : 24
    <324>   DW_AT_type        : <0x328>
 <1><328>: Abbrev Number: 13 (DW_TAG_base_type)
    <329>   DW_AT_byte_size   : 1
    <32a>   DW_AT_encoding    : 8	(unsigned char)
    <32b>   DW_AT_name        : (indirect string, offset: 0x1a9a7): unsigned char
 <1><32f>: Abbrev Number: 5 (DW_TAG_typedef)
    <330>   DW_AT_name        : (indirect string, offset: 0x8aa4c): __int16_t
    <334>   DW_AT_decl_file   : 2
    <335>   DW_AT_decl_line   : 55
    <336>   DW_AT_decl_column : 24
    <337>   DW_AT_type        : <0x33b>
 <1><33b>: Abbrev Number: 13 (DW_TAG_base_type)
    <33c>   DW_AT_byte_size   : 2
    <33d>   DW_AT_encoding    : 5	(signed)
    <33e>   DW_AT_name        : (indirect string, offset: 0x6251f): short int
 <1><342>: Abbrev Number: 5 (DW_TAG_typedef)
    <343>   DW_AT_name        : (indirect string, offset: 0x8ad14): __uint16_t
    <347>   DW_AT_decl_file   : 2
    <348>   DW_AT_decl_line   : 57
    <349>   DW_AT_decl_column : 25
    <34a>   DW_AT_type        : <0x34e>
 <1><34e>: Abbrev Number: 13 (DW_TAG_base_type)
    <34f>   DW_AT_byte_size   : 2
    <350>   DW_AT_encoding    : 7	(unsigned)
    <351>   DW_AT_name        : (indirect string, offset: 0x2b13b): short unsigned int
 <1><355>: Abbrev Number: 13 (DW_TAG_base_type)
    <356>   DW_AT_byte_size   : 4
    <357>   DW_AT_encoding    : 5	(signed)
    <358>   DW_AT_name        : (indirect string, offset: 0xb6ee): long int
 <1><35c>: Abbrev Number: 5 (DW_TAG_typedef)
    <35d>   DW_AT_name        : (indirect string, offset: 0x53d7e): __uint32_t
    <361>   DW_AT_decl_file   : 2
    <362>   DW_AT_decl_line   : 79
    <363>   DW_AT_decl_column : 25
    <364>   DW_AT_type        : <0x368>
 <1><368>: Abbrev Number: 13 (DW_TAG_base_type)
    <369>   DW_AT_byte_size   : 4
    <36a>   DW_AT_encoding    : 7	(unsigned)
    <36b>   DW_AT_name        : (indirect string, offset: 0x1ed84): long unsigned int
 <1><36f>: Abbrev Number: 13 (DW_TAG_base_type)
    <370>   DW_AT_byte_size   : 8
    <371>   DW_AT_encoding    : 7	(unsigned)
    <372>   DW_AT_name        : (indirect string, offset: 0x1b18e): long long unsigned int
 <1><376>: Abbrev Number: 5 (DW_TAG_typedef)
    <377>   DW_AT_name        : (indirect string, offset: 0x85f1a): uint8_t
    <37b>   DW_AT_decl_file   : 3
    <37c>   DW_AT_decl_line   : 24
    <37d>   DW_AT_decl_column : 19
    <37e>   DW_AT_type        : <0x31c>
 <1><382>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <383>   DW_AT_type        : <0x376>
 <1><387>: Abbrev Number: 23 (DW_TAG_const_type)
    <388>   DW_AT_type        : <0x376>
 <1><38c>: Abbrev Number: 5 (DW_TAG_typedef)
    <38d>   DW_AT_name        : (indirect string, offset: 0x8aa4e): int16_t
    <391>   DW_AT_decl_file   : 3
    <392>   DW_AT_decl_line   : 32
    <393>   DW_AT_decl_column : 19
    <394>   DW_AT_type        : <0x32f>
 <1><398>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <399>   DW_AT_type        : <0x38c>
 <1><39d>: Abbrev Number: 5 (DW_TAG_typedef)
    <39e>   DW_AT_name        : (indirect string, offset: 0x89ddb): uint16_t
    <3a2>   DW_AT_decl_file   : 3
    <3a3>   DW_AT_decl_line   : 36
    <3a4>   DW_AT_decl_column : 20
    <3a5>   DW_AT_type        : <0x342>
 <1><3a9>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <3aa>   DW_AT_type        : <0x39d>
 <1><3ae>: Abbrev Number: 5 (DW_TAG_typedef)
    <3af>   DW_AT_name        : (indirect string, offset: 0x89d8e): uint32_t
    <3b3>   DW_AT_decl_file   : 3
    <3b4>   DW_AT_decl_line   : 48
    <3b5>   DW_AT_decl_column : 20
    <3b6>   DW_AT_type        : <0x35c>
 <1><3ba>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <3bb>   DW_AT_type        : <0x3ae>
 <1><3bf>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <3c0>   DW_AT_byte_size   : 4
    <3c0>   DW_AT_type        : <0x3c4>
 <1><3c4>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <3c5>   DW_AT_prototyped  : 1
    <3c5>   DW_AT_sibling     : <0x3cf>
 <2><3c9>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <3ca>   DW_AT_type        : <0x3cf>
 <2><3ce>: Abbrev Number: 0
 <1><3cf>: Abbrev Number: 40 (DW_TAG_pointer_type)
    <3d0>   DW_AT_byte_size   : 4
 <1><3d1>: Abbrev Number: 5 (DW_TAG_typedef)
    <3d2>   DW_AT_name        : (indirect string, offset: 0x8bdde): UBaseType_t
    <3d6>   DW_AT_decl_file   : 4
    <3d7>   DW_AT_decl_line   : 57
    <3d8>   DW_AT_decl_column : 23
    <3d9>   DW_AT_type        : <0x368>
 <1><3dd>: Abbrev Number: 5 (DW_TAG_typedef)
    <3de>   DW_AT_name        : (indirect string, offset: 0x88274): TickType_t
    <3e2>   DW_AT_decl_file   : 4
    <3e3>   DW_AT_decl_line   : 63
    <3e4>   DW_AT_decl_column : 19
    <3e5>   DW_AT_type        : <0x3ae>
 <1><3e9>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <3ea>   DW_AT_byte_size   : 4
    <3ea>   DW_AT_type        : <0x376>
 <1><3ee>: Abbrev Number: 10 (DW_TAG_typedef)
    <3ef>   DW_AT_name        : (indirect string, offset: 0x8c97f): wint_t
    <3f3>   DW_AT_decl_file   : 5
    <3f4>   DW_AT_decl_line   : 359
    <3f6>   DW_AT_decl_column : 23
    <3f7>   DW_AT_type        : <0x300>
 <1><3fb>: Abbrev Number: 5 (DW_TAG_typedef)
    <3fc>   DW_AT_name        : (indirect string, offset: 0x8bba9): _off_t
    <400>   DW_AT_decl_file   : 6
    <401>   DW_AT_decl_line   : 46
    <402>   DW_AT_decl_column : 14
    <403>   DW_AT_type        : <0x355>
 <1><407>: Abbrev Number: 5 (DW_TAG_typedef)
    <408>   DW_AT_name        : (indirect string, offset: 0x855ef): _fpos_t
    <40c>   DW_AT_decl_file   : 6
    <40d>   DW_AT_decl_line   : 116
    <40e>   DW_AT_decl_column : 14
    <40f>   DW_AT_type        : <0x355>
 <1><413>: Abbrev Number: 41 (DW_TAG_union_type)
    <414>   DW_AT_byte_size   : 4
    <415>   DW_AT_decl_file   : 6
    <416>   DW_AT_decl_line   : 165
    <417>   DW_AT_decl_column : 3
    <418>   DW_AT_sibling     : <0x433>
 <2><41c>: Abbrev Number: 28 (DW_TAG_member)
    <41d>   DW_AT_name        : (indirect string, offset: 0x8a370): __wch
    <421>   DW_AT_decl_file   : 6
    <421>   DW_AT_decl_line   : 167
    <422>   DW_AT_decl_column : 12
    <423>   DW_AT_type        : <0x3ee>
 <2><427>: Abbrev Number: 28 (DW_TAG_member)
    <428>   DW_AT_name        : (indirect string, offset: 0x87d45): __wchb
    <42c>   DW_AT_decl_file   : 6
    <42c>   DW_AT_decl_line   : 168
    <42d>   DW_AT_decl_column : 19
    <42e>   DW_AT_type        : <0x433>
 <2><432>: Abbrev Number: 0
 <1><433>: Abbrev Number: 9 (DW_TAG_array_type)
    <434>   DW_AT_type        : <0x328>
    <438>   DW_AT_sibling     : <0x443>
 <2><43c>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <43d>   DW_AT_type        : <0x300>
    <441>   DW_AT_upper_bound : 3
 <2><442>: Abbrev Number: 0
 <1><443>: Abbrev Number: 18 (DW_TAG_structure_type)
    <444>   DW_AT_byte_size   : 8
    <445>   DW_AT_decl_file   : 6
    <446>   DW_AT_decl_line   : 162
    <447>   DW_AT_decl_column : 9
    <447>   DW_AT_sibling     : <0x466>
 <2><44b>: Abbrev Number: 1 (DW_TAG_member)
    <44c>   DW_AT_name        : (indirect string, offset: 0x85e43): __count
    <450>   DW_AT_decl_file   : 6
    <451>   DW_AT_decl_line   : 164
    <452>   DW_AT_decl_column : 7
    <453>   DW_AT_type        : <0x2f9>
    <457>   DW_AT_data_member_location: 0
 <2><458>: Abbrev Number: 1 (DW_TAG_member)
    <459>   DW_AT_name        : (indirect string, offset: 0x88625): __value
    <45d>   DW_AT_decl_file   : 6
    <45e>   DW_AT_decl_line   : 169
    <45f>   DW_AT_decl_column : 5
    <460>   DW_AT_type        : <0x413>
    <464>   DW_AT_data_member_location: 4
 <2><465>: Abbrev Number: 0
 <1><466>: Abbrev Number: 5 (DW_TAG_typedef)
    <467>   DW_AT_name        : (indirect string, offset: 0x87ed1): _mbstate_t
    <46b>   DW_AT_decl_file   : 6
    <46c>   DW_AT_decl_line   : 170
    <46d>   DW_AT_decl_column : 3
    <46e>   DW_AT_type        : <0x443>
 <1><472>: Abbrev Number: 5 (DW_TAG_typedef)
    <473>   DW_AT_name        : (indirect string, offset: 0x880e3): __ULong
    <477>   DW_AT_decl_file   : 7
    <478>   DW_AT_decl_line   : 23
    <479>   DW_AT_decl_column : 25
    <47a>   DW_AT_type        : <0x368>
 <1><47e>: Abbrev Number: 5 (DW_TAG_typedef)
    <47f>   DW_AT_name        : (indirect string, offset: 0x8825f): _LOCK_T
    <483>   DW_AT_decl_file   : 8
    <484>   DW_AT_decl_line   : 34
    <485>   DW_AT_decl_column : 25
    <486>   DW_AT_type        : <0x48a>
 <1><48a>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <48b>   DW_AT_byte_size   : 4
    <48b>   DW_AT_type        : <0x48f>
 <1><48f>: Abbrev Number: 29 (DW_TAG_structure_type)
    <490>   DW_AT_name        : (indirect string, offset: 0x848b4): __lock
    <494>   DW_AT_declaration : 1
 <1><494>: Abbrev Number: 5 (DW_TAG_typedef)
    <495>   DW_AT_name        : (indirect string, offset: 0x87aee): _flock_t
    <499>   DW_AT_decl_file   : 7
    <49a>   DW_AT_decl_line   : 36
    <49b>   DW_AT_decl_column : 27
    <49c>   DW_AT_type        : <0x47e>
 <1><4a0>: Abbrev Number: 19 (DW_TAG_structure_type)
    <4a1>   DW_AT_name        : (indirect string, offset: 0x8657a): _Bigint
    <4a5>   DW_AT_byte_size   : 24
    <4a6>   DW_AT_decl_file   : 7
    <4a7>   DW_AT_decl_line   : 53
    <4a8>   DW_AT_decl_column : 8
    <4a9>   DW_AT_sibling     : <0x4f8>
 <2><4ad>: Abbrev Number: 1 (DW_TAG_member)
    <4ae>   DW_AT_name        : (indirect string, offset: 0x88901): _next
    <4b2>   DW_AT_decl_file   : 7
    <4b3>   DW_AT_decl_line   : 55
    <4b4>   DW_AT_decl_column : 19
    <4b5>   DW_AT_type        : <0x4f8>
    <4b9>   DW_AT_data_member_location: 0
 <2><4ba>: Abbrev Number: 14 (DW_TAG_member)
    <4bb>   DW_AT_name        : _k
    <4be>   DW_AT_decl_file   : 7
    <4be>   DW_AT_decl_line   : 56
    <4bf>   DW_AT_decl_column : 7
    <4c0>   DW_AT_type        : <0x2f9>
    <4c4>   DW_AT_data_member_location: 4
 <2><4c5>: Abbrev Number: 1 (DW_TAG_member)
    <4c6>   DW_AT_name        : (indirect string, offset: 0x89c93): _maxwds
    <4ca>   DW_AT_decl_file   : 7
    <4cb>   DW_AT_decl_line   : 56
    <4cc>   DW_AT_decl_column : 11
    <4cd>   DW_AT_type        : <0x2f9>
    <4d1>   DW_AT_data_member_location: 8
 <2><4d2>: Abbrev Number: 1 (DW_TAG_member)
    <4d3>   DW_AT_name        : (indirect string, offset: 0x88007): _sign
    <4d7>   DW_AT_decl_file   : 7
    <4d8>   DW_AT_decl_line   : 56
    <4d9>   DW_AT_decl_column : 20
    <4da>   DW_AT_type        : <0x2f9>
    <4de>   DW_AT_data_member_location: 12
 <2><4df>: Abbrev Number: 1 (DW_TAG_member)
    <4e0>   DW_AT_name        : (indirect string, offset: 0x87fba): _wds
    <4e4>   DW_AT_decl_file   : 7
    <4e5>   DW_AT_decl_line   : 56
    <4e6>   DW_AT_decl_column : 27
    <4e7>   DW_AT_type        : <0x2f9>
    <4eb>   DW_AT_data_member_location: 16
 <2><4ec>: Abbrev Number: 14 (DW_TAG_member)
    <4ed>   DW_AT_name        : _x
    <4f0>   DW_AT_decl_file   : 7
    <4f0>   DW_AT_decl_line   : 57
    <4f1>   DW_AT_decl_column : 11
    <4f2>   DW_AT_type        : <0x4fd>
    <4f6>   DW_AT_data_member_location: 20
 <2><4f7>: Abbrev Number: 0
 <1><4f8>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <4f9>   DW_AT_byte_size   : 4
    <4f9>   DW_AT_type        : <0x4a0>
 <1><4fd>: Abbrev Number: 9 (DW_TAG_array_type)
    <4fe>   DW_AT_type        : <0x472>
    <502>   DW_AT_sibling     : <0x50d>
 <2><506>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <507>   DW_AT_type        : <0x300>
    <50b>   DW_AT_upper_bound : 0
 <2><50c>: Abbrev Number: 0
 <1><50d>: Abbrev Number: 19 (DW_TAG_structure_type)
    <50e>   DW_AT_name        : (indirect string, offset: 0x85d0a): __tm
    <512>   DW_AT_byte_size   : 36
    <513>   DW_AT_decl_file   : 7
    <514>   DW_AT_decl_line   : 61
    <515>   DW_AT_decl_column : 8
    <516>   DW_AT_sibling     : <0x590>
 <2><51a>: Abbrev Number: 1 (DW_TAG_member)
    <51b>   DW_AT_name        : (indirect string, offset: 0x8ad4a): __tm_sec
    <51f>   DW_AT_decl_file   : 7
    <520>   DW_AT_decl_line   : 63
    <521>   DW_AT_decl_column : 9
    <522>   DW_AT_type        : <0x2f9>
    <526>   DW_AT_data_member_location: 0
 <2><527>: Abbrev Number: 1 (DW_TAG_member)
    <528>   DW_AT_name        : (indirect string, offset: 0x837b5): __tm_min
    <52c>   DW_AT_decl_file   : 7
    <52d>   DW_AT_decl_line   : 64
    <52e>   DW_AT_decl_column : 9
    <52f>   DW_AT_type        : <0x2f9>
    <533>   DW_AT_data_member_location: 4
 <2><534>: Abbrev Number: 1 (DW_TAG_member)
    <535>   DW_AT_name        : (indirect string, offset: 0x85481): __tm_hour
    <539>   DW_AT_decl_file   : 7
    <53a>   DW_AT_decl_line   : 65
    <53b>   DW_AT_decl_column : 9
    <53c>   DW_AT_type        : <0x2f9>
    <540>   DW_AT_data_member_location: 8
 <2><541>: Abbrev Number: 1 (DW_TAG_member)
    <542>   DW_AT_name        : (indirect string, offset: 0x8888a): __tm_mday
    <546>   DW_AT_decl_file   : 7
    <547>   DW_AT_decl_line   : 66
    <548>   DW_AT_decl_column : 9
    <549>   DW_AT_type        : <0x2f9>
    <54d>   DW_AT_data_member_location: 12
 <2><54e>: Abbrev Number: 1 (DW_TAG_member)
    <54f>   DW_AT_name        : (indirect string, offset: 0x8397e): __tm_mon
    <553>   DW_AT_decl_file   : 7
    <554>   DW_AT_decl_line   : 67
    <555>   DW_AT_decl_column : 9
    <556>   DW_AT_type        : <0x2f9>
    <55a>   DW_AT_data_member_location: 16
 <2><55b>: Abbrev Number: 1 (DW_TAG_member)
    <55c>   DW_AT_name        : (indirect string, offset: 0x8becc): __tm_year
    <560>   DW_AT_decl_file   : 7
    <561>   DW_AT_decl_line   : 68
    <562>   DW_AT_decl_column : 9
    <563>   DW_AT_type        : <0x2f9>
    <567>   DW_AT_data_member_location: 20
 <2><568>: Abbrev Number: 1 (DW_TAG_member)
    <569>   DW_AT_name        : (indirect string, offset: 0x87164): __tm_wday
    <56d>   DW_AT_decl_file   : 7
    <56e>   DW_AT_decl_line   : 69
    <56f>   DW_AT_decl_column : 9
    <570>   DW_AT_type        : <0x2f9>
    <574>   DW_AT_data_member_location: 24
 <2><575>: Abbrev Number: 1 (DW_TAG_member)
    <576>   DW_AT_name        : (indirect string, offset: 0x8b343): __tm_yday
    <57a>   DW_AT_decl_file   : 7
    <57b>   DW_AT_decl_line   : 70
    <57c>   DW_AT_decl_column : 9
    <57d>   DW_AT_type        : <0x2f9>
    <581>   DW_AT_data_member_location: 28
 <2><582>: Abbrev Number: 1 (DW_TAG_member)
    <583>   DW_AT_name        : (indirect string, offset: 0x8ba94): __tm_isdst
    <587>   DW_AT_decl_file   : 7
    <588>   DW_AT_decl_line   : 71
    <589>   DW_AT_decl_column : 9
    <58a>   DW_AT_type        : <0x2f9>
    <58e>   DW_AT_data_member_location: 32
 <2><58f>: Abbrev Number: 0
 <1><590>: Abbrev Number: 19 (DW_TAG_structure_type)
    <591>   DW_AT_name        : (indirect string, offset: 0x8929e): __sbuf
    <595>   DW_AT_byte_size   : 8
    <596>   DW_AT_decl_file   : 7
    <597>   DW_AT_decl_line   : 116
    <598>   DW_AT_decl_column : 8
    <599>   DW_AT_sibling     : <0x5b8>
 <2><59d>: Abbrev Number: 1 (DW_TAG_member)
    <59e>   DW_AT_name        : (indirect string, offset: 0x8c877): _base
    <5a2>   DW_AT_decl_file   : 7
    <5a3>   DW_AT_decl_line   : 117
    <5a4>   DW_AT_decl_column : 17
    <5a5>   DW_AT_type        : <0x5b8>
    <5a9>   DW_AT_data_member_location: 0
 <2><5aa>: Abbrev Number: 1 (DW_TAG_member)
    <5ab>   DW_AT_name        : (indirect string, offset: 0x84601): _size
    <5af>   DW_AT_decl_file   : 7
    <5b0>   DW_AT_decl_line   : 118
    <5b1>   DW_AT_decl_column : 6
    <5b2>   DW_AT_type        : <0x2f9>
    <5b6>   DW_AT_data_member_location: 4
 <2><5b7>: Abbrev Number: 0
 <1><5b8>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <5b9>   DW_AT_byte_size   : 4
    <5b9>   DW_AT_type        : <0x328>
 <1><5bd>: Abbrev Number: 19 (DW_TAG_structure_type)
    <5be>   DW_AT_name        : (indirect string, offset: 0x8a297): __sFILE
    <5c2>   DW_AT_byte_size   : 104
    <5c3>   DW_AT_decl_file   : 7
    <5c4>   DW_AT_decl_line   : 153
    <5c5>   DW_AT_decl_column : 8
    <5c6>   DW_AT_sibling     : <0x6f8>
 <2><5ca>: Abbrev Number: 14 (DW_TAG_member)
    <5cb>   DW_AT_name        : _p
    <5ce>   DW_AT_decl_file   : 7
    <5ce>   DW_AT_decl_line   : 154
    <5cf>   DW_AT_decl_column : 18
    <5d0>   DW_AT_type        : <0x5b8>
    <5d4>   DW_AT_data_member_location: 0
 <2><5d5>: Abbrev Number: 14 (DW_TAG_member)
    <5d6>   DW_AT_name        : _r
    <5d9>   DW_AT_decl_file   : 7
    <5d9>   DW_AT_decl_line   : 155
    <5da>   DW_AT_decl_column : 7
    <5db>   DW_AT_type        : <0x2f9>
    <5df>   DW_AT_data_member_location: 4
 <2><5e0>: Abbrev Number: 14 (DW_TAG_member)
    <5e1>   DW_AT_name        : _w
    <5e4>   DW_AT_decl_file   : 7
    <5e4>   DW_AT_decl_line   : 156
    <5e5>   DW_AT_decl_column : 7
    <5e6>   DW_AT_type        : <0x2f9>
    <5ea>   DW_AT_data_member_location: 8
 <2><5eb>: Abbrev Number: 1 (DW_TAG_member)
    <5ec>   DW_AT_name        : (indirect string, offset: 0x876e2): _flags
    <5f0>   DW_AT_decl_file   : 7
    <5f1>   DW_AT_decl_line   : 157
    <5f2>   DW_AT_decl_column : 9
    <5f3>   DW_AT_type        : <0x33b>
    <5f7>   DW_AT_data_member_location: 12
 <2><5f8>: Abbrev Number: 1 (DW_TAG_member)
    <5f9>   DW_AT_name        : (indirect string, offset: 0x84c96): _file
    <5fd>   DW_AT_decl_file   : 7
    <5fe>   DW_AT_decl_line   : 158
    <5ff>   DW_AT_decl_column : 9
    <600>   DW_AT_type        : <0x33b>
    <604>   DW_AT_data_member_location: 14
 <2><605>: Abbrev Number: 14 (DW_TAG_member)
    <606>   DW_AT_name        : _bf
    <60a>   DW_AT_decl_file   : 7
    <60a>   DW_AT_decl_line   : 159
    <60b>   DW_AT_decl_column : 17
    <60c>   DW_AT_type        : <0x590>
    <610>   DW_AT_data_member_location: 16
 <2><611>: Abbrev Number: 1 (DW_TAG_member)
    <612>   DW_AT_name        : (indirect string, offset: 0x87776): _lbfsize
    <616>   DW_AT_decl_file   : 7
    <617>   DW_AT_decl_line   : 160
    <618>   DW_AT_decl_column : 7
    <619>   DW_AT_type        : <0x2f9>
    <61d>   DW_AT_data_member_location: 24
 <2><61e>: Abbrev Number: 1 (DW_TAG_member)
    <61f>   DW_AT_name        : (indirect string, offset: 0x8cd51): _data
    <623>   DW_AT_decl_file   : 7
    <624>   DW_AT_decl_line   : 163
    <625>   DW_AT_decl_column : 18
    <626>   DW_AT_type        : <0x811>
    <62a>   DW_AT_data_member_location: 28
 <2><62b>: Abbrev Number: 1 (DW_TAG_member)
    <62c>   DW_AT_name        : (indirect string, offset: 0x8b95b): _cookie
    <630>   DW_AT_decl_file   : 7
    <631>   DW_AT_decl_line   : 167
    <632>   DW_AT_decl_column : 10
    <633>   DW_AT_type        : <0x3cf>
    <637>   DW_AT_data_member_location: 32
 <2><638>: Abbrev Number: 1 (DW_TAG_member)
    <639>   DW_AT_name        : (indirect string, offset: 0x8a9cd): _read
    <63d>   DW_AT_decl_file   : 7
    <63e>   DW_AT_decl_line   : 169
    <63f>   DW_AT_decl_column : 29
    <640>   DW_AT_type        : <0x845>
    <644>   DW_AT_data_member_location: 36
 <2><645>: Abbrev Number: 1 (DW_TAG_member)
    <646>   DW_AT_name        : (indirect string, offset: 0x848bb): _write
    <64a>   DW_AT_decl_file   : 7
    <64b>   DW_AT_decl_line   : 171
    <64c>   DW_AT_decl_column : 29
    <64d>   DW_AT_type        : <0x86d>
    <651>   DW_AT_data_member_location: 40
 <2><652>: Abbrev Number: 1 (DW_TAG_member)
    <653>   DW_AT_name        : (indirect string, offset: 0x8c6ba): _seek
    <657>   DW_AT_decl_file   : 7
    <658>   DW_AT_decl_line   : 174
    <659>   DW_AT_decl_column : 13
    <65a>   DW_AT_type        : <0x890>
    <65e>   DW_AT_data_member_location: 44
 <2><65f>: Abbrev Number: 1 (DW_TAG_member)
    <660>   DW_AT_name        : (indirect string, offset: 0x87497): _close
    <664>   DW_AT_decl_file   : 7
    <665>   DW_AT_decl_line   : 175
    <666>   DW_AT_decl_column : 9
    <667>   DW_AT_type        : <0x8a9>
    <66b>   DW_AT_data_member_location: 48
 <2><66c>: Abbrev Number: 14 (DW_TAG_member)
    <66d>   DW_AT_name        : _ub
    <671>   DW_AT_decl_file   : 7
    <671>   DW_AT_decl_line   : 178
    <672>   DW_AT_decl_column : 17
    <673>   DW_AT_type        : <0x590>
    <677>   DW_AT_data_member_location: 52
 <2><678>: Abbrev Number: 14 (DW_TAG_member)
    <679>   DW_AT_name        : _up
    <67d>   DW_AT_decl_file   : 7
    <67d>   DW_AT_decl_line   : 179
    <67e>   DW_AT_decl_column : 18
    <67f>   DW_AT_type        : <0x5b8>
    <683>   DW_AT_data_member_location: 60
 <2><684>: Abbrev Number: 14 (DW_TAG_member)
    <685>   DW_AT_name        : _ur
    <689>   DW_AT_decl_file   : 7
    <689>   DW_AT_decl_line   : 180
    <68a>   DW_AT_decl_column : 7
    <68b>   DW_AT_type        : <0x2f9>
    <68f>   DW_AT_data_member_location: 64
 <2><690>: Abbrev Number: 1 (DW_TAG_member)
    <691>   DW_AT_name        : (indirect string, offset: 0x85d04): _ubuf
    <695>   DW_AT_decl_file   : 7
    <696>   DW_AT_decl_line   : 183
    <697>   DW_AT_decl_column : 17
    <698>   DW_AT_type        : <0x8ae>
    <69c>   DW_AT_data_member_location: 68
 <2><69d>: Abbrev Number: 1 (DW_TAG_member)
    <69e>   DW_AT_name        : (indirect string, offset: 0x89603): _nbuf
    <6a2>   DW_AT_decl_file   : 7
    <6a3>   DW_AT_decl_line   : 184
    <6a4>   DW_AT_decl_column : 17
    <6a5>   DW_AT_type        : <0x8be>
    <6a9>   DW_AT_data_member_location: 71
 <2><6aa>: Abbrev Number: 14 (DW_TAG_member)
    <6ab>   DW_AT_name        : _lb
    <6af>   DW_AT_decl_file   : 7
    <6af>   DW_AT_decl_line   : 187
    <6b0>   DW_AT_decl_column : 17
    <6b1>   DW_AT_type        : <0x590>
    <6b5>   DW_AT_data_member_location: 72
 <2><6b6>: Abbrev Number: 1 (DW_TAG_member)
    <6b7>   DW_AT_name        : (indirect string, offset: 0x85a8a): _blksize
    <6bb>   DW_AT_decl_file   : 7
    <6bc>   DW_AT_decl_line   : 190
    <6bd>   DW_AT_decl_column : 7
    <6be>   DW_AT_type        : <0x2f9>
    <6c2>   DW_AT_data_member_location: 80
 <2><6c3>: Abbrev Number: 1 (DW_TAG_member)
    <6c4>   DW_AT_name        : (indirect string, offset: 0x86347): _offset
    <6c8>   DW_AT_decl_file   : 7
    <6c9>   DW_AT_decl_line   : 191
    <6ca>   DW_AT_decl_column : 10
    <6cb>   DW_AT_type        : <0x3fb>
    <6cf>   DW_AT_data_member_location: 84
 <2><6d0>: Abbrev Number: 1 (DW_TAG_member)
    <6d1>   DW_AT_name        : (indirect string, offset: 0x848b5): _lock
    <6d5>   DW_AT_decl_file   : 7
    <6d6>   DW_AT_decl_line   : 198
    <6d7>   DW_AT_decl_column : 12
    <6d8>   DW_AT_type        : <0x494>
    <6dc>   DW_AT_data_member_location: 88
 <2><6dd>: Abbrev Number: 1 (DW_TAG_member)
    <6de>   DW_AT_name        : (indirect string, offset: 0x846c0): _mbstate
    <6e2>   DW_AT_decl_file   : 7
    <6e3>   DW_AT_decl_line   : 200
    <6e4>   DW_AT_decl_column : 14
    <6e5>   DW_AT_type        : <0x466>
    <6e9>   DW_AT_data_member_location: 92
 <2><6ea>: Abbrev Number: 1 (DW_TAG_member)
    <6eb>   DW_AT_name        : (indirect string, offset: 0x8acdf): _flags2
    <6ef>   DW_AT_decl_file   : 7
    <6f0>   DW_AT_decl_line   : 201
    <6f1>   DW_AT_decl_column : 9
    <6f2>   DW_AT_type        : <0x2f9>
    <6f6>   DW_AT_data_member_location: 100
 <2><6f7>: Abbrev Number: 0
 <1><6f8>: Abbrev Number: 20 (DW_TAG_structure_type)
    <6f9>   DW_AT_name        : (indirect string, offset: 0x95875): _reent
    <6fd>   DW_AT_byte_size   : 76
    <6fe>   DW_AT_decl_file   : 7
    <6ff>   DW_AT_decl_line   : 379
    <701>   DW_AT_decl_column : 8
    <702>   DW_AT_sibling     : <0x811>
 <2><706>: Abbrev Number: 3 (DW_TAG_member)
    <707>   DW_AT_name        : (indirect string, offset: 0x8d562): _errno
    <70b>   DW_AT_decl_file   : 7
    <70c>   DW_AT_decl_line   : 383
    <70e>   DW_AT_decl_column : 7
    <70f>   DW_AT_type        : <0x2f9>
    <713>   DW_AT_data_member_location: 0
 <2><714>: Abbrev Number: 3 (DW_TAG_member)
    <715>   DW_AT_name        : (indirect string, offset: 0x87c4a): _stdin
    <719>   DW_AT_decl_file   : 7
    <71a>   DW_AT_decl_line   : 388
    <71c>   DW_AT_decl_column : 11
    <71d>   DW_AT_type        : <0x8db>
    <721>   DW_AT_data_member_location: 4
 <2><722>: Abbrev Number: 3 (DW_TAG_member)
    <723>   DW_AT_name        : (indirect string, offset: 0x8977d): _stdout
    <727>   DW_AT_decl_file   : 7
    <728>   DW_AT_decl_line   : 388
    <72a>   DW_AT_decl_column : 20
    <72b>   DW_AT_type        : <0x8db>
    <72f>   DW_AT_data_member_location: 8
 <2><730>: Abbrev Number: 3 (DW_TAG_member)
    <731>   DW_AT_name        : (indirect string, offset: 0x8bc4d): _stderr
    <735>   DW_AT_decl_file   : 7
    <736>   DW_AT_decl_line   : 388
    <738>   DW_AT_decl_column : 30
    <739>   DW_AT_type        : <0x8db>
    <73d>   DW_AT_data_member_location: 12
 <2><73e>: Abbrev Number: 3 (DW_TAG_member)
    <73f>   DW_AT_name        : (indirect string, offset: 0x88e8a): _inc
    <743>   DW_AT_decl_file   : 7
    <744>   DW_AT_decl_line   : 390
    <746>   DW_AT_decl_column : 8
    <747>   DW_AT_type        : <0x2f9>
    <74b>   DW_AT_data_member_location: 16
 <2><74c>: Abbrev Number: 3 (DW_TAG_member)
    <74d>   DW_AT_name        : (indirect string, offset: 0x8aa04): _emergency
    <751>   DW_AT_decl_file   : 7
    <752>   DW_AT_decl_line   : 392
    <754>   DW_AT_decl_column : 9
    <755>   DW_AT_type        : <0x834>
    <759>   DW_AT_data_member_location: 20
 <2><75a>: Abbrev Number: 3 (DW_TAG_member)
    <75b>   DW_AT_name        : (indirect string, offset: 0x8b7a4): _locale
    <75f>   DW_AT_decl_file   : 7
    <760>   DW_AT_decl_line   : 398
    <762>   DW_AT_decl_column : 22
    <763>   DW_AT_type        : <0xa41>
    <767>   DW_AT_data_member_location: 24
 <2><768>: Abbrev Number: 7 (DW_TAG_member)
    <769>   DW_AT_name        : _mp
    <76d>   DW_AT_decl_file   : 7
    <76e>   DW_AT_decl_line   : 400
    <770>   DW_AT_decl_column : 18
    <771>   DW_AT_type        : <0xa46>
    <775>   DW_AT_data_member_location: 28
 <2><776>: Abbrev Number: 3 (DW_TAG_member)
    <777>   DW_AT_name        : (indirect string, offset: 0x84ca5): __cleanup
    <77b>   DW_AT_decl_file   : 7
    <77c>   DW_AT_decl_line   : 402
    <77e>   DW_AT_decl_column : 10
    <77f>   DW_AT_type        : <0xa56>
    <783>   DW_AT_data_member_location: 32
 <2><784>: Abbrev Number: 3 (DW_TAG_member)
    <785>   DW_AT_name        : (indirect string, offset: 0x85a5a): _gamma_signgam
    <789>   DW_AT_decl_file   : 7
    <78a>   DW_AT_decl_line   : 404
    <78c>   DW_AT_decl_column : 7
    <78d>   DW_AT_type        : <0x2f9>
    <791>   DW_AT_data_member_location: 36
 <2><792>: Abbrev Number: 3 (DW_TAG_member)
    <793>   DW_AT_name        : (indirect string, offset: 0x8ab57): _cvtlen
    <797>   DW_AT_decl_file   : 7
    <798>   DW_AT_decl_line   : 407
    <79a>   DW_AT_decl_column : 7
    <79b>   DW_AT_type        : <0x2f9>
    <79f>   DW_AT_data_member_location: 40
 <2><7a0>: Abbrev Number: 3 (DW_TAG_member)
    <7a1>   DW_AT_name        : (indirect string, offset: 0x8777f): _cvtbuf
    <7a5>   DW_AT_decl_file   : 7
    <7a6>   DW_AT_decl_line   : 408
    <7a8>   DW_AT_decl_column : 9
    <7a9>   DW_AT_type        : <0x834>
    <7ad>   DW_AT_data_member_location: 44
 <2><7ae>: Abbrev Number: 3 (DW_TAG_member)
    <7af>   DW_AT_name        : (indirect string, offset: 0x89f90): _r48
    <7b3>   DW_AT_decl_file   : 7
    <7b4>   DW_AT_decl_line   : 410
    <7b6>   DW_AT_decl_column : 19
    <7b7>   DW_AT_type        : <0xa5b>
    <7bb>   DW_AT_data_member_location: 48
 <2><7bc>: Abbrev Number: 3 (DW_TAG_member)
    <7bd>   DW_AT_name        : (indirect string, offset: 0x8aec2): _localtime_buf
    <7c1>   DW_AT_decl_file   : 7
    <7c2>   DW_AT_decl_line   : 411
    <7c4>   DW_AT_decl_column : 16
    <7c5>   DW_AT_type        : <0xa60>
    <7c9>   DW_AT_data_member_location: 52
 <2><7ca>: Abbrev Number: 3 (DW_TAG_member)
    <7cb>   DW_AT_name        : (indirect string, offset: 0x858ec): _asctime_buf
    <7cf>   DW_AT_decl_file   : 7
    <7d0>   DW_AT_decl_line   : 412
    <7d2>   DW_AT_decl_column : 9
    <7d3>   DW_AT_type        : <0x834>
    <7d7>   DW_AT_data_member_location: 56
 <2><7d8>: Abbrev Number: 3 (DW_TAG_member)
    <7d9>   DW_AT_name        : (indirect string, offset: 0x8ad65): _sig_func
    <7dd>   DW_AT_decl_file   : 7
    <7de>   DW_AT_decl_line   : 415
    <7e0>   DW_AT_decl_column : 12
    <7e1>   DW_AT_type        : <0xa70>
    <7e5>   DW_AT_data_member_location: 60
 <2><7e6>: Abbrev Number: 3 (DW_TAG_member)
    <7e7>   DW_AT_name        : (indirect string, offset: 0x85cff): __sf
    <7eb>   DW_AT_decl_file   : 7
    <7ec>   DW_AT_decl_line   : 423
    <7ee>   DW_AT_decl_column : 11
    <7ef>   DW_AT_type        : <0x8db>
    <7f3>   DW_AT_data_member_location: 64
 <2><7f4>: Abbrev Number: 3 (DW_TAG_member)
    <7f5>   DW_AT_name        : (indirect string, offset: 0x87660): _misc
    <7f9>   DW_AT_decl_file   : 7
    <7fa>   DW_AT_decl_line   : 424
    <7fc>   DW_AT_decl_column : 23
    <7fd>   DW_AT_type        : <0xa7a>
    <801>   DW_AT_data_member_location: 68
 <2><802>: Abbrev Number: 3 (DW_TAG_member)
    <803>   DW_AT_name        : (indirect string, offset: 0x88bfa): _signal_buf
    <807>   DW_AT_decl_file   : 7
    <808>   DW_AT_decl_line   : 425
    <80a>   DW_AT_decl_column : 9
    <80b>   DW_AT_type        : <0x834>
    <80f>   DW_AT_data_member_location: 72
 <2><810>: Abbrev Number: 0
 <1><811>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <812>   DW_AT_byte_size   : 4
    <812>   DW_AT_type        : <0x6f8>
 <1><816>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <817>   DW_AT_prototyped  : 1
    <817>   DW_AT_type        : <0x2f9>
    <81b>   DW_AT_sibling     : <0x834>
 <2><81f>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <820>   DW_AT_type        : <0x811>
 <2><824>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <825>   DW_AT_type        : <0x3cf>
 <2><829>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <82a>   DW_AT_type        : <0x834>
 <2><82e>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <82f>   DW_AT_type        : <0x2f9>
 <2><833>: Abbrev Number: 0
 <1><834>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <835>   DW_AT_byte_size   : 4
    <835>   DW_AT_type        : <0x839>
 <1><839>: Abbrev Number: 13 (DW_TAG_base_type)
    <83a>   DW_AT_byte_size   : 1
    <83b>   DW_AT_encoding    : 8	(unsigned char)
    <83c>   DW_AT_name        : (indirect string, offset: 0x86363): char
 <1><840>: Abbrev Number: 23 (DW_TAG_const_type)
    <841>   DW_AT_type        : <0x839>
 <1><845>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <846>   DW_AT_byte_size   : 4
    <846>   DW_AT_type        : <0x816>
 <1><84a>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <84b>   DW_AT_prototyped  : 1
    <84b>   DW_AT_type        : <0x2f9>
    <84f>   DW_AT_sibling     : <0x868>
 <2><853>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <854>   DW_AT_type        : <0x811>
 <2><858>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <859>   DW_AT_type        : <0x3cf>
 <2><85d>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <85e>   DW_AT_type        : <0x868>
 <2><862>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <863>   DW_AT_type        : <0x2f9>
 <2><867>: Abbrev Number: 0
 <1><868>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <869>   DW_AT_byte_size   : 4
    <869>   DW_AT_type        : <0x840>
 <1><86d>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <86e>   DW_AT_byte_size   : 4
    <86e>   DW_AT_type        : <0x84a>
 <1><872>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <873>   DW_AT_prototyped  : 1
    <873>   DW_AT_type        : <0x407>
    <877>   DW_AT_sibling     : <0x890>
 <2><87b>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <87c>   DW_AT_type        : <0x811>
 <2><880>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <881>   DW_AT_type        : <0x3cf>
 <2><885>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <886>   DW_AT_type        : <0x407>
 <2><88a>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <88b>   DW_AT_type        : <0x2f9>
 <2><88f>: Abbrev Number: 0
 <1><890>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <891>   DW_AT_byte_size   : 4
    <891>   DW_AT_type        : <0x872>
 <1><895>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <896>   DW_AT_prototyped  : 1
    <896>   DW_AT_type        : <0x2f9>
    <89a>   DW_AT_sibling     : <0x8a9>
 <2><89e>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <89f>   DW_AT_type        : <0x811>
 <2><8a3>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <8a4>   DW_AT_type        : <0x3cf>
 <2><8a8>: Abbrev Number: 0
 <1><8a9>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <8aa>   DW_AT_byte_size   : 4
    <8aa>   DW_AT_type        : <0x895>
 <1><8ae>: Abbrev Number: 9 (DW_TAG_array_type)
    <8af>   DW_AT_type        : <0x328>
    <8b3>   DW_AT_sibling     : <0x8be>
 <2><8b7>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <8b8>   DW_AT_type        : <0x300>
    <8bc>   DW_AT_upper_bound : 2
 <2><8bd>: Abbrev Number: 0
 <1><8be>: Abbrev Number: 9 (DW_TAG_array_type)
    <8bf>   DW_AT_type        : <0x328>
    <8c3>   DW_AT_sibling     : <0x8ce>
 <2><8c7>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <8c8>   DW_AT_type        : <0x300>
    <8cc>   DW_AT_upper_bound : 0
 <2><8cd>: Abbrev Number: 0
 <1><8ce>: Abbrev Number: 10 (DW_TAG_typedef)
    <8cf>   DW_AT_name        : (indirect string, offset: 0x8ab2c): __FILE
    <8d3>   DW_AT_decl_file   : 7
    <8d4>   DW_AT_decl_line   : 270
    <8d6>   DW_AT_decl_column : 26
    <8d7>   DW_AT_type        : <0x5bd>
 <1><8db>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <8dc>   DW_AT_byte_size   : 4
    <8dc>   DW_AT_type        : <0x8ce>
 <1><8e0>: Abbrev Number: 20 (DW_TAG_structure_type)
    <8e1>   DW_AT_name        : (indirect string, offset: 0x86572): _rand48
    <8e5>   DW_AT_byte_size   : 24
    <8e6>   DW_AT_decl_file   : 7
    <8e7>   DW_AT_decl_line   : 306
    <8e9>   DW_AT_decl_column : 8
    <8ea>   DW_AT_sibling     : <0x927>
 <2><8ee>: Abbrev Number: 3 (DW_TAG_member)
    <8ef>   DW_AT_name        : (indirect string, offset: 0x8c651): _seed
    <8f3>   DW_AT_decl_file   : 7
    <8f4>   DW_AT_decl_line   : 307
    <8f6>   DW_AT_decl_column : 18
    <8f7>   DW_AT_type        : <0x927>
    <8fb>   DW_AT_data_member_location: 0
 <2><8fc>: Abbrev Number: 3 (DW_TAG_member)
    <8fd>   DW_AT_name        : (indirect string, offset: 0x841bd): _mult
    <901>   DW_AT_decl_file   : 7
    <902>   DW_AT_decl_line   : 308
    <904>   DW_AT_decl_column : 18
    <905>   DW_AT_type        : <0x927>
    <909>   DW_AT_data_member_location: 6
 <2><90a>: Abbrev Number: 3 (DW_TAG_member)
    <90b>   DW_AT_name        : (indirect string, offset: 0x87d4c): _add
    <90f>   DW_AT_decl_file   : 7
    <910>   DW_AT_decl_line   : 309
    <912>   DW_AT_decl_column : 18
    <913>   DW_AT_type        : <0x34e>
    <917>   DW_AT_data_member_location: 12
 <2><918>: Abbrev Number: 3 (DW_TAG_member)
    <919>   DW_AT_name        : (indirect string, offset: 0x888fc): _rand_next
    <91d>   DW_AT_decl_file   : 7
    <91e>   DW_AT_decl_line   : 312
    <920>   DW_AT_decl_column : 36
    <921>   DW_AT_type        : <0x36f>
    <925>   DW_AT_data_member_location: 16
 <2><926>: Abbrev Number: 0
 <1><927>: Abbrev Number: 9 (DW_TAG_array_type)
    <928>   DW_AT_type        : <0x34e>
    <92c>   DW_AT_sibling     : <0x937>
 <2><930>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <931>   DW_AT_type        : <0x300>
    <935>   DW_AT_upper_bound : 2
 <2><936>: Abbrev Number: 0
 <1><937>: Abbrev Number: 20 (DW_TAG_structure_type)
    <938>   DW_AT_name        : (indirect string, offset: 0x87646): _mprec
    <93c>   DW_AT_byte_size   : 16
    <93d>   DW_AT_decl_file   : 7
    <93e>   DW_AT_decl_line   : 348
    <940>   DW_AT_decl_column : 8
    <941>   DW_AT_sibling     : <0x97e>
 <2><945>: Abbrev Number: 3 (DW_TAG_member)
    <946>   DW_AT_name        : (indirect string, offset: 0x8c8d2): _result
    <94a>   DW_AT_decl_file   : 7
    <94b>   DW_AT_decl_line   : 351
    <94d>   DW_AT_decl_column : 19
    <94e>   DW_AT_type        : <0x4f8>
    <952>   DW_AT_data_member_location: 0
 <2><953>: Abbrev Number: 3 (DW_TAG_member)
    <954>   DW_AT_name        : (indirect string, offset: 0x89164): _result_k
    <958>   DW_AT_decl_file   : 7
    <959>   DW_AT_decl_line   : 352
    <95b>   DW_AT_decl_column : 7
    <95c>   DW_AT_type        : <0x2f9>
    <960>   DW_AT_data_member_location: 4
 <2><961>: Abbrev Number: 3 (DW_TAG_member)
    <962>   DW_AT_name        : (indirect string, offset: 0x87901): _p5s
    <966>   DW_AT_decl_file   : 7
    <967>   DW_AT_decl_line   : 353
    <969>   DW_AT_decl_column : 19
    <96a>   DW_AT_type        : <0x4f8>
    <96e>   DW_AT_data_member_location: 8
 <2><96f>: Abbrev Number: 3 (DW_TAG_member)
    <970>   DW_AT_name        : (indirect string, offset: 0x886bf): _freelist
    <974>   DW_AT_decl_file   : 7
    <975>   DW_AT_decl_line   : 354
    <977>   DW_AT_decl_column : 20
    <978>   DW_AT_type        : <0x97e>
    <97c>   DW_AT_data_member_location: 12
 <2><97d>: Abbrev Number: 0
 <1><97e>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <97f>   DW_AT_byte_size   : 4
    <97f>   DW_AT_type        : <0x4f8>
 <1><983>: Abbrev Number: 20 (DW_TAG_structure_type)
    <984>   DW_AT_name        : (indirect string, offset: 0x878f5): _misc_reent
    <988>   DW_AT_byte_size   : 80
    <989>   DW_AT_decl_file   : 7
    <98a>   DW_AT_decl_line   : 358
    <98c>   DW_AT_decl_column : 8
    <98d>   DW_AT_sibling     : <0xa2c>
 <2><991>: Abbrev Number: 3 (DW_TAG_member)
    <992>   DW_AT_name        : (indirect string, offset: 0x8bcdb): _strtok_last
    <996>   DW_AT_decl_file   : 7
    <997>   DW_AT_decl_line   : 361
    <999>   DW_AT_decl_column : 9
    <99a>   DW_AT_type        : <0x834>
    <99e>   DW_AT_data_member_location: 0
 <2><99f>: Abbrev Number: 3 (DW_TAG_member)
    <9a0>   DW_AT_name        : (indirect string, offset: 0x87433): _mblen_state
    <9a4>   DW_AT_decl_file   : 7
    <9a5>   DW_AT_decl_line   : 362
    <9a7>   DW_AT_decl_column : 14
    <9a8>   DW_AT_type        : <0x466>
    <9ac>   DW_AT_data_member_location: 4
 <2><9ad>: Abbrev Number: 3 (DW_TAG_member)
    <9ae>   DW_AT_name        : (indirect string, offset: 0x8bce8): _wctomb_state
    <9b2>   DW_AT_decl_file   : 7
    <9b3>   DW_AT_decl_line   : 363
    <9b5>   DW_AT_decl_column : 14
    <9b6>   DW_AT_type        : <0x466>
    <9ba>   DW_AT_data_member_location: 12
 <2><9bb>: Abbrev Number: 3 (DW_TAG_member)
    <9bc>   DW_AT_name        : (indirect string, offset: 0x8b2c4): _mbtowc_state
    <9c0>   DW_AT_decl_file   : 7
    <9c1>   DW_AT_decl_line   : 364
    <9c3>   DW_AT_decl_column : 14
    <9c4>   DW_AT_type        : <0x466>
    <9c8>   DW_AT_data_member_location: 20
 <2><9c9>: Abbrev Number: 3 (DW_TAG_member)
    <9ca>   DW_AT_name        : (indirect string, offset: 0x85a50): _l64a_buf
    <9ce>   DW_AT_decl_file   : 7
    <9cf>   DW_AT_decl_line   : 365
    <9d1>   DW_AT_decl_column : 8
    <9d2>   DW_AT_type        : <0xa2c>
    <9d6>   DW_AT_data_member_location: 28
 <2><9d7>: Abbrev Number: 3 (DW_TAG_member)
    <9d8>   DW_AT_name        : (indirect string, offset: 0x8bb9c): _getdate_err
    <9dc>   DW_AT_decl_file   : 7
    <9dd>   DW_AT_decl_line   : 366
    <9df>   DW_AT_decl_column : 7
    <9e0>   DW_AT_type        : <0x2f9>
    <9e4>   DW_AT_data_member_location: 36
 <2><9e5>: Abbrev Number: 3 (DW_TAG_member)
    <9e6>   DW_AT_name        : (indirect string, offset: 0x87948): _mbrlen_state
    <9ea>   DW_AT_decl_file   : 7
    <9eb>   DW_AT_decl_line   : 367
    <9ed>   DW_AT_decl_column : 14
    <9ee>   DW_AT_type        : <0x466>
    <9f2>   DW_AT_data_member_location: 40
 <2><9f3>: Abbrev Number: 3 (DW_TAG_member)
    <9f4>   DW_AT_name        : (indirect string, offset: 0x8bc09): _mbrtowc_state
    <9f8>   DW_AT_decl_file   : 7
    <9f9>   DW_AT_decl_line   : 368
    <9fb>   DW_AT_decl_column : 14
    <9fc>   DW_AT_type        : <0x466>
    <a00>   DW_AT_data_member_location: 48
 <2><a01>: Abbrev Number: 3 (DW_TAG_member)
    <a02>   DW_AT_name        : (indirect string, offset: 0x85e4b): _mbsrtowcs_state
    <a06>   DW_AT_decl_file   : 7
    <a07>   DW_AT_decl_line   : 369
    <a09>   DW_AT_decl_column : 14
    <a0a>   DW_AT_type        : <0x466>
    <a0e>   DW_AT_data_member_location: 56
 <2><a0f>: Abbrev Number: 3 (DW_TAG_member)
    <a10>   DW_AT_name        : (indirect string, offset: 0x86254): _wcrtomb_state
    <a14>   DW_AT_decl_file   : 7
    <a15>   DW_AT_decl_line   : 370
    <a17>   DW_AT_decl_column : 14
    <a18>   DW_AT_type        : <0x466>
    <a1c>   DW_AT_data_member_location: 64
 <2><a1d>: Abbrev Number: 3 (DW_TAG_member)
    <a1e>   DW_AT_name        : (indirect string, offset: 0x884b4): _wcsrtombs_state
    <a22>   DW_AT_decl_file   : 7
    <a23>   DW_AT_decl_line   : 371
    <a25>   DW_AT_decl_column : 14
    <a26>   DW_AT_type        : <0x466>
    <a2a>   DW_AT_data_member_location: 72
 <2><a2b>: Abbrev Number: 0
 <1><a2c>: Abbrev Number: 9 (DW_TAG_array_type)
    <a2d>   DW_AT_type        : <0x839>
    <a31>   DW_AT_sibling     : <0xa3c>
 <2><a35>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <a36>   DW_AT_type        : <0x300>
    <a3a>   DW_AT_upper_bound : 7
 <2><a3b>: Abbrev Number: 0
 <1><a3c>: Abbrev Number: 29 (DW_TAG_structure_type)
    <a3d>   DW_AT_name        : (indirect string, offset: 0x8b333): __locale_t
    <a41>   DW_AT_declaration : 1
 <1><a41>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a42>   DW_AT_byte_size   : 4
    <a42>   DW_AT_type        : <0xa3c>
 <1><a46>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a47>   DW_AT_byte_size   : 4
    <a47>   DW_AT_type        : <0x937>
 <1><a4b>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <a4c>   DW_AT_prototyped  : 1
    <a4c>   DW_AT_sibling     : <0xa56>
 <2><a50>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <a51>   DW_AT_type        : <0x811>
 <2><a55>: Abbrev Number: 0
 <1><a56>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a57>   DW_AT_byte_size   : 4
    <a57>   DW_AT_type        : <0xa4b>
 <1><a5b>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a5c>   DW_AT_byte_size   : 4
    <a5c>   DW_AT_type        : <0x8e0>
 <1><a60>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a61>   DW_AT_byte_size   : 4
    <a61>   DW_AT_type        : <0x50d>
 <1><a65>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <a66>   DW_AT_prototyped  : 1
    <a66>   DW_AT_sibling     : <0xa70>
 <2><a6a>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <a6b>   DW_AT_type        : <0x2f9>
 <2><a6f>: Abbrev Number: 0
 <1><a70>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a71>   DW_AT_byte_size   : 4
    <a71>   DW_AT_type        : <0xa75>
 <1><a75>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a76>   DW_AT_byte_size   : 4
    <a76>   DW_AT_type        : <0xa65>
 <1><a7a>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a7b>   DW_AT_byte_size   : 4
    <a7b>   DW_AT_type        : <0x983>
 <1><a7f>: Abbrev Number: 20 (DW_TAG_structure_type)
    <a80>   DW_AT_name        : (indirect string, offset: 0x8aff9): xSTATIC_LIST_ITEM
    <a84>   DW_AT_byte_size   : 20
    <a85>   DW_AT_decl_file   : 9
    <a86>   DW_AT_decl_line   : 1061
    <a88>   DW_AT_decl_column : 8
    <a89>   DW_AT_sibling     : <0xaaa>
 <2><a8d>: Abbrev Number: 3 (DW_TAG_member)
    <a8e>   DW_AT_name        : (indirect string, offset: 0x90939): xDummy2
    <a92>   DW_AT_decl_file   : 9
    <a93>   DW_AT_decl_line   : 1066
    <a95>   DW_AT_decl_column : 13
    <a96>   DW_AT_type        : <0x3dd>
    <a9a>   DW_AT_data_member_location: 0
 <2><a9b>: Abbrev Number: 3 (DW_TAG_member)
    <a9c>   DW_AT_name        : (indirect string, offset: 0x86835): pvDummy3
    <aa0>   DW_AT_decl_file   : 9
    <aa1>   DW_AT_decl_line   : 1067
    <aa3>   DW_AT_decl_column : 8
    <aa4>   DW_AT_type        : <0xaaa>
    <aa8>   DW_AT_data_member_location: 4
 <2><aa9>: Abbrev Number: 0
 <1><aaa>: Abbrev Number: 9 (DW_TAG_array_type)
    <aab>   DW_AT_type        : <0x3cf>
    <aaf>   DW_AT_sibling     : <0xaba>
 <2><ab3>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <ab4>   DW_AT_type        : <0x300>
    <ab8>   DW_AT_upper_bound : 3
 <2><ab9>: Abbrev Number: 0
 <1><aba>: Abbrev Number: 10 (DW_TAG_typedef)
    <abb>   DW_AT_name        : (indirect string, offset: 0x8683e): StaticListItem_t
    <abf>   DW_AT_decl_file   : 9
    <ac0>   DW_AT_decl_line   : 1072
    <ac2>   DW_AT_decl_column : 34
    <ac3>   DW_AT_type        : <0xa7f>
 <1><ac7>: Abbrev Number: 20 (DW_TAG_structure_type)
    <ac8>   DW_AT_name        : (indirect string, offset: 0x89292): xSTATIC_TCB
    <acc>   DW_AT_byte_size   : 168
    <acd>   DW_AT_decl_file   : 9
    <ace>   DW_AT_decl_line   : 1112
    <ad0>   DW_AT_decl_column : 16
    <ad1>   DW_AT_sibling     : <0xb70>
 <2><ad5>: Abbrev Number: 3 (DW_TAG_member)
    <ad6>   DW_AT_name        : (indirect string, offset: 0x85296): pxDummy1
    <ada>   DW_AT_decl_file   : 9
    <adb>   DW_AT_decl_line   : 1114
    <add>   DW_AT_decl_column : 11
    <ade>   DW_AT_type        : <0x3cf>
    <ae2>   DW_AT_data_member_location: 0
 <2><ae3>: Abbrev Number: 3 (DW_TAG_member)
    <ae4>   DW_AT_name        : (indirect string, offset: 0x90942): xDummy3
    <ae8>   DW_AT_decl_file   : 9
    <ae9>   DW_AT_decl_line   : 1118
    <aeb>   DW_AT_decl_column : 19
    <aec>   DW_AT_type        : <0xb70>
    <af0>   DW_AT_data_member_location: 4
 <2><af1>: Abbrev Number: 3 (DW_TAG_member)
    <af2>   DW_AT_name        : (indirect string, offset: 0x849e8): uxDummy5
    <af6>   DW_AT_decl_file   : 9
    <af7>   DW_AT_decl_line   : 1119
    <af9>   DW_AT_decl_column : 16
    <afa>   DW_AT_type        : <0x3d1>
    <afe>   DW_AT_data_member_location: 44
 <2><aff>: Abbrev Number: 3 (DW_TAG_member)
    <b00>   DW_AT_name        : (indirect string, offset: 0x8529f): pxDummy6
    <b04>   DW_AT_decl_file   : 9
    <b05>   DW_AT_decl_line   : 1120
    <b07>   DW_AT_decl_column : 11
    <b08>   DW_AT_type        : <0x3cf>
    <b0c>   DW_AT_data_member_location: 48
 <2><b0d>: Abbrev Number: 3 (DW_TAG_member)
    <b0e>   DW_AT_name        : (indirect string, offset: 0x866a0): ucDummy7
    <b12>   DW_AT_decl_file   : 9
    <b13>   DW_AT_decl_line   : 1121
    <b15>   DW_AT_decl_column : 13
    <b16>   DW_AT_type        : <0xb80>
    <b1a>   DW_AT_data_member_location: 52
 <2><b1b>: Abbrev Number: 3 (DW_TAG_member)
    <b1c>   DW_AT_name        : (indirect string, offset: 0x8bb01): uxDummy10
    <b20>   DW_AT_decl_file   : 9
    <b21>   DW_AT_decl_line   : 1129
    <b23>   DW_AT_decl_column : 16
    <b24>   DW_AT_type        : <0xb90>
    <b28>   DW_AT_data_member_location: 68
 <2><b29>: Abbrev Number: 3 (DW_TAG_member)
    <b2a>   DW_AT_name        : (indirect string, offset: 0x8558e): uxDummy12
    <b2e>   DW_AT_decl_file   : 9
    <b2f>   DW_AT_decl_line   : 1132
    <b31>   DW_AT_decl_column : 16
    <b32>   DW_AT_type        : <0xb90>
    <b36>   DW_AT_data_member_location: 76
 <2><b37>: Abbrev Number: 3 (DW_TAG_member)
    <b38>   DW_AT_name        : (indirect string, offset: 0x8aa9d): xDummy17
    <b3c>   DW_AT_decl_file   : 9
    <b3d>   DW_AT_decl_line   : 1144
    <b3f>   DW_AT_decl_column : 17
    <b40>   DW_AT_type        : <0x6f8>
    <b44>   DW_AT_data_member_location: 84
 <2><b45>: Abbrev Number: 3 (DW_TAG_member)
    <b46>   DW_AT_name        : (indirect string, offset: 0x84acb): ulDummy18
    <b4a>   DW_AT_decl_file   : 9
    <b4b>   DW_AT_decl_line   : 1147
    <b4d>   DW_AT_decl_column : 14
    <b4e>   DW_AT_type        : <0x3ae>
    <b52>   DW_AT_data_member_location: 160
 <2><b53>: Abbrev Number: 3 (DW_TAG_member)
    <b54>   DW_AT_name        : (indirect string, offset: 0x861bd): ucDummy19
    <b58>   DW_AT_decl_file   : 9
    <b59>   DW_AT_decl_line   : 1148
    <b5b>   DW_AT_decl_column : 13
    <b5c>   DW_AT_type        : <0x376>
    <b60>   DW_AT_data_member_location: 164
 <2><b61>: Abbrev Number: 3 (DW_TAG_member)
    <b62>   DW_AT_name        : (indirect string, offset: 0x8bb36): uxDummy20
    <b66>   DW_AT_decl_file   : 9
    <b67>   DW_AT_decl_line   : 1151
    <b69>   DW_AT_decl_column : 13
    <b6a>   DW_AT_type        : <0x376>
    <b6e>   DW_AT_data_member_location: 165
 <2><b6f>: Abbrev Number: 0
 <1><b70>: Abbrev Number: 9 (DW_TAG_array_type)
    <b71>   DW_AT_type        : <0xaba>
    <b75>   DW_AT_sibling     : <0xb80>
 <2><b79>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <b7a>   DW_AT_type        : <0x300>
    <b7e>   DW_AT_upper_bound : 1
 <2><b7f>: Abbrev Number: 0
 <1><b80>: Abbrev Number: 9 (DW_TAG_array_type)
    <b81>   DW_AT_type        : <0x376>
    <b85>   DW_AT_sibling     : <0xb90>
 <2><b89>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <b8a>   DW_AT_type        : <0x300>
    <b8e>   DW_AT_upper_bound : 15
 <2><b8f>: Abbrev Number: 0
 <1><b90>: Abbrev Number: 9 (DW_TAG_array_type)
    <b91>   DW_AT_type        : <0x3d1>
    <b95>   DW_AT_sibling     : <0xba0>
 <2><b99>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <b9a>   DW_AT_type        : <0x300>
    <b9e>   DW_AT_upper_bound : 1
 <2><b9f>: Abbrev Number: 0
 <1><ba0>: Abbrev Number: 10 (DW_TAG_typedef)
    <ba1>   DW_AT_name        : (indirect string, offset: 0x87af7): StaticTask_t
    <ba5>   DW_AT_decl_file   : 9
    <ba6>   DW_AT_decl_line   : 1160
    <ba8>   DW_AT_decl_column : 3
    <ba9>   DW_AT_type        : <0xac7>
 <1><bad>: Abbrev Number: 15 (DW_TAG_structure_type)
    <bae>   DW_AT_byte_size   : 16
    <baf>   DW_AT_decl_file   : 10
    <bb0>   DW_AT_decl_line   : 290
    <bb2>   DW_AT_decl_column : 9
    <bb2>   DW_AT_sibling     : <0xbef>
 <2><bb6>: Abbrev Number: 7 (DW_TAG_member)
    <bb7>   DW_AT_name        : CCR
    <bbb>   DW_AT_decl_file   : 10
    <bbc>   DW_AT_decl_line   : 292
    <bbe>   DW_AT_decl_column : 17
    <bbf>   DW_AT_type        : <0x3ba>
    <bc3>   DW_AT_data_member_location: 0
 <2><bc4>: Abbrev Number: 3 (DW_TAG_member)
    <bc5>   DW_AT_name        : (indirect string, offset: 0x86d8a): CNDTR
    <bc9>   DW_AT_decl_file   : 10
    <bca>   DW_AT_decl_line   : 293
    <bcc>   DW_AT_decl_column : 17
    <bcd>   DW_AT_type        : <0x3ba>
    <bd1>   DW_AT_data_member_location: 4
 <2><bd2>: Abbrev Number: 3 (DW_TAG_member)
    <bd3>   DW_AT_name        : (indirect string, offset: 0x8c437): CPAR
    <bd7>   DW_AT_decl_file   : 10
    <bd8>   DW_AT_decl_line   : 294
    <bda>   DW_AT_decl_column : 17
    <bdb>   DW_AT_type        : <0x3ba>
    <bdf>   DW_AT_data_member_location: 8
 <2><be0>: Abbrev Number: 3 (DW_TAG_member)
    <be1>   DW_AT_name        : (indirect string, offset: 0x8837c): CMAR
    <be5>   DW_AT_decl_file   : 10
    <be6>   DW_AT_decl_line   : 295
    <be8>   DW_AT_decl_column : 17
    <be9>   DW_AT_type        : <0x3ba>
    <bed>   DW_AT_data_member_location: 12
 <2><bee>: Abbrev Number: 0
 <1><bef>: Abbrev Number: 10 (DW_TAG_typedef)
    <bf0>   DW_AT_name        : (indirect string, offset: 0x8accb): DMA_Channel_TypeDef
    <bf4>   DW_AT_decl_file   : 10
    <bf5>   DW_AT_decl_line   : 296
    <bf7>   DW_AT_decl_column : 3
    <bf8>   DW_AT_type        : <0xbad>
 <1><bfc>: Abbrev Number: 15 (DW_TAG_structure_type)
    <bfd>   DW_AT_byte_size   : 8
    <bfe>   DW_AT_decl_file   : 10
    <bff>   DW_AT_decl_line   : 298
    <c01>   DW_AT_decl_column : 9
    <c01>   DW_AT_sibling     : <0xc22>
 <2><c05>: Abbrev Number: 7 (DW_TAG_member)
    <c06>   DW_AT_name        : ISR
    <c0a>   DW_AT_decl_file   : 10
    <c0b>   DW_AT_decl_line   : 300
    <c0d>   DW_AT_decl_column : 17
    <c0e>   DW_AT_type        : <0x3ba>
    <c12>   DW_AT_data_member_location: 0
 <2><c13>: Abbrev Number: 3 (DW_TAG_member)
    <c14>   DW_AT_name        : (indirect string, offset: 0x89b59): IFCR
    <c18>   DW_AT_decl_file   : 10
    <c19>   DW_AT_decl_line   : 301
    <c1b>   DW_AT_decl_column : 17
    <c1c>   DW_AT_type        : <0x3ba>
    <c20>   DW_AT_data_member_location: 4
 <2><c21>: Abbrev Number: 0
 <1><c22>: Abbrev Number: 10 (DW_TAG_typedef)
    <c23>   DW_AT_name        : (indirect string, offset: 0x8686c): DMA_TypeDef
    <c27>   DW_AT_decl_file   : 10
    <c28>   DW_AT_decl_line   : 302
    <c2a>   DW_AT_decl_column : 3
    <c2b>   DW_AT_type        : <0xbfc>
 <1><c2f>: Abbrev Number: 15 (DW_TAG_structure_type)
    <c30>   DW_AT_byte_size   : 28
    <c31>   DW_AT_decl_file   : 10
    <c32>   DW_AT_decl_line   : 357
    <c34>   DW_AT_decl_column : 9
    <c34>   DW_AT_sibling     : <0xc9b>
 <2><c38>: Abbrev Number: 7 (DW_TAG_member)
    <c39>   DW_AT_name        : CRL
    <c3d>   DW_AT_decl_file   : 10
    <c3e>   DW_AT_decl_line   : 359
    <c40>   DW_AT_decl_column : 17
    <c41>   DW_AT_type        : <0x3ba>
    <c45>   DW_AT_data_member_location: 0
 <2><c46>: Abbrev Number: 7 (DW_TAG_member)
    <c47>   DW_AT_name        : CRH
    <c4b>   DW_AT_decl_file   : 10
    <c4c>   DW_AT_decl_line   : 360
    <c4e>   DW_AT_decl_column : 17
    <c4f>   DW_AT_type        : <0x3ba>
    <c53>   DW_AT_data_member_location: 4
 <2><c54>: Abbrev Number: 7 (DW_TAG_member)
    <c55>   DW_AT_name        : IDR
    <c59>   DW_AT_decl_file   : 10
    <c5a>   DW_AT_decl_line   : 361
    <c5c>   DW_AT_decl_column : 17
    <c5d>   DW_AT_type        : <0x3ba>
    <c61>   DW_AT_data_member_location: 8
 <2><c62>: Abbrev Number: 7 (DW_TAG_member)
    <c63>   DW_AT_name        : ODR
    <c67>   DW_AT_decl_file   : 10
    <c68>   DW_AT_decl_line   : 362
    <c6a>   DW_AT_decl_column : 17
    <c6b>   DW_AT_type        : <0x3ba>
    <c6f>   DW_AT_data_member_location: 12
 <2><c70>: Abbrev Number: 3 (DW_TAG_member)
    <c71>   DW_AT_name        : (indirect string, offset: 0x8571c): BSRR
    <c75>   DW_AT_decl_file   : 10
    <c76>   DW_AT_decl_line   : 363
    <c78>   DW_AT_decl_column : 17
    <c79>   DW_AT_type        : <0x3ba>
    <c7d>   DW_AT_data_member_location: 16
 <2><c7e>: Abbrev Number: 7 (DW_TAG_member)
    <c7f>   DW_AT_name        : BRR
    <c83>   DW_AT_decl_file   : 10
    <c84>   DW_AT_decl_line   : 364
    <c86>   DW_AT_decl_column : 17
    <c87>   DW_AT_type        : <0x3ba>
    <c8b>   DW_AT_data_member_location: 20
 <2><c8c>: Abbrev Number: 3 (DW_TAG_member)
    <c8d>   DW_AT_name        : (indirect string, offset: 0x8b33e): LCKR
    <c91>   DW_AT_decl_file   : 10
    <c92>   DW_AT_decl_line   : 365
    <c94>   DW_AT_decl_column : 17
    <c95>   DW_AT_type        : <0x3ba>
    <c99>   DW_AT_data_member_location: 24
 <2><c9a>: Abbrev Number: 0
 <1><c9b>: Abbrev Number: 10 (DW_TAG_typedef)
    <c9c>   DW_AT_name        : (indirect string, offset: 0x8c4ec): GPIO_TypeDef
    <ca0>   DW_AT_decl_file   : 10
    <ca1>   DW_AT_decl_line   : 366
    <ca3>   DW_AT_decl_column : 3
    <ca4>   DW_AT_type        : <0xc2f>
 <1><ca8>: Abbrev Number: 15 (DW_TAG_structure_type)
    <ca9>   DW_AT_byte_size   : 84
    <caa>   DW_AT_decl_file   : 10
    <cab>   DW_AT_decl_line   : 476
    <cad>   DW_AT_decl_column : 9
    <cad>   DW_AT_sibling     : <0xdd6>
 <2><cb1>: Abbrev Number: 7 (DW_TAG_member)
    <cb2>   DW_AT_name        : CR1
    <cb6>   DW_AT_decl_file   : 10
    <cb7>   DW_AT_decl_line   : 478
    <cb9>   DW_AT_decl_column : 17
    <cba>   DW_AT_type        : <0x3ba>
    <cbe>   DW_AT_data_member_location: 0
 <2><cbf>: Abbrev Number: 7 (DW_TAG_member)
    <cc0>   DW_AT_name        : CR2
    <cc4>   DW_AT_decl_file   : 10
    <cc5>   DW_AT_decl_line   : 479
    <cc7>   DW_AT_decl_column : 17
    <cc8>   DW_AT_type        : <0x3ba>
    <ccc>   DW_AT_data_member_location: 4
 <2><ccd>: Abbrev Number: 3 (DW_TAG_member)
    <cce>   DW_AT_name        : (indirect string, offset: 0x5edb5): SMCR
    <cd2>   DW_AT_decl_file   : 10
    <cd3>   DW_AT_decl_line   : 480
    <cd5>   DW_AT_decl_column : 17
    <cd6>   DW_AT_type        : <0x3ba>
    <cda>   DW_AT_data_member_location: 8
 <2><cdb>: Abbrev Number: 3 (DW_TAG_member)
    <cdc>   DW_AT_name        : (indirect string, offset: 0x2a07b): DIER
    <ce0>   DW_AT_decl_file   : 10
    <ce1>   DW_AT_decl_line   : 481
    <ce3>   DW_AT_decl_column : 17
    <ce4>   DW_AT_type        : <0x3ba>
    <ce8>   DW_AT_data_member_location: 12
 <2><ce9>: Abbrev Number: 7 (DW_TAG_member)
    <cea>   DW_AT_name        : SR
    <ced>   DW_AT_decl_file   : 10
    <cee>   DW_AT_decl_line   : 482
    <cf0>   DW_AT_decl_column : 17
    <cf1>   DW_AT_type        : <0x3ba>
    <cf5>   DW_AT_data_member_location: 16
 <2><cf6>: Abbrev Number: 7 (DW_TAG_member)
    <cf7>   DW_AT_name        : EGR
    <cfb>   DW_AT_decl_file   : 10
    <cfc>   DW_AT_decl_line   : 483
    <cfe>   DW_AT_decl_column : 17
    <cff>   DW_AT_type        : <0x3ba>
    <d03>   DW_AT_data_member_location: 20
 <2><d04>: Abbrev Number: 3 (DW_TAG_member)
    <d05>   DW_AT_name        : (indirect string, offset: 0x6085f): CCMR1
    <d09>   DW_AT_decl_file   : 10
    <d0a>   DW_AT_decl_line   : 484
    <d0c>   DW_AT_decl_column : 17
    <d0d>   DW_AT_type        : <0x3ba>
    <d11>   DW_AT_data_member_location: 24
 <2><d12>: Abbrev Number: 3 (DW_TAG_member)
    <d13>   DW_AT_name        : (indirect string, offset: 0x349e6): CCMR2
    <d17>   DW_AT_decl_file   : 10
    <d18>   DW_AT_decl_line   : 485
    <d1a>   DW_AT_decl_column : 17
    <d1b>   DW_AT_type        : <0x3ba>
    <d1f>   DW_AT_data_member_location: 28
 <2><d20>: Abbrev Number: 3 (DW_TAG_member)
    <d21>   DW_AT_name        : (indirect string, offset: 0x172a3): CCER
    <d25>   DW_AT_decl_file   : 10
    <d26>   DW_AT_decl_line   : 486
    <d28>   DW_AT_decl_column : 17
    <d29>   DW_AT_type        : <0x3ba>
    <d2d>   DW_AT_data_member_location: 32
 <2><d2e>: Abbrev Number: 7 (DW_TAG_member)
    <d2f>   DW_AT_name        : CNT
    <d33>   DW_AT_decl_file   : 10
    <d34>   DW_AT_decl_line   : 487
    <d36>   DW_AT_decl_column : 17
    <d37>   DW_AT_type        : <0x3ba>
    <d3b>   DW_AT_data_member_location: 36
 <2><d3c>: Abbrev Number: 7 (DW_TAG_member)
    <d3d>   DW_AT_name        : PSC
    <d41>   DW_AT_decl_file   : 10
    <d42>   DW_AT_decl_line   : 488
    <d44>   DW_AT_decl_column : 17
    <d45>   DW_AT_type        : <0x3ba>
    <d49>   DW_AT_data_member_location: 40
 <2><d4a>: Abbrev Number: 7 (DW_TAG_member)
    <d4b>   DW_AT_name        : ARR
    <d4f>   DW_AT_decl_file   : 10
    <d50>   DW_AT_decl_line   : 489
    <d52>   DW_AT_decl_column : 17
    <d53>   DW_AT_type        : <0x3ba>
    <d57>   DW_AT_data_member_location: 44
 <2><d58>: Abbrev Number: 7 (DW_TAG_member)
    <d59>   DW_AT_name        : RCR
    <d5d>   DW_AT_decl_file   : 10
    <d5e>   DW_AT_decl_line   : 490
    <d60>   DW_AT_decl_column : 17
    <d61>   DW_AT_type        : <0x3ba>
    <d65>   DW_AT_data_member_location: 48
 <2><d66>: Abbrev Number: 3 (DW_TAG_member)
    <d67>   DW_AT_name        : (indirect string, offset: 0xfb70): CCR1
    <d6b>   DW_AT_decl_file   : 10
    <d6c>   DW_AT_decl_line   : 491
    <d6e>   DW_AT_decl_column : 17
    <d6f>   DW_AT_type        : <0x3ba>
    <d73>   DW_AT_data_member_location: 52
 <2><d74>: Abbrev Number: 3 (DW_TAG_member)
    <d75>   DW_AT_name        : (indirect string, offset: 0x37a49): CCR2
    <d79>   DW_AT_decl_file   : 10
    <d7a>   DW_AT_decl_line   : 492
    <d7c>   DW_AT_decl_column : 17
    <d7d>   DW_AT_type        : <0x3ba>
    <d81>   DW_AT_data_member_location: 56
 <2><d82>: Abbrev Number: 3 (DW_TAG_member)
    <d83>   DW_AT_name        : (indirect string, offset: 0x65100): CCR3
    <d87>   DW_AT_decl_file   : 10
    <d88>   DW_AT_decl_line   : 493
    <d8a>   DW_AT_decl_column : 17
    <d8b>   DW_AT_type        : <0x3ba>
    <d8f>   DW_AT_data_member_location: 60
 <2><d90>: Abbrev Number: 3 (DW_TAG_member)
    <d91>   DW_AT_name        : (indirect string, offset: 0x865f): CCR4
    <d95>   DW_AT_decl_file   : 10
    <d96>   DW_AT_decl_line   : 494
    <d98>   DW_AT_decl_column : 17
    <d99>   DW_AT_type        : <0x3ba>
    <d9d>   DW_AT_data_member_location: 64
 <2><d9e>: Abbrev Number: 3 (DW_TAG_member)
    <d9f>   DW_AT_name        : (indirect string, offset: 0x3cffc): BDTR
    <da3>   DW_AT_decl_file   : 10
    <da4>   DW_AT_decl_line   : 495
    <da6>   DW_AT_decl_column : 17
    <da7>   DW_AT_type        : <0x3ba>
    <dab>   DW_AT_data_member_location: 68
 <2><dac>: Abbrev Number: 7 (DW_TAG_member)
    <dad>   DW_AT_name        : DCR
    <db1>   DW_AT_decl_file   : 10
    <db2>   DW_AT_decl_line   : 496
    <db4>   DW_AT_decl_column : 17
    <db5>   DW_AT_type        : <0x3ba>
    <db9>   DW_AT_data_member_location: 72
 <2><dba>: Abbrev Number: 3 (DW_TAG_member)
    <dbb>   DW_AT_name        : (indirect string, offset: 0x71382): DMAR
    <dbf>   DW_AT_decl_file   : 10
    <dc0>   DW_AT_decl_line   : 497
    <dc2>   DW_AT_decl_column : 17
    <dc3>   DW_AT_type        : <0x3ba>
    <dc7>   DW_AT_data_member_location: 76
 <2><dc8>: Abbrev Number: 7 (DW_TAG_member)
    <dc9>   DW_AT_name        : OR
    <dcc>   DW_AT_decl_file   : 10
    <dcd>   DW_AT_decl_line   : 498
    <dcf>   DW_AT_decl_column : 17
    <dd0>   DW_AT_type        : <0x3ba>
    <dd4>   DW_AT_data_member_location: 80
 <2><dd5>: Abbrev Number: 0
 <1><dd6>: Abbrev Number: 10 (DW_TAG_typedef)
    <dd7>   DW_AT_name        : (indirect string, offset: 0x83bfa): TIM_TypeDef
    <ddb>   DW_AT_decl_file   : 10
    <ddc>   DW_AT_decl_line   : 499
    <dde>   DW_AT_decl_column : 2
    <ddf>   DW_AT_type        : <0xca8>
 <1><de3>: Abbrev Number: 15 (DW_TAG_structure_type)
    <de4>   DW_AT_byte_size   : 28
    <de5>   DW_AT_decl_file   : 10
    <de6>   DW_AT_decl_line   : 506
    <de8>   DW_AT_decl_column : 9
    <de8>   DW_AT_sibling     : <0xe4d>
 <2><dec>: Abbrev Number: 7 (DW_TAG_member)
    <ded>   DW_AT_name        : SR
    <df0>   DW_AT_decl_file   : 10
    <df1>   DW_AT_decl_line   : 508
    <df3>   DW_AT_decl_column : 17
    <df4>   DW_AT_type        : <0x3ba>
    <df8>   DW_AT_data_member_location: 0
 <2><df9>: Abbrev Number: 7 (DW_TAG_member)
    <dfa>   DW_AT_name        : DR
    <dfd>   DW_AT_decl_file   : 10
    <dfe>   DW_AT_decl_line   : 509
    <e00>   DW_AT_decl_column : 17
    <e01>   DW_AT_type        : <0x3ba>
    <e05>   DW_AT_data_member_location: 4
 <2><e06>: Abbrev Number: 7 (DW_TAG_member)
    <e07>   DW_AT_name        : BRR
    <e0b>   DW_AT_decl_file   : 10
    <e0c>   DW_AT_decl_line   : 510
    <e0e>   DW_AT_decl_column : 17
    <e0f>   DW_AT_type        : <0x3ba>
    <e13>   DW_AT_data_member_location: 8
 <2><e14>: Abbrev Number: 7 (DW_TAG_member)
    <e15>   DW_AT_name        : CR1
    <e19>   DW_AT_decl_file   : 10
    <e1a>   DW_AT_decl_line   : 511
    <e1c>   DW_AT_decl_column : 17
    <e1d>   DW_AT_type        : <0x3ba>
    <e21>   DW_AT_data_member_location: 12
 <2><e22>: Abbrev Number: 7 (DW_TAG_member)
    <e23>   DW_AT_name        : CR2
    <e27>   DW_AT_decl_file   : 10
    <e28>   DW_AT_decl_line   : 512
    <e2a>   DW_AT_decl_column : 17
    <e2b>   DW_AT_type        : <0x3ba>
    <e2f>   DW_AT_data_member_location: 16
 <2><e30>: Abbrev Number: 7 (DW_TAG_member)
    <e31>   DW_AT_name        : CR3
    <e35>   DW_AT_decl_file   : 10
    <e36>   DW_AT_decl_line   : 513
    <e38>   DW_AT_decl_column : 17
    <e39>   DW_AT_type        : <0x3ba>
    <e3d>   DW_AT_data_member_location: 20
 <2><e3e>: Abbrev Number: 3 (DW_TAG_member)
    <e3f>   DW_AT_name        : (indirect string, offset: 0x85da0): GTPR
    <e43>   DW_AT_decl_file   : 10
    <e44>   DW_AT_decl_line   : 514
    <e46>   DW_AT_decl_column : 17
    <e47>   DW_AT_type        : <0x3ba>
    <e4b>   DW_AT_data_member_location: 24
 <2><e4c>: Abbrev Number: 0
 <1><e4d>: Abbrev Number: 10 (DW_TAG_typedef)
    <e4e>   DW_AT_name        : (indirect string, offset: 0x8c7a5): USART_TypeDef
    <e52>   DW_AT_decl_file   : 10
    <e53>   DW_AT_decl_line   : 515
    <e55>   DW_AT_decl_column : 3
    <e56>   DW_AT_type        : <0xde3>
 <1><e5a>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <e5b>   DW_AT_encoding    : 7	(unsigned)
    <e5c>   DW_AT_byte_size   : 1
    <e5d>   DW_AT_type        : <0x328>
    <e61>   DW_AT_decl_file   : 11
    <e62>   DW_AT_decl_line   : 39
    <e63>   DW_AT_decl_column : 1
    <e64>   DW_AT_sibling     : <0xe81>
 <2><e68>: Abbrev Number: 2 (DW_TAG_enumerator)
    <e69>   DW_AT_name        : (indirect string, offset: 0x8652d): HAL_OK
    <e6d>   DW_AT_const_value : 0
 <2><e6e>: Abbrev Number: 2 (DW_TAG_enumerator)
    <e6f>   DW_AT_name        : (indirect string, offset: 0x88c1a): HAL_ERROR
    <e73>   DW_AT_const_value : 1
 <2><e74>: Abbrev Number: 2 (DW_TAG_enumerator)
    <e75>   DW_AT_name        : (indirect string, offset: 0x84fc7): HAL_BUSY
    <e79>   DW_AT_const_value : 2
 <2><e7a>: Abbrev Number: 2 (DW_TAG_enumerator)
    <e7b>   DW_AT_name        : (indirect string, offset: 0x85f3f): HAL_TIMEOUT
    <e7f>   DW_AT_const_value : 3
 <2><e80>: Abbrev Number: 0
 <1><e81>: Abbrev Number: 5 (DW_TAG_typedef)
    <e82>   DW_AT_name        : (indirect string, offset: 0x83805): HAL_StatusTypeDef
    <e86>   DW_AT_decl_file   : 11
    <e87>   DW_AT_decl_line   : 44
    <e88>   DW_AT_decl_column : 3
    <e89>   DW_AT_type        : <0xe5a>
 <1><e8d>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <e8e>   DW_AT_encoding    : 7	(unsigned)
    <e8f>   DW_AT_byte_size   : 1
    <e90>   DW_AT_type        : <0x328>
    <e94>   DW_AT_decl_file   : 11
    <e95>   DW_AT_decl_line   : 50
    <e96>   DW_AT_decl_column : 1
    <e97>   DW_AT_sibling     : <0xea8>
 <2><e9b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <e9c>   DW_AT_name        : (indirect string, offset: 0x89ed9): HAL_UNLOCKED
    <ea0>   DW_AT_const_value : 0
 <2><ea1>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ea2>   DW_AT_name        : (indirect string, offset: 0x8c96d): HAL_LOCKED
    <ea6>   DW_AT_const_value : 1
 <2><ea7>: Abbrev Number: 0
 <1><ea8>: Abbrev Number: 5 (DW_TAG_typedef)
    <ea9>   DW_AT_name        : (indirect string, offset: 0x888b0): HAL_LockTypeDef
    <ead>   DW_AT_decl_file   : 11
    <eae>   DW_AT_decl_line   : 53
    <eaf>   DW_AT_decl_column : 3
    <eb0>   DW_AT_type        : <0xe8d>
 <1><eb4>: Abbrev Number: 18 (DW_TAG_structure_type)
    <eb5>   DW_AT_byte_size   : 28
    <eb6>   DW_AT_decl_file   : 12
    <eb7>   DW_AT_decl_line   : 47
    <eb8>   DW_AT_decl_column : 9
    <eb8>   DW_AT_sibling     : <0xf18>
 <2><ebc>: Abbrev Number: 1 (DW_TAG_member)
    <ebd>   DW_AT_name        : (indirect string, offset: 0x869f1): Direction
    <ec1>   DW_AT_decl_file   : 12
    <ec2>   DW_AT_decl_line   : 49
    <ec3>   DW_AT_decl_column : 12
    <ec4>   DW_AT_type        : <0x3ae>
    <ec8>   DW_AT_data_member_location: 0
 <2><ec9>: Abbrev Number: 1 (DW_TAG_member)
    <eca>   DW_AT_name        : (indirect string, offset: 0x83f88): PeriphInc
    <ece>   DW_AT_decl_file   : 12
    <ecf>   DW_AT_decl_line   : 53
    <ed0>   DW_AT_decl_column : 12
    <ed1>   DW_AT_type        : <0x3ae>
    <ed5>   DW_AT_data_member_location: 4
 <2><ed6>: Abbrev Number: 1 (DW_TAG_member)
    <ed7>   DW_AT_name        : (indirect string, offset: 0x84caf): MemInc
    <edb>   DW_AT_decl_file   : 12
    <edc>   DW_AT_decl_line   : 56
    <edd>   DW_AT_decl_column : 12
    <ede>   DW_AT_type        : <0x3ae>
    <ee2>   DW_AT_data_member_location: 8
 <2><ee3>: Abbrev Number: 1 (DW_TAG_member)
    <ee4>   DW_AT_name        : (indirect string, offset: 0x87b83): PeriphDataAlignment
    <ee8>   DW_AT_decl_file   : 12
    <ee9>   DW_AT_decl_line   : 59
    <eea>   DW_AT_decl_column : 12
    <eeb>   DW_AT_type        : <0x3ae>
    <eef>   DW_AT_data_member_location: 12
 <2><ef0>: Abbrev Number: 1 (DW_TAG_member)
    <ef1>   DW_AT_name        : (indirect string, offset: 0x8bb0b): MemDataAlignment
    <ef5>   DW_AT_decl_file   : 12
    <ef6>   DW_AT_decl_line   : 62
    <ef7>   DW_AT_decl_column : 12
    <ef8>   DW_AT_type        : <0x3ae>
    <efc>   DW_AT_data_member_location: 16
 <2><efd>: Abbrev Number: 1 (DW_TAG_member)
    <efe>   DW_AT_name        : (indirect string, offset: 0x8d973): Mode
    <f02>   DW_AT_decl_file   : 12
    <f03>   DW_AT_decl_line   : 65
    <f04>   DW_AT_decl_column : 12
    <f05>   DW_AT_type        : <0x3ae>
    <f09>   DW_AT_data_member_location: 20
 <2><f0a>: Abbrev Number: 1 (DW_TAG_member)
    <f0b>   DW_AT_name        : (indirect string, offset: 0x8e15f): Priority
    <f0f>   DW_AT_decl_file   : 12
    <f10>   DW_AT_decl_line   : 70
    <f11>   DW_AT_decl_column : 12
    <f12>   DW_AT_type        : <0x3ae>
    <f16>   DW_AT_data_member_location: 24
 <2><f17>: Abbrev Number: 0
 <1><f18>: Abbrev Number: 5 (DW_TAG_typedef)
    <f19>   DW_AT_name        : (indirect string, offset: 0x85ccd): DMA_InitTypeDef
    <f1d>   DW_AT_decl_file   : 12
    <f1e>   DW_AT_decl_line   : 72
    <f1f>   DW_AT_decl_column : 3
    <f20>   DW_AT_type        : <0xeb4>
 <1><f24>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <f25>   DW_AT_encoding    : 7	(unsigned)
    <f26>   DW_AT_byte_size   : 1
    <f27>   DW_AT_type        : <0x328>
    <f2b>   DW_AT_decl_file   : 12
    <f2c>   DW_AT_decl_line   : 78
    <f2d>   DW_AT_decl_column : 1
    <f2e>   DW_AT_sibling     : <0xf4b>
 <2><f32>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f33>   DW_AT_name        : (indirect string, offset: 0x89f30): HAL_DMA_STATE_RESET
    <f37>   DW_AT_const_value : 0
 <2><f38>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f39>   DW_AT_name        : (indirect string, offset: 0x85d43): HAL_DMA_STATE_READY
    <f3d>   DW_AT_const_value : 1
 <2><f3e>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f3f>   DW_AT_name        : (indirect string, offset: 0x89a56): HAL_DMA_STATE_BUSY
    <f43>   DW_AT_const_value : 2
 <2><f44>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f45>   DW_AT_name        : (indirect string, offset: 0x8c71f): HAL_DMA_STATE_TIMEOUT
    <f49>   DW_AT_const_value : 3
 <2><f4a>: Abbrev Number: 0
 <1><f4b>: Abbrev Number: 5 (DW_TAG_typedef)
    <f4c>   DW_AT_name        : (indirect string, offset: 0x89228): HAL_DMA_StateTypeDef
    <f50>   DW_AT_decl_file   : 12
    <f51>   DW_AT_decl_line   : 83
    <f52>   DW_AT_decl_column : 2
    <f53>   DW_AT_type        : <0xf24>
 <1><f57>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <f58>   DW_AT_type        : <0xf4b>
 <1><f5c>: Abbrev Number: 19 (DW_TAG_structure_type)
    <f5d>   DW_AT_name        : (indirect string, offset: 0x8b2a7): __DMA_HandleTypeDef
    <f61>   DW_AT_byte_size   : 68
    <f62>   DW_AT_decl_file   : 12
    <f63>   DW_AT_decl_line   : 110
    <f64>   DW_AT_decl_column : 16
    <f65>   DW_AT_sibling     : <0x1006>
 <2><f69>: Abbrev Number: 1 (DW_TAG_member)
    <f6a>   DW_AT_name        : (indirect string, offset: 0x86e38): Instance
    <f6e>   DW_AT_decl_file   : 12
    <f6f>   DW_AT_decl_line   : 112
    <f70>   DW_AT_decl_column : 31
    <f71>   DW_AT_type        : <0x1006>
    <f75>   DW_AT_data_member_location: 0
 <2><f76>: Abbrev Number: 1 (DW_TAG_member)
    <f77>   DW_AT_name        : (indirect string, offset: 0x8cd73): Init
    <f7b>   DW_AT_decl_file   : 12
    <f7c>   DW_AT_decl_line   : 114
    <f7d>   DW_AT_decl_column : 30
    <f7e>   DW_AT_type        : <0xf18>
    <f82>   DW_AT_data_member_location: 4
 <2><f83>: Abbrev Number: 1 (DW_TAG_member)
    <f84>   DW_AT_name        : (indirect string, offset: 0x5e161): Lock
    <f88>   DW_AT_decl_file   : 12
    <f89>   DW_AT_decl_line   : 116
    <f8a>   DW_AT_decl_column : 30
    <f8b>   DW_AT_type        : <0xea8>
    <f8f>   DW_AT_data_member_location: 32
 <2><f90>: Abbrev Number: 1 (DW_TAG_member)
    <f91>   DW_AT_name        : (indirect string, offset: 0x8cdf5): State
    <f95>   DW_AT_decl_file   : 12
    <f96>   DW_AT_decl_line   : 118
    <f97>   DW_AT_decl_column : 30
    <f98>   DW_AT_type        : <0xf57>
    <f9c>   DW_AT_data_member_location: 33
 <2><f9d>: Abbrev Number: 1 (DW_TAG_member)
    <f9e>   DW_AT_name        : (indirect string, offset: 0x86291): Parent
    <fa2>   DW_AT_decl_file   : 12
    <fa3>   DW_AT_decl_line   : 120
    <fa4>   DW_AT_decl_column : 31
    <fa5>   DW_AT_type        : <0x3cf>
    <fa9>   DW_AT_data_member_location: 36
 <2><faa>: Abbrev Number: 1 (DW_TAG_member)
    <fab>   DW_AT_name        : (indirect string, offset: 0x8c87d): XferCpltCallback
    <faf>   DW_AT_decl_file   : 12
    <fb0>   DW_AT_decl_line   : 122
    <fb1>   DW_AT_decl_column : 33
    <fb2>   DW_AT_type        : <0x101b>
    <fb6>   DW_AT_data_member_location: 40
 <2><fb7>: Abbrev Number: 1 (DW_TAG_member)
    <fb8>   DW_AT_name        : (indirect string, offset: 0x8a7e7): XferHalfCpltCallback
    <fbc>   DW_AT_decl_file   : 12
    <fbd>   DW_AT_decl_line   : 124
    <fbe>   DW_AT_decl_column : 33
    <fbf>   DW_AT_type        : <0x101b>
    <fc3>   DW_AT_data_member_location: 44
 <2><fc4>: Abbrev Number: 1 (DW_TAG_member)
    <fc5>   DW_AT_name        : (indirect string, offset: 0x84ab9): XferErrorCallback
    <fc9>   DW_AT_decl_file   : 12
    <fca>   DW_AT_decl_line   : 126
    <fcb>   DW_AT_decl_column : 33
    <fcc>   DW_AT_type        : <0x101b>
    <fd0>   DW_AT_data_member_location: 48
 <2><fd1>: Abbrev Number: 1 (DW_TAG_member)
    <fd2>   DW_AT_name        : (indirect string, offset: 0x8bede): XferAbortCallback
    <fd6>   DW_AT_decl_file   : 12
    <fd7>   DW_AT_decl_line   : 128
    <fd8>   DW_AT_decl_column : 33
    <fd9>   DW_AT_type        : <0x101b>
    <fdd>   DW_AT_data_member_location: 52
 <2><fde>: Abbrev Number: 1 (DW_TAG_member)
    <fdf>   DW_AT_name        : (indirect string, offset: 0x8c5f1): ErrorCode
    <fe3>   DW_AT_decl_file   : 12
    <fe4>   DW_AT_decl_line   : 130
    <fe5>   DW_AT_decl_column : 30
    <fe6>   DW_AT_type        : <0x3ba>
    <fea>   DW_AT_data_member_location: 56
 <2><feb>: Abbrev Number: 1 (DW_TAG_member)
    <fec>   DW_AT_name        : (indirect string, offset: 0x8725e): DmaBaseAddress
    <ff0>   DW_AT_decl_file   : 12
    <ff1>   DW_AT_decl_line   : 132
    <ff2>   DW_AT_decl_column : 31
    <ff3>   DW_AT_type        : <0x1020>
    <ff7>   DW_AT_data_member_location: 60
 <2><ff8>: Abbrev Number: 1 (DW_TAG_member)
    <ff9>   DW_AT_name        : (indirect string, offset: 0x8536e): ChannelIndex
    <ffd>   DW_AT_decl_file   : 12
    <ffe>   DW_AT_decl_line   : 134
    <fff>   DW_AT_decl_column : 30
    <1000>   DW_AT_type        : <0x3ae>
    <1004>   DW_AT_data_member_location: 64
 <2><1005>: Abbrev Number: 0
 <1><1006>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <1007>   DW_AT_byte_size   : 4
    <1007>   DW_AT_type        : <0xbef>
 <1><100b>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <100c>   DW_AT_prototyped  : 1
    <100c>   DW_AT_sibling     : <0x1016>
 <2><1010>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <1011>   DW_AT_type        : <0x1016>
 <2><1015>: Abbrev Number: 0
 <1><1016>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <1017>   DW_AT_byte_size   : 4
    <1017>   DW_AT_type        : <0xf5c>
 <1><101b>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <101c>   DW_AT_byte_size   : 4
    <101c>   DW_AT_type        : <0x100b>
 <1><1020>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <1021>   DW_AT_byte_size   : 4
    <1021>   DW_AT_type        : <0xc22>
 <1><1025>: Abbrev Number: 5 (DW_TAG_typedef)
    <1026>   DW_AT_name        : (indirect string, offset: 0x8b2a9): DMA_HandleTypeDef
    <102a>   DW_AT_decl_file   : 12
    <102b>   DW_AT_decl_line   : 136
    <102c>   DW_AT_decl_column : 3
    <102d>   DW_AT_type        : <0xf5c>
 <1><1031>: Abbrev Number: 18 (DW_TAG_structure_type)
    <1032>   DW_AT_byte_size   : 24
    <1033>   DW_AT_decl_file   : 13
    <1034>   DW_AT_decl_line   : 46
    <1035>   DW_AT_decl_column : 9
    <1035>   DW_AT_sibling     : <0x1088>
 <2><1039>: Abbrev Number: 1 (DW_TAG_member)
    <103a>   DW_AT_name        : (indirect string, offset: 0x8d1c5): Prescaler
    <103e>   DW_AT_decl_file   : 13
    <103f>   DW_AT_decl_line   : 48
    <1040>   DW_AT_decl_column : 12
    <1041>   DW_AT_type        : <0x3ae>
    <1045>   DW_AT_data_member_location: 0
 <2><1046>: Abbrev Number: 1 (DW_TAG_member)
    <1047>   DW_AT_name        : (indirect string, offset: 0x8bbfd): CounterMode
    <104b>   DW_AT_decl_file   : 13
    <104c>   DW_AT_decl_line   : 51
    <104d>   DW_AT_decl_column : 12
    <104e>   DW_AT_type        : <0x3ae>
    <1052>   DW_AT_data_member_location: 4
 <2><1053>: Abbrev Number: 1 (DW_TAG_member)
    <1054>   DW_AT_name        : (indirect string, offset: 0x95bc6): Period
    <1058>   DW_AT_decl_file   : 13
    <1059>   DW_AT_decl_line   : 54
    <105a>   DW_AT_decl_column : 12
    <105b>   DW_AT_type        : <0x3ae>
    <105f>   DW_AT_data_member_location: 8
 <2><1060>: Abbrev Number: 1 (DW_TAG_member)
    <1061>   DW_AT_name        : (indirect string, offset: 0x86f5d): ClockDivision
    <1065>   DW_AT_decl_file   : 13
    <1066>   DW_AT_decl_line   : 58
    <1067>   DW_AT_decl_column : 12
    <1068>   DW_AT_type        : <0x3ae>
    <106c>   DW_AT_data_member_location: 12
 <2><106d>: Abbrev Number: 1 (DW_TAG_member)
    <106e>   DW_AT_name        : (indirect string, offset: 0x89b5e): RepetitionCounter
    <1072>   DW_AT_decl_file   : 13
    <1073>   DW_AT_decl_line   : 61
    <1074>   DW_AT_decl_column : 12
    <1075>   DW_AT_type        : <0x3ae>
    <1079>   DW_AT_data_member_location: 16
 <2><107a>: Abbrev Number: 1 (DW_TAG_member)
    <107b>   DW_AT_name        : (indirect string, offset: 0x84370): AutoReloadPreload
    <107f>   DW_AT_decl_file   : 13
    <1080>   DW_AT_decl_line   : 72
    <1081>   DW_AT_decl_column : 12
    <1082>   DW_AT_type        : <0x3ae>
    <1086>   DW_AT_data_member_location: 20
 <2><1087>: Abbrev Number: 0
 <1><1088>: Abbrev Number: 5 (DW_TAG_typedef)
    <1089>   DW_AT_name        : (indirect string, offset: 0x8ba05): TIM_Base_InitTypeDef
    <108d>   DW_AT_decl_file   : 13
    <108e>   DW_AT_decl_line   : 74
    <108f>   DW_AT_decl_column : 3
    <1090>   DW_AT_type        : <0x1031>
 <1><1094>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <1095>   DW_AT_encoding    : 7	(unsigned)
    <1095>   DW_AT_byte_size   : 1
    <1095>   DW_AT_type        : <0x328>
    <1099>   DW_AT_decl_file   : 13
    <1099>   DW_AT_decl_line   : 291
    <109b>   DW_AT_decl_column : 1
    <109b>   DW_AT_sibling     : <0x10be>
 <2><109f>: Abbrev Number: 2 (DW_TAG_enumerator)
    <10a0>   DW_AT_name        : (indirect string, offset: 0x87c36): HAL_TIM_STATE_RESET
    <10a4>   DW_AT_const_value : 0
 <2><10a5>: Abbrev Number: 2 (DW_TAG_enumerator)
    <10a6>   DW_AT_name        : (indirect string, offset: 0x83c06): HAL_TIM_STATE_READY
    <10aa>   DW_AT_const_value : 1
 <2><10ab>: Abbrev Number: 2 (DW_TAG_enumerator)
    <10ac>   DW_AT_name        : (indirect string, offset: 0x85a69): HAL_TIM_STATE_BUSY
    <10b0>   DW_AT_const_value : 2
 <2><10b1>: Abbrev Number: 2 (DW_TAG_enumerator)
    <10b2>   DW_AT_name        : (indirect string, offset: 0x8b00b): HAL_TIM_STATE_TIMEOUT
    <10b6>   DW_AT_const_value : 3
 <2><10b7>: Abbrev Number: 2 (DW_TAG_enumerator)
    <10b8>   DW_AT_name        : (indirect string, offset: 0x868eb): HAL_TIM_STATE_ERROR
    <10bc>   DW_AT_const_value : 4
 <2><10bd>: Abbrev Number: 0
 <1><10be>: Abbrev Number: 10 (DW_TAG_typedef)
    <10bf>   DW_AT_name        : (indirect string, offset: 0x89d22): HAL_TIM_StateTypeDef
    <10c3>   DW_AT_decl_file   : 13
    <10c4>   DW_AT_decl_line   : 297
    <10c6>   DW_AT_decl_column : 3
    <10c7>   DW_AT_type        : <0x1094>
 <1><10cb>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <10cc>   DW_AT_type        : <0x10be>
 <1><10d0>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <10d1>   DW_AT_encoding    : 7	(unsigned)
    <10d1>   DW_AT_byte_size   : 1
    <10d1>   DW_AT_type        : <0x328>
    <10d5>   DW_AT_decl_file   : 13
    <10d5>   DW_AT_decl_line   : 303
    <10d7>   DW_AT_decl_column : 1
    <10d7>   DW_AT_sibling     : <0x10ee>
 <2><10db>: Abbrev Number: 2 (DW_TAG_enumerator)
    <10dc>   DW_AT_name        : (indirect string, offset: 0x89bca): HAL_TIM_CHANNEL_STATE_RESET
    <10e0>   DW_AT_const_value : 0
 <2><10e1>: Abbrev Number: 2 (DW_TAG_enumerator)
    <10e2>   DW_AT_name        : (indirect string, offset: 0x88894): HAL_TIM_CHANNEL_STATE_READY
    <10e6>   DW_AT_const_value : 1
 <2><10e7>: Abbrev Number: 2 (DW_TAG_enumerator)
    <10e8>   DW_AT_name        : (indirect string, offset: 0x8792d): HAL_TIM_CHANNEL_STATE_BUSY
    <10ec>   DW_AT_const_value : 2
 <2><10ed>: Abbrev Number: 0
 <1><10ee>: Abbrev Number: 10 (DW_TAG_typedef)
    <10ef>   DW_AT_name        : (indirect string, offset: 0x8537b): HAL_TIM_ChannelStateTypeDef
    <10f3>   DW_AT_decl_file   : 13
    <10f4>   DW_AT_decl_line   : 307
    <10f6>   DW_AT_decl_column : 3
    <10f7>   DW_AT_type        : <0x10d0>
 <1><10fb>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <10fc>   DW_AT_type        : <0x10ee>
 <1><1100>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <1101>   DW_AT_encoding    : 7	(unsigned)
    <1101>   DW_AT_byte_size   : 1
    <1101>   DW_AT_type        : <0x328>
    <1105>   DW_AT_decl_file   : 13
    <1105>   DW_AT_decl_line   : 313
    <1107>   DW_AT_decl_column : 1
    <1107>   DW_AT_sibling     : <0x111e>
 <2><110b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <110c>   DW_AT_name        : (indirect string, offset: 0x839ae): HAL_DMA_BURST_STATE_RESET
    <1110>   DW_AT_const_value : 0
 <2><1111>: Abbrev Number: 2 (DW_TAG_enumerator)
    <1112>   DW_AT_name        : (indirect string, offset: 0x8829a): HAL_DMA_BURST_STATE_READY
    <1116>   DW_AT_const_value : 1
 <2><1117>: Abbrev Number: 2 (DW_TAG_enumerator)
    <1118>   DW_AT_name        : (indirect string, offset: 0x8a072): HAL_DMA_BURST_STATE_BUSY
    <111c>   DW_AT_const_value : 2
 <2><111d>: Abbrev Number: 0
 <1><111e>: Abbrev Number: 10 (DW_TAG_typedef)
    <111f>   DW_AT_name        : (indirect string, offset: 0x84987): HAL_TIM_DMABurstStateTypeDef
    <1123>   DW_AT_decl_file   : 13
    <1124>   DW_AT_decl_line   : 317
    <1126>   DW_AT_decl_column : 3
    <1127>   DW_AT_type        : <0x1100>
 <1><112b>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <112c>   DW_AT_type        : <0x111e>
 <1><1130>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <1131>   DW_AT_encoding    : 7	(unsigned)
    <1131>   DW_AT_byte_size   : 1
    <1131>   DW_AT_type        : <0x328>
    <1135>   DW_AT_decl_file   : 13
    <1135>   DW_AT_decl_line   : 323
    <1137>   DW_AT_decl_column : 1
    <1137>   DW_AT_sibling     : <0x115a>
 <2><113b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <113c>   DW_AT_name        : (indirect string, offset: 0x883e7): HAL_TIM_ACTIVE_CHANNEL_1
    <1140>   DW_AT_const_value : 1
 <2><1141>: Abbrev Number: 2 (DW_TAG_enumerator)
    <1142>   DW_AT_name        : (indirect string, offset: 0x88400): HAL_TIM_ACTIVE_CHANNEL_2
    <1146>   DW_AT_const_value : 2
 <2><1147>: Abbrev Number: 2 (DW_TAG_enumerator)
    <1148>   DW_AT_name        : (indirect string, offset: 0x88419): HAL_TIM_ACTIVE_CHANNEL_3
    <114c>   DW_AT_const_value : 4
 <2><114d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <114e>   DW_AT_name        : (indirect string, offset: 0x88432): HAL_TIM_ACTIVE_CHANNEL_4
    <1152>   DW_AT_const_value : 8
 <2><1153>: Abbrev Number: 2 (DW_TAG_enumerator)
    <1154>   DW_AT_name        : (indirect string, offset: 0x8701b): HAL_TIM_ACTIVE_CHANNEL_CLEARED
    <1158>   DW_AT_const_value : 0
 <2><1159>: Abbrev Number: 0
 <1><115a>: Abbrev Number: 10 (DW_TAG_typedef)
    <115b>   DW_AT_name        : (indirect string, offset: 0x85280): HAL_TIM_ActiveChannel
    <115f>   DW_AT_decl_file   : 13
    <1160>   DW_AT_decl_line   : 329
    <1162>   DW_AT_decl_column : 3
    <1163>   DW_AT_type        : <0x1130>
 <1><1167>: Abbrev Number: 15 (DW_TAG_structure_type)
    <1168>   DW_AT_byte_size   : 72
    <1169>   DW_AT_decl_file   : 13
    <116a>   DW_AT_decl_line   : 337
    <116c>   DW_AT_decl_column : 9
    <116c>   DW_AT_sibling     : <0x11ef>
 <2><1170>: Abbrev Number: 3 (DW_TAG_member)
    <1171>   DW_AT_name        : (indirect string, offset: 0x86e38): Instance
    <1175>   DW_AT_decl_file   : 13
    <1176>   DW_AT_decl_line   : 340
    <1178>   DW_AT_decl_column : 39
    <1179>   DW_AT_type        : <0x11ef>
    <117d>   DW_AT_data_member_location: 0
 <2><117e>: Abbrev Number: 3 (DW_TAG_member)
    <117f>   DW_AT_name        : (indirect string, offset: 0x8cd73): Init
    <1183>   DW_AT_decl_file   : 13
    <1184>   DW_AT_decl_line   : 341
    <1186>   DW_AT_decl_column : 38
    <1187>   DW_AT_type        : <0x1088>
    <118b>   DW_AT_data_member_location: 4
 <2><118c>: Abbrev Number: 3 (DW_TAG_member)
    <118d>   DW_AT_name        : (indirect string, offset: 0x8528e): Channel
    <1191>   DW_AT_decl_file   : 13
    <1192>   DW_AT_decl_line   : 342
    <1194>   DW_AT_decl_column : 38
    <1195>   DW_AT_type        : <0x115a>
    <1199>   DW_AT_data_member_location: 28
 <2><119a>: Abbrev Number: 3 (DW_TAG_member)
    <119b>   DW_AT_name        : (indirect string, offset: 0x889db): hdma
    <119f>   DW_AT_decl_file   : 13
    <11a0>   DW_AT_decl_line   : 343
    <11a2>   DW_AT_decl_column : 39
    <11a3>   DW_AT_type        : <0x11f4>
    <11a7>   DW_AT_data_member_location: 32
 <2><11a8>: Abbrev Number: 3 (DW_TAG_member)
    <11a9>   DW_AT_name        : (indirect string, offset: 0x5e161): Lock
    <11ad>   DW_AT_decl_file   : 13
    <11ae>   DW_AT_decl_line   : 345
    <11b0>   DW_AT_decl_column : 38
    <11b1>   DW_AT_type        : <0xea8>
    <11b5>   DW_AT_data_member_location: 60
 <2><11b6>: Abbrev Number: 3 (DW_TAG_member)
